{
    "ae-100": {
        "id": "ae-100",
        "course_id": "Ae 100",
        "name": "Research in Aerospace",
        "units": "",
        "terms": "",
        "description": "Open to suitably qualified undergraduates and first-year graduate students under the direction of the staff. Credit is based on the satisfactory completion of a substantive research report, which must be approved by the Ae 100 adviser and by the option representative.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#research-in-aerospace",
        "prereq_text": "",
        "prereqs": []
    },
    "aeaphceme-101-abc": {
        "id": "aeaphceme-101-abc",
        "course_id": "Ae/APh/CE/ME 101 abc",
        "name": "Fluid Mechanics",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Fundamentals of fluid mechanics. Microscopic and macroscopic properties of liquids and gases; the continuum hypothesis; review of thermodynamics; general equations of motion; kinematics; stresses; constitutive relations; vorticity, circulation; Bernoulli's equation; potential flow; thin-airfoil theory; surface gravity waves; buoyancy-driven flows; rotating flows; viscous creeping flow; viscous boundary layers; introduction to stability and turbulence; quasi one-dimensional compressible flow; shock waves; unsteady compressible flow; and acoustics.",
        "offered": true,
        "instructors": "Bae, Pullin, Colonius",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#fluid-mechanics",
        "prereq_text": "Prerequisites: APh 17 or ME 11 abc, and ME 12 or equivalent, ACM 95/100 or equivalent (may be taken concurrently).",
        "prereqs": [
            "me-12-abc",
            "acm-95100-ab",
            "me-11-abc",
            "aph-17-abc"
        ]
    },
    "aeamceme-102-abc": {
        "id": "aeamceme-102-abc",
        "course_id": "Ae/AM/CE/ME 102 abc",
        "name": "Mechanics of Structures and Solids",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Introduction to continuum mechanics: kinematics, balance laws, constitutive laws with an emphasis on solids. Static and dynamic stress analysis. Two- and three-dimensional theory of stressed elastic solids. Wave propagation. Analysis of rods, plates and shells with applications in a variety of fields. Variational theorems and approximate solutions. Elastic stability.",
        "offered": true,
        "instructors": "Lapusta, Ravichandran",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#mechanics-of-structures-and-solids",
        "prereq_text": "Prerequisites: ME 12 abc.",
        "prereqs": [
            "me-12-abc"
        ]
    },
    "ae-103-ab": {
        "id": "ae-103-ab",
        "course_id": "Ae 103 ab",
        "name": "Aerospace Control Systems",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "Part a: Linear state space systems, including concepts of controllability/reachability and observability. State feedback and optimal control. Frequency domain tools (Bode plots, Nyquist analysis, input/output performance). Part b: Optimization-based design of control systems, including optimal control and receding horizon control. Introductory random processes and optimal estimation. Kalman filtering and nonlinear filtering methods for autonomous systems.",
        "offered": true,
        "instructors": "Rahmani",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#aerospace-control-systems",
        "prereq_text": "Prerequisites: ACM 104, as well as ACM 100 a (or equivalent), can be taken concurrently.",
        "prereqs": []
    },
    "aeaph-104-abc": {
        "id": "aeaph-104-abc",
        "course_id": "Ae/APh 104 abc",
        "name": "Experimental Methods",
        "units": "9 units (3-0-6) first term; (0-6-3) second, third terms",
        "terms": "first, second, third terms",
        "description": "Lectures on experiment design and implementation. Measurement methods, transducer fundamentals, instrumentation, optical systems, signal processing, noise theory, analog and digital electronic fundamentals, with data acquisition and processing systems. Experiments (second and third terms) in solid and fluid mechanics with emphasis on current research methods.",
        "offered": true,
        "instructors": "Dabiri",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#experimental-methods",
        "prereq_text": "Prerequisites: ACM 95/100 ab or equivalent (may be taken concurrently), Ae/APh/CE/ME 101 abc or equivalent (may be taken concurrently).",
        "prereqs": [
            "acm-95100-ab",
            "aeaphceme-101-abc"
        ]
    },
    "ae-105-abc": {
        "id": "ae-105-abc",
        "course_id": "Ae 105 abc",
        "name": "Space Engineering",
        "units": "9 units (3-0-6) first term, (2-4-3) second term, (0-8-1) third term",
        "terms": "first, second, third terms",
        "description": "Part a: Design of space missions based on astrodynamics. Topics include conic orbits with perturbations (J2, drag, and solar radiation pressure), Lambert's Theorem, periodic orbits and ground tracks, invariant manifolds, and the variational equation with mission applications to planetary flybys, constellation, formation flying, and low energy planetary capture and landing. Part b: Introduction to spacecraft systems and subsystems, mission design, rocket mechanics, launch vehicles, and space environments; spacecraft mechanical, structural, and thermal design; communication and power systems; preliminary discussion and setup for team project leading to system requirements review. Part c: Team project leading to preliminary design review and critical design review.",
        "offered": true,
        "instructors": "Campagnola, Watkins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#space-engineering",
        "prereq_text": "Prerequisites: ME 11 abc and ME 12 abc or equivalent.",
        "prereqs": [
            "me-12-abc",
            "me-11-abc"
        ]
    },
    "ceaeam-108": {
        "id": "ceaeam-108",
        "course_id": "CE/Ae/AM 108",
        "name": "Computational Mechanics",
        "units": "9 units (3-5-1)",
        "terms": "first, second terms",
        "description": "Numerical methods and techniques for solving initial boundary value problems in continuum mechanics (from heat conduction to statics and dynamics of solids and structures). Finite difference methods, direct methods, variational methods, finite elements in small strains and at finite deformation for applications in structural mechanics and solid mechanics. Solution of the partial differential equations of heat transfer, solid and structural mechanics, and fluid mechanics. Transient and nonlinear problems. Computational aspects and development and use of finite element code.",
        "offered": true,
        "instructors": "Ramarathinam",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#computational-mechanics",
        "prereq_text": "Prerequisites: Ae/AM/ME/CE 102 abc or Ae/GE/ME 160 ab, or instructor's permission.",
        "prereqs": [
            "aegeme-160-ab"
        ]
    },
    "ae-115-ab": {
        "id": "ae-115-ab",
        "course_id": "Ae 115 ab",
        "name": "Spacecraft Navigation",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "This course will survey all aspects of modern spacecraft navigation, including astrodynamics, tracking systems for both low-Earth and deep-space applications (including the Global Positioning System and the Deep Space Network observables), and the statistical orbit determination problem (in both the batch and sequential Kalman filter implementations). The course will describe some of the scientific applications directly derived from precision orbital knowledge, such as planetary gravity field and topography modeling. Numerous examples drawn from actual missions as navigated at JPL will be discussed.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#spacecraft-navigation",
        "prereq_text": "Prerequisites: CDS 110 a.",
        "prereqs": []
    },
    "aeme-118": {
        "id": "aeme-118",
        "course_id": "Ae/ME 118",
        "name": "Classical Thermodynamics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Fundamentals of Classical Thermodynamics. Basic laws of thermodynamics, work and heat, entropy and available work, and thermal systems. Equations of state, compressibility functions, and the Law of Corresponding States. Thermodynamic potentials, phase equilibrium, phase transitions, and thermodynamic properties of solids, liquids, and gases. Examples will be drawn from fluid dynamics, solid mechanics, energy systems, and thermal-science applications.",
        "offered": true,
        "instructors": "Minnich",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#classical-thermodynamics",
        "prereq_text": "Prerequisites: ME 11 abc, ME 12 abc, or equivalent.",
        "prereqs": [
            "me-12-abc",
            "me-11-abc"
        ]
    },
    "meae-120": {
        "id": "meae-120",
        "course_id": "ME/Ae 120",
        "name": "Combustion Fundamentals",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Blanquart",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#combustion-fundamentals",
        "prereq_text": "Prerequisites: ME 11 abc or equivalent, ACM 95/100 or equivalent (may be taken concurrently).",
        "prereqs": [
            "acm-95100-ab",
            "me-11-abc"
        ]
    },
    "ae-121-abc": {
        "id": "ae-121-abc",
        "course_id": "Ae 121 abc",
        "name": "Space Propulsion",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Ae 121 is designed to introduce the fundamentals of chemical, electric and advanced propulsion technologies.  The course focuses on the thermochemistry and aerodynamics of chemical and electrothermal propulsion systems, the physics of ionized gases and electrostatic and electromagnetic processes in electric thrusters.  These analyses provide the opportunity to introduce the basic concepts of non-equilibrium gas dynamics and kinetic theory. Specific technologies such as launch vehicle rocket engines, monopropellant engines, arcjets, ion thrusters, magnetoplasmadynamic engines and Hall thrusters will be discussed.  Ae 121 also provides an introduction to advanced propulsion concepts such as solar sails and antimatter rockets.",
        "offered": true,
        "instructors": "Polk",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#space-propulsion",
        "prereq_text": "Prerequisites: Open to all graduate students and to seniors with instructor's permission.",
        "prereqs": []
    },
    "ae-150-abc": {
        "id": "ae-150-abc",
        "course_id": "Ae 150 abc",
        "name": "Aerospace Engineering Seminar",
        "units": "1 unit",
        "terms": "first, second, third terms",
        "description": "Speakers from campus and outside research and manufacturing organizations discuss current problems and advances in aerospace engineering. Graded pass/fail.",
        "offered": true,
        "instructors": "Austin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#aerospace-engineering-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "aphphaems-153": {
        "id": "aphphaems-153",
        "course_id": "APh/Ph/Ae/MS 153",
        "name": "Fundamentals of Energy and Mass Transport in Small Scale Systems",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The design of instrumentation for cooling, sensing or measurement in microsystems requires special knowledge of the evolution and propagation of thermal and concentration gradients in confined geometries, which ultimately control the degree of maximum energy and mass exchange. A significant challenge facing the microelectronics industry, for example, is mitigation of hot spots in densely packed high power chips for artificial intelligence to prevent thermal runaway. This course offers a concise treatment of the fundamentals of mass and energy transport by examining steady and unsteady diffusive and convective processes in small confined systems. Contrasts with macroscale behavior caused by the effects of small scale confinement and reduced dimensionality will be examined. Sample problems will be drawn from systems in applied physics, material science, electrical and bioengineering. Students must have working knowledge of vector calculus, ODEs, basic PDEs, and complex variables.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Troian",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#fundamentals-of-energy-and-mass-transport-in-small-scale-systems",
        "prereq_text": "Prerequisites: ACM 95/100 ab or equivalent.",
        "prereqs": [
            "acm-95100-ab"
        ]
    },
    "eeae-157-ab": {
        "id": "eeae-157-ab",
        "course_id": "EE/Ae 157 ab",
        "name": "Introduction to the Physics of Remote Sensing",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "An overview of the physics behind space remote sensing instruments. Topics include the interaction of electromagnetic waves with natural surfaces, including scattering of microwaves, microwave and thermal emission from atmospheres and surfaces, and spectral reflection from natural surfaces and atmospheres in the near-infrared and visible regions of the spectrum. The class also discusses the design of modern space sensors and associated technology, including sensor design, new observation techniques, ongoing developments, and data interpretation. Examples of applications and instrumentation in geology, planetology, oceanography, astronomy, and atmospheric research.\n Part a offered spring term; Part b not offered 2024-25",
        "offered": true,
        "instructors": "Rosen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#introduction-to-the-physics-of-remote-sensing",
        "prereq_text": "Prerequisites: Ph 2 or equivalent.",
        "prereqs": [
            "ph-2-abc"
        ]
    },
    "ae-159": {
        "id": "ae-159",
        "course_id": "Ae 159",
        "name": "Optical Engineering",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This class covers both the fundamentals of optical engineering and the development of space optical systems. Emphasis is on the design and engineering of optical, UV and IR systems for scientific remote sensing and imaging applications. Material covered is: first order optics to find the location, size and orientation of an image; geometrical aberration theory balancing tolerancing optical systems; transmittance, Etendu vignetting; radiative transfer; scalar vector wave propagation-physical optics; scalar diffraction image formation coherence; interferometry for the measurement of optical surfaces astronomy; optical metrology wavefront sensing control (A/O); segmented and sparse aperture telescopes; and design topics in coronagraphy, Fourier transform spectrometers, grating spectrometers, and large aperture telescopes. Space optics issues discussed will be segmented sparse aperture telescopes, radiation damage to glass, thermal and UV contamination.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#optical-engineering",
        "prereq_text": "Prerequisites: Ph 2, EE/Ae 157, or equivalent; APh 23 desirable.",
        "prereqs": [
            "ph-2-abc"
        ]
    },
    "aegeme-160-ab": {
        "id": "aegeme-160-ab",
        "course_id": "Ae/Ge/ME 160 ab",
        "name": "Continuum Mechanics of Fluids and Solids",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms.",
        "description": "Elements of Cartesian tensors. Configurations and motions of a body. Kinematics-study of deformations, rotations and stretches, polar decomposition. Lagrangian and Eulerian strain velocity and spin tensor fields. Irrotational motions, rigid motions. Kinetics-balance laws. Linear and angular momentum, force, traction stress. Cauchy's theorem, properties of Cauchy's stress. Equations of motion, equilibrium equations. Power theorem, nominal (Piola-Kirchoff) stress. Thermodynamics of bodies. Internal energy, heat flux, heat supply. Laws of thermodynamics, notions of entropy, absolute temperature. Entropy inequality (Clausius-Duhem). Examples of special classes of constitutive laws for materials without memory. Objective rates, corotational, convected rates. Principles of materials frame indifference. Examples: the isotropic Navier-Stokes fluid, the isotropic thermoelastic solid. Basics of finite differences, finite elements, and boundary integral methods, and their applications to continuum mechanics problems illustrating a variety of classes of constitutive laws.\n part b not offered 2024-25",
        "offered": true,
        "instructors": "Lapusta",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#continuum-mechanics-of-fluids-and-solids",
        "prereq_text": "",
        "prereqs": []
    },
    "aece-165-ab": {
        "id": "aece-165-ab",
        "course_id": "Ae/CE 165 ab",
        "name": "Mechanics of Composite Materials and Structures",
        "units": "9 units (2-2-5)",
        "terms": "first, second terms",
        "description": "",
        "offered": true,
        "instructors": "Pellegrino",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#mechanics-of-composite-materials-and-structures",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 abc or equivalent and/or instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "ae-200": {
        "id": "ae-200",
        "course_id": "Ae 200",
        "name": "Advanced Research in Aerospace",
        "units": "",
        "terms": "",
        "description": "Ae.E. or Ph.D. thesis level research under the direction of the staff. A written research report must be submitted during finals week each term.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#advanced-research-in-aerospace",
        "prereq_text": "",
        "prereqs": []
    },
    "ae-201-ab": {
        "id": "ae-201-ab",
        "course_id": "Ae 201 ab",
        "name": "Advanced Fluid Mechanics",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "",
        "offered": true,
        "instructors": "Dimotakis, Pullin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#advanced-fluid-mechanics",
        "prereq_text": "Prerequisites: Ae/APh/CE/ME 101abc, or equivalent; Ae/ME 118, or equivalent; ACM/IDS 101 (may be taken concurrently).",
        "prereqs": [
            "aeme-118",
            "acmids-101-ab",
            "aeaphceme-101-abc"
        ]
    },
    "ae-204-ab": {
        "id": "ae-204-ab",
        "course_id": "Ae 204 ab",
        "name": "Technical Fluid Mechanics",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "External and internal flow problems encountered in engineering, for which only empirical methods exist. Turbulent shear flow, separation, transition, three-dimensional and nonsteady effects. Basis of engineering practice in the design of devices such as mixers, ejectors, diffusers, and control valves. Studies of flow-induced oscillations, wind effects on structures, vehicle aerodynamics.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#technical-fluid-mechanics",
        "prereq_text": "Prerequisites: Ae/APh/CE/ME 101 abc or equivalent.",
        "prereqs": [
            "aeaphceme-101-abc"
        ]
    },
    "ae-205-ab": {
        "id": "ae-205-ab",
        "course_id": "Ae 205 ab",
        "name": "Advanced Space Project",
        "units": "9 units (2-4-3)",
        "terms": "second, third terms",
        "description": "This is an advanced course on the design and implementation of space projects and it is currently focused on the flight project Autonomous Assembly of a Reconfigurable Space Telescope (AAReST). The objective is to be ready for launch and operation in 2015. Each student will be responsible for a specific activity, chosen from the following: optimization of telescope system architecture; design, assembly and testing of telescope optics; telescope calibration procedure and algorithms for wavefront control; thermal analysis; boom design and deployment test methods; effects of spacecraft dynamics on telescope performance; environmental testing of telescope system. Each student will prepare a survey of the state of the art for the selected activity, and then develop a design/implementation plan, execute the plan and present the results in a final report.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#advanced-space-project",
        "prereq_text": "Prerequisites: Ae 105 abc.",
        "prereqs": []
    },
    "ae-208-abc": {
        "id": "ae-208-abc",
        "course_id": "Ae 208 abc",
        "name": "GALCIT Colloquium",
        "units": "1 unit",
        "terms": "first, second, third terms",
        "description": "A seminar course in fluid, solid, space, and bio mechanics. Weekly lectures on current developments are presented by staff members, graduate students, and visiting scientists and engineers. Graded pass/fail.",
        "offered": true,
        "instructors": "Gharib",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#galcit-colloquium",
        "prereq_text": "",
        "prereqs": []
    },
    "aeammsme-213": {
        "id": "aeammsme-213",
        "course_id": "Ae/AM/MS/ME 213",
        "name": "Mechanics and Materials Aspects of Fracture",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Analytical and experimental techniques in the study of fracture in metallic and nonmetallic solids. Mechanics of brittle and ductile fracture; connections between the continuum descriptions of fracture and micromechanisms. Discussion of elastic-plastic fracture analysis and fracture criteria. Special topics include fracture by cleavage, void growth, rate sensitivity, crack deflection and toughening mechanisms, as well as fracture of nontraditional materials. Fatigue crack growth and life prediction techniques will also be discussed. In addition, \"dynamic\" stress wave dominated, failure initiation growth and arrest phenomena will be covered. This will include traditional dynamic fracture considerations as well as discussions of failure by adiabatic shear localization.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#mechanics-and-materials-aspects-of-fracture",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 abc (concurrently) or equivalent and instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "aeamceme-214": {
        "id": "aeamceme-214",
        "course_id": "Ae/AM/CE/ME 214",
        "name": "Computational Solid Mechanics",
        "units": "9 units (3-5-1)",
        "terms": "second term",
        "description": "This course focuses on the analysis of elastic thin shell structures in the large deformation regime. Problems of interest include softening behavior, bifurcations, loss of stability and localization. Introduction to the use of numerical methods in the solution of solid mechanics and multiscale mechanics problems. Variational principles. Finite element and isogeometric formulations for thin shells. Time integration, initial boundary value problems. Error estimation. Accuracy, stability and convergence. Iterative solution methods. Adaptive strategies.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#computational-solid-mechanics",
        "prereq_text": "Prerequisites: ACM 100 ab or equivalent; CE/AM/Ae 108 ab or equivalent or instructor's permission; Ae/AM/CE/ME 102 abc or instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "aeamme-215": {
        "id": "aeamme-215",
        "course_id": "Ae/AM/ME 215",
        "name": "Dynamic Behavior of Materials",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Fundamentals of theory of wave propagation; plane waves, wave guides, dispersion relations; dynamic plasticity, adiabatic shear banding; dynamic fracture; shock waves, equation of state.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#dynamic-behavior-of-materials",
        "prereq_text": "Prerequisites: ACM 100 abc or AM 125 abc; Ae/AM/CE/ME 102 abc.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "aemeaph-218": {
        "id": "aemeaph-218",
        "course_id": "Ae/ME/APh 218",
        "name": "Statistical Mechanics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Overview of probability and statistics, and the Maxwell-Boltzmann distribution. Overview and elements of Quantum Mechanics, degenerate energy states, particles in a box, and energy-state phase space. Statistics of indistinguishable elementary particles, Fermi-Dirac and Bose-Einstein statistics, partition functions, connections with classical thermodynamics, and the Law of Equipartition. Examples from equilibrium in fluids, solid-state physics, and others.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#statistical-mechanics",
        "prereq_text": "Prerequisites: Ae/ME 118, or equivalent.",
        "prereqs": [
            "aeme-118"
        ]
    },
    "ae-220": {
        "id": "ae-220",
        "course_id": "Ae 220",
        "name": "Theory of Structures",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Fundamentals of buckling and stability, total potential energy and equilibrium approaches; snap-through and bifurcation instabilities; eigenvalues and eigenvectors of stiffness matrix; Rayleigh-Ritz estimates of buckling loads; buckling of rods; imperfection sensitivity; elastic-plastic buckling; buckling of plates and shells. Selected topics: localization and wrinkling of membranes and solids; stability landscapes for shells and other topics.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Pellegrino",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#theory-of-structures",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 abc.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "aece-221": {
        "id": "aece-221",
        "course_id": "Ae/CE 221",
        "name": "Space Structures",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course examines the links between form, geometric shape, and structural performance. It deals with different ways of breaking up a continuum, and how this affects global structural properties; structural concepts and preliminary design methods that are used in tension structures and deployable structures. Geometric foundations, polyhedra and tessellations, surfaces; space frames, examples of space frames, stiffness and structural efficiency of frames with different repeating units; sandwich plates; cable and membrane structures, form-finding, wrinkle-free pneumatic domes, balloons, tension-stabilized struts, tensegrity domes; deployable and adaptive structures, coiled rods and their applications, flexible shells, membranes, structural mechanisms, actuators, concepts for adaptive trusses and manipulators.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#space-structures",
        "prereq_text": "",
        "prereqs": []
    },
    "aeamme-223": {
        "id": "aeamme-223",
        "course_id": "Ae/AM/ME 223",
        "name": "Plasticity",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Theory of dislocations in crystalline media. Characteristics of dislocations and their influence on the mechanical behavior in various crystal structures. Application of dislocation theory to single and polycrystal plasticity. Theory of the inelastic behavior of materials with negligible time effects. Experimental background for metals and fundamental postulates for plastic stress-strain relations. Variational principles for incremental elastic-plastic problems, uniqueness. Upper and lower bound theorems of limit analysis and shakedown. Slip line theory and applications. Additional topics may include soils, creep and rate-sensitive effects in metals, the thermodynamics of plastic deformation, and experimental methods in plasticity.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#plasticity",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 abc or instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "memsaeam-224": {
        "id": "memsaeam-224",
        "course_id": "ME/MS/Ae/AM 224",
        "name": "Multifunctional Materials",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Multiscale view of materials and different approaches of introducing functionality; Electronic aspects and multiferroic materials; Symmetry breaking phase transformations, microstructure: shape-memory alloys, ferroelectrics, liquid crystal elastomers; Composite materials and metamaterials: multifunctional structures.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#multifunctional-materials",
        "prereq_text": "Prerequisites: MS 115 or equivalent, Ae/AM/CE/ME 102 abc or APh 105 abc (may be waived with instructor's permission).",
        "prereqs": [
            "ph-105",
            "aeamceme-102-abc"
        ]
    },
    "aeammege-225": {
        "id": "aeammege-225",
        "course_id": "Ae/AM/ME/Ge 225",
        "name": "Special Topics in Solid Mechanics",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Subject matter changes depending on staff and student interest.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#special-topics-in-solid-mechanics",
        "prereq_text": "",
        "prereqs": []
    },
    "aeacmme-232-ab": {
        "id": "aeacmme-232-ab",
        "course_id": "Ae/ACM/ME 232 ab",
        "name": "Computational Fluid Dynamics",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "Development and analysis of algorithms used in the solution of fluid mechanics problems. Numerical analysis of discretization schemes for partial differential equations including interpolation, integration, spatial discretization, systems of ordinary differential equations; stability, accuracy, aliasing, Gibbs and Runge phenomena, numerical dissipation and dispersion; boundary conditions. Survey of finite difference, finite element, finite volume and spectral approximations for the numerical solution of the incompressible and compressible Euler and Navier-Stokes equations, including shock-capturing methods.",
        "offered": true,
        "instructors": "Bae, Meiron",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#computational-fluid-dynamics",
        "prereq_text": "Prerequisites: Ae/APh/CE/ME 101 abc or equivalent; ACM 100 ab or equivalent; ACM 104.",
        "prereqs": [
            "aeaphceme-101-abc"
        ]
    },
    "ae-233": {
        "id": "ae-233",
        "course_id": "Ae 233",
        "name": "Hydrodynamic Stability",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#hydrodynamic-stability",
        "prereq_text": "Prerequisites: ACM 95/100 ab, ACM 104 or equivalent and Ae/APh/CE/ME 101 abc.",
        "prereqs": [
            "acm-95100-ab",
            "aeaphceme-101-abc"
        ]
    },
    "ae-234-ab": {
        "id": "ae-234-ab",
        "course_id": "Ae 234 ab",
        "name": "Hypersonic Aerodynamics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "An advanced course dealing with aerodynamic problems of flight at hyper-sonic speeds. Topics are selected from hypersonic small-disturbance theory, blunt-body theory, boundary layers and shock waves in real gases, heat and mass transfer, testing facilities and experiment.\n Not offered 2024-25",
        "offered": false,
        "instructors": "Austin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#hypersonic-aerodynamics",
        "prereq_text": "Prerequisites: Ae/APh/CE/ME 101 abc or equivalent, AM 125 abc, or instructor's permission.",
        "prereqs": [
            "aeaphceme-101-abc"
        ]
    },
    "ae-235": {
        "id": "ae-235",
        "course_id": "Ae 235",
        "name": "Rarefied Gasdynamics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Molecular description of matter; distribution functions; discrete-velocity gases. Kinetic theory: free-path theory, internal degrees of freedom. Boltzmann equation: BBGKY hierarchy and closure, H theorem, Euler equations, Chapman-Enskog procedure, free-molecule flows. Collisionless and transitional flows. Direct simulation Monte Carlo methods. Applications.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#rarefied-gasdynamics",
        "prereq_text": "",
        "prereqs": []
    },
    "ae-237-ab": {
        "id": "ae-237-ab",
        "course_id": "Ae 237 ab",
        "name": "Nonsteady Gasdynamics",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Austin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#nonsteady-gasdynamics",
        "prereq_text": "Prerequisites: Ae/APh/CE/ME 101 abc, ACM100ab or ACM101ab, or instructor's permission.",
        "prereqs": [
            "aeaphceme-101-abc"
        ]
    },
    "ae-239-ab": {
        "id": "ae-239-ab",
        "course_id": "Ae 239 ab",
        "name": "Turbulence",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Reynolds number, transition from steady to unsteady, chaotic, and turbulent flow. Reynolds-averaged equations. Statistical description of turbulence. Physical and spectral models. Homogeneous isotropic turbulence, intermediate and small scales. Large-scale structure, and turbulent free and wall-bounded shear flows. Turbulent mixing.\n Part b not offered in 2024-25.",
        "offered": true,
        "instructors": "Dimotakis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#turbulence",
        "prereq_text": "Prerequisites: Ae/APh/CE/ME 101abc, or equivalent; ACM 95/100ab. Recommended: ACM/IDS 101 (may be taken concurrently); Ae233.",
        "prereqs": [
            "acmids-101-ab",
            "acm-95100-ab",
            "aeaphceme-101-abc"
        ]
    },
    "ae-240": {
        "id": "ae-240",
        "course_id": "Ae 240",
        "name": "Special Topics in Fluid Mechanics",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Topics and subject matter descriptions change each year depending upon staff and student interest.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#special-topics-in-fluid-mechanics",
        "prereq_text": "",
        "prereqs": []
    },
    "ae-241": {
        "id": "ae-241",
        "course_id": "Ae 241",
        "name": "Special Topics in Experimental Fluid and Solid Mechanics",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Subject matter changes depending upon staff and student interest.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#special-topics-in-experimental-fluid-and-solid-mechanics",
        "prereq_text": "Prerequisites: Ae/APh 104 or equivalent or instructor's permission.",
        "prereqs": [
            "aeaph-104-abc",
            "ayph-104"
        ]
    },
    "aebe-242": {
        "id": "aebe-242",
        "course_id": "Ae/BE 242",
        "name": "Biological Flows: Propulsion",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Physical principles of unsteady fluid momentum transport: equations of motion, dimensional analysis, conservation laws. Unsteady vortex dynamics: vorticity generation and dynamics, vortex dipoles/rings, wake structure in unsteady flows. Life in moving fluids: unsteady drag, added-mass effects, virtual buoyancy, bounding and schooling, wake capture. Thrust generation by flapping, undulating, rowing, jetting. Low Reynolds number propulsion. Bioinspired design of propulsion devices.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#biological-flows:-propulsion",
        "prereq_text": "Prerequisites: Ae/APh/CE/ME 101 abc or equivalent or ChE 103 a.",
        "prereqs": [
            "aeaphceme-101-abc"
        ]
    },
    "medebeae-243": {
        "id": "medebeae-243",
        "course_id": "MedE/BE/Ae 243",
        "name": "Physiological Mechanics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Internal flows: steady and pulsatile blood flow in compliant vessels, internal flows in organisms. Fluid dynamics of the human circulatory system: heart, veins, and arteries (microcirculation). Mass and momentum transport across membranes and endothelial layers. Fluid mechanics of the respiratory system. Renal circulation and circulatory system. Biological pumps. Low and High Reynolds number locomotion.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#physiological-mechanics",
        "prereq_text": "Prerequisites: Ae/APh/CE/ME 101 abc or equivalent or ChE 103 a.",
        "prereqs": [
            "aeaphceme-101-abc"
        ]
    },
    "ae-250": {
        "id": "ae-250",
        "course_id": "Ae 250",
        "name": "Reading and Independent Study",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Graded pass/fail only.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#reading-and-independent-study",
        "prereq_text": "",
        "prereqs": []
    },
    "aecdsme-251-ab": {
        "id": "aecdsme-251-ab",
        "course_id": "Ae/CDS/ME 251 ab",
        "name": "Closed Loop Flow Control",
        "units": "9 units (3-0-6 a, 1-6-1 b)",
        "terms": "second, third term",
        "description": "This course seeks to introduce students to recent developments in theoretical and practical aspects of applying control to flow phenomena and fluid systems. Lecture topics in the second term drawn from: the objectives of flow control; a review of relevant concepts from classical and modern control theory; high-fidelity and reduced-order modeling; principles and design of actuators and sensors. Third term: laboratory work in open- and closed-loop control of boundary layers, turbulence, aerodynamic forces, bluff body drag, combustion oscillations and flow-acoustic oscillations.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#closed-loop-flow-control",
        "prereq_text": "Prerequisites: ACM 100 abc, Ae/APh/CE/ME 101 abc or equivalent.",
        "prereqs": [
            "aeaphceme-101-abc"
        ]
    },
    "aeamcemege-265-ab": {
        "id": "aeamcemege-265-ab",
        "course_id": "Ae/AM/CE/ME/Ge 265 ab",
        "name": "Static and Dynamic Failure of Brittle Solids and Interfaces, from the Micro to the Mega",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Linear elastic fracture mechanics of homogeneous brittle solids (e.g. geo-materials, ceramics, metallic glasses); small scale yielding concepts; experimental methods in fracture, fracture of bi-material interfaces with applications to composites as well as bonded and layered engineering and geological structures; thin-film and micro-electronic components and systems; dynamic fracture mechanics of homogeneous engineering materials; dynamic shear dominated failure of coherent and incoherent interfaces at all length scales; dynamic rupture of frictional interfaces with application to earthquake source mechanics; allowable rupture speeds regimes and connections to earthquake seismology and the generation of Tsunamis.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#static-and-dynamic-failure-of-brittle-solids-and-interfaces,-from-the-micro-to-the-mega",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 abc (concurrently) or equivalent and/or instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "megeae-266-ab": {
        "id": "megeae-266-ab",
        "course_id": "ME/Ge/Ae 266 ab",
        "name": "Fracture and Frictional Faulting",
        "units": "9 units (3-0-6)",
        "terms": "second",
        "description": "Introduction to elastodynamics and waves in solids. Fracture theory, energy concepts, cohesive zone models. Friction laws, nucleation of frictional instabilities, rupture of frictional interfaces. Radiation from moving cracks. Thermal effects during dynamic fracture and faulting. Interaction of faulting with fluids. Applications to engineering phenomena a physics and mechanics of earthquakes.",
        "offered": true,
        "instructors": "Lapusta",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ae/#fracture-and-frictional-faulting",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 a or Ae/Ge/ME 160 a or instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc",
            "aegeme-160-ab"
        ]
    }
}