{
    "ay-1": {
        "id": "ay-1",
        "course_id": "Ay 1",
        "name": "The Evolving Universe",
        "units": "9 units (3-1-5)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Mawet",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#the-evolving-universe",
        "prereq_text": "",
        "prereqs": []
    },
    "fsay-3": {
        "id": "fsay-3",
        "course_id": "FS/Ay 3",
        "name": "First-Year Seminar: Automating Discovering the Universe",
        "units": "6 units (2-0-4)",
        "terms": "",
        "description": "Powerful new instruments enable astronomers to collect huge volumes of data on billions of objects. As a result, astronomy is changing dramatically: by the end of this decade, most astronomers will probably be analyzing data collected in large surveys, and only a few will still be visiting observatories to collect their own data. The tool chest of future astronomers will involve facility with \"big data\", developing clever queries, algorithms (some based on machine learning) and statistics, and combining multiple databases. This course will introduce students to some of these tools. After \"recovering\" known objects, students will be unleashed to make their own astronomical discoveries in new data sets. Limited enrollment.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#first-year-seminar:-automating-discovering-the-universe",
        "prereq_text": "",
        "prereqs": []
    },
    "geay-11-c": {
        "id": "geay-11-c",
        "course_id": "Ge/Ay 11 c",
        "name": "Introduction to Earth and Planetary Sciences: Planetary Sciences",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A broad introduction to the present state and early history of the solar system, including terrestrial planets, giant planets, moons, asteroids, comets, and rings. Earth-based observations, observations by planetary spacecraft, study of meteorites, and observations of extrasolar planets are used to constrain models of the dynamical and chemical processes of planetary systems. Although Ge 11 abcd is designed as a sequence, any one term may be taken as a standalone course. Physicists and astronomers are particularly welcome.",
        "offered": true,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#introduction-to-earth-and-planetary-sciences:-planetary-sciences",
        "prereq_text": "Prerequisites: Ma 1 ab, Ph 1 ab.",
        "prereqs": [
            "ma-1-d",
            "ph-1-abc",
            "ma-1-abc"
        ]
    },
    "ay-20": {
        "id": "ay-20",
        "course_id": "Ay 20",
        "name": "Basic Astronomy and the Galaxy",
        "units": "9 units (3-1-5)",
        "terms": "first term",
        "description": "The electromagnetic spectrum and basic radiative transfer; ground and space observing techniques; basic astrophysical optics; Kepler's laws; binary stars and exoplanets; stellar masses, distances, and motions; the birth, structure, evolution, and death of stars; the structure and dynamics of the Galaxy. Lessons will emphasize the use of order-of-magnitude calculations and scaling arguments in order to elucidate the physics of astrophysical phenomena. Short labs will introduce astronomical measurement techniques.",
        "offered": true,
        "instructors": "Hillenbrand",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#basic-astronomy-and-the-galaxy",
        "prereq_text": "Prerequisites: Ma 1 abc and Ph 1 abc, or instructor's permission.",
        "prereqs": [
            "ma-1-d",
            "ph-1-abc",
            "ma-1-abc"
        ]
    },
    "ay-21": {
        "id": "ay-21",
        "course_id": "Ay 21",
        "name": "Galaxies and Cosmology",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Cosmological models and parameters, extragalactic distance scale, cosmological tests; constituents of the universe, dark matter, and dark energy; thermal history of the universe, cosmic nucleosynthesis, recombination, and cosmic microwave background; formation and evolution of structure in the universe; galaxy clusters, large-scale structure and its evolution; galaxies, their properties and fundamental correlations; formation and evolution of galaxies, deep surveys; star formation history of the universe; quasars and other active galactic nuclei, and their evolution; structure and evolution of the intergalactic medium; diffuse extragalactic backgrounds; the first stars, galaxies, and the reionization era.",
        "offered": true,
        "instructors": "Djorgovski",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#galaxies-and-cosmology",
        "prereq_text": "Prerequisites: Ma 1 abc, Ph 1 abc or instructor's permission.",
        "prereqs": [
            "ma-1-d",
            "ph-1-abc",
            "ma-1-abc"
        ]
    },
    "ay-30": {
        "id": "ay-30",
        "course_id": "Ay 30",
        "name": "Introduction to Modern Research",
        "units": "3 units (2-0-1)",
        "terms": "first term",
        "description": "Weekly seminar open to declared Ay majors. At the discretion of the instructor, nonmajors who have taken astronomy courses may be admitted. Course is intended for sophomores and juniors. This seminar is held in faculty homes in the evening and is designed to encourage student communication skills as they are introduced to faculty members and their research. Each week a student will review a popular-level article in astronomy for the class. Graded pass/fail.",
        "offered": true,
        "instructors": "Howard",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#introduction-to-modern-research",
        "prereq_text": "",
        "prereqs": []
    },
    "ay-31": {
        "id": "ay-31",
        "course_id": "Ay 31",
        "name": "Writing in Astronomy",
        "units": "3 units (1-0-2)",
        "terms": "second term",
        "description": "This course is intended to provide practical experience in the types of writing expected of professional astronomers. Example styles include research proposals, topical reviews, professional journal manuscripts, and articles for popular magazines such as Astronomy or Sky and Telescope. Each student will adopt one of these formats in consultation with the course instructor and write an original piece. An outline and several drafts reviewed by both a faculty mentor familiar with the topic and the course instructor are required. This course is most suitable for juniors and seniors. Fulfills the Institute scientific writing requirement.",
        "offered": true,
        "instructors": "Mawet",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#writing-in-astronomy",
        "prereq_text": "",
        "prereqs": []
    },
    "ay-43": {
        "id": "ay-43",
        "course_id": "Ay 43",
        "name": "Reading in Astronomy and Astrophysics",
        "units": "",
        "terms": "",
        "description": "Course is intended for students with a definite independent reading plan or who attend regular (biweekly) research and literature discussion groups. Instructor's permission required. Graded pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#reading-in-astronomy-and-astrophysics",
        "prereq_text": "",
        "prereqs": []
    },
    "ay-78-abc": {
        "id": "ay-78-abc",
        "course_id": "Ay 78 abc",
        "name": "Senior Thesis",
        "units": "9 units",
        "terms": "",
        "description": "Previous SURF or independent study work can be useful experience. Course open to senior astronomy majors only. Research must be supervised by a faculty member. Students wishing assistance in finding an adviser and/or a topic for a senior thesis are invited to consult with the astronomy option representative. The student will work with an adviser to formulate a research project, conduct original research, present new results, and evaluate them in the context of previously published work in the field. In the first term, the student should be fully engaged in, and make significant progress on, the research project. In the second term, the research continues and an outline of the thesis itself should be reviewed with the adviser and the option representative. In the third term, research work is completed and the focus should turn to thesis writing. A written thesis of 20-100 pages must be completed and approved by the adviser and the option representative before the end of third term. The student and advisor should maintain good communication regarding the scope, content, draft due dates, and final copy of the thesis. First two terms are graded pass/fail, with grades updated at the end of the course to the appropriate letter grade for all three terms.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#senior-thesis",
        "prereq_text": "Prerequisites: To register, student must obtain approval of the astronomy option representative and the prospective thesis adviser.",
        "prereqs": []
    },
    "ay-101": {
        "id": "ay-101",
        "course_id": "Ay 101",
        "name": "Physics of Stars",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Physics of stellar interiors and stellar atmospheres. Stellar structure including nucleosynthesis in the cores of stars and energy transport. Stellar evolution. Fundamental properties of stars. The H-R diagram. Stellar spectra, radiative transfer, and spectral line formation. Additional topics may include: stellar oscillations, rotation, mass loss, binary evolution.",
        "offered": true,
        "instructors": "Fuller",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#physics-of-stars",
        "prereq_text": "Prerequisites: Ay 20 is recommended.",
        "prereqs": [
            "ay-20"
        ]
    },
    "ay-102": {
        "id": "ay-102",
        "course_id": "Ay 102",
        "name": "Physics of the Interstellar Medium",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Phinney",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#physics-of-the-interstellar-medium",
        "prereq_text": "Prerequisites: Ay 20 is recommended.",
        "prereqs": [
            "ay-20"
        ]
    },
    "ayph-104": {
        "id": "ayph-104",
        "course_id": "Ay/Ph 104",
        "name": "Relativistic Astrophysics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course is designed primarily for junior and senior undergraduates in astrophysics and physics. It covers the physics of black holes and neutron stars, including accretion, particle acceleration and gravitational waves, as well as their observable consequences: (neutron stars) pulsars, magnetars, X-ray binaries, gamma-ray bursts; (black holes) X-ray transients, tidal disruption and quasars/active galaxies and sources of gravitational waves.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#relativistic-astrophysics",
        "prereq_text": "Prerequisites: Ph 1, Ph 2 ab.",
        "prereqs": [
            "ph-2-abc",
            "ph-1-abc"
        ]
    },
    "ay-105": {
        "id": "ay-105",
        "course_id": "Ay 105",
        "name": "Optical Astronomy Instrumentation Lab",
        "units": "9 units (1-5-3)",
        "terms": "third term",
        "description": "An opportunity for astronomy and physics undergraduates (juniors and seniors) to gain firsthand experience with the basic instrumentation tools of modern optical and infrared astronomy. The 10 weekly lab experiments include radiometry measurements, geometrical optics, polarization, optical aberrations, spectroscopy, CCD characterization, vacuum and cryogenic technology, infrared detector technology, adaptive optics (wavefront sensors, deformable mirrors, closed loop control) and a coronography tutorial.",
        "offered": true,
        "instructors": "Hallinan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#optical-astronomy-instrumentation-lab",
        "prereq_text": "Prerequisites: Ay 20.",
        "prereqs": [
            "ay-20"
        ]
    },
    "ayge-107": {
        "id": "ayge-107",
        "course_id": "Ay/Ge 107",
        "name": "Introduction to Astronomical Observation",
        "units": "12 units (2-2-8)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Hillenbrand, de Kleer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#introduction-to-astronomical-observation",
        "prereq_text": "Prerequisites: CS 1 or equivalent coding experience recommended.",
        "prereqs": [
            "cs-1-x",
            "cs-1"
        ]
    },
    "ay-111-abc": {
        "id": "ay-111-abc",
        "course_id": "Ay 111 abc",
        "name": "Introduction to Current Astrophysics Research",
        "units": "1 unit (1-0-0)",
        "terms": "first, second terms",
        "description": "This course is intended primarily for first-year Ay graduate students, although participation is open and encouraged. Students are required to attend seminar-style lectures given by astrophysics faculty members and other researchers. The intent of the course is for students to gain an understanding of the breadth of astrophysics research that is conducted at Caltech, and to learn about potential research opportunities, as well as different career paths in astronomy. Credit is also given for attending the weekly astronomy colloquia. At the end of each term, students are required to summarize in oral or written form (at the discretion of the instructor), one of the covered subjects that drew their interest.\n Part c not offered 2024-25.",
        "offered": true,
        "instructors": "El-Badry, Djorgovksi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#introduction-to-current-astrophysics-research",
        "prereq_text": "",
        "prereqs": []
    },
    "geay-117": {
        "id": "geay-117",
        "course_id": "Ge/Ay 117",
        "name": "Bayesian Statistics and Data Analysis",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "In modern fields of planetary science and astronomy, vast quantities of data are often available to researchers. The challenge is converting this information into meaningful knowledge about the universe. The primary focus of this course is the development of a broad and general tool set that can be applied to the student's own research. We will use case studies from the astrophysical and planetary science literature as our guide as we learn about common pitfalls, explore strategies for data analysis, understand how to select the best model for the task at hand, and learn the importance of properly quantifying and reporting the level of confidence in one's conclusions.",
        "offered": true,
        "instructors": "Knutson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#bayesian-statistics-and-data-analysis",
        "prereq_text": "Prerequisites: CS 1 or equivalent.",
        "prereqs": [
            "cs-1-x",
            "cs-1"
        ]
    },
    "ay-119": {
        "id": "ay-119",
        "course_id": "Ay 119",
        "name": "Astroinformatics",
        "units": "6 units (3-0-3)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Djorgovski, Graham, Mahabal, Lombeyda",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#astroinformatics",
        "prereq_text": "",
        "prereqs": []
    },
    "ay-121": {
        "id": "ay-121",
        "course_id": "Ay 121",
        "name": "Radiative Processes",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "The interaction of radiation with matter: radiative transfer, emission, and absorption. Compton processes, coherent emission processes, synchrotron radiation, collisional excitation, spectroscopy of atoms and molecules.",
        "offered": true,
        "instructors": "Kulkarni",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#radiative-processes",
        "prereq_text": "Prerequisites: Ph 106 bc, Ph 125 or equivalent (undergraduates).",
        "prereqs": [
            "ph-125-abc",
            "ph-106-abc"
        ]
    },
    "ay-122-abc": {
        "id": "ay-122-abc",
        "course_id": "Ay 122 abc",
        "name": "Astronomical Measurements and Instrumentation",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "Measurement and signal analysis techniques throughout the electromagnetic spectrum. Courses may include lab work and field trips to Caltech observatories. Ay 122 a concentrates on infrared, optical, and ultraviolet techniques: telescopes, optics, detectors, photometry, spectroscopy, active/adaptive optics, coronography. Imaging devices and image processing. Ay 122 b concentrates on radio through submillimeter techniques: antennae, receivers, mixers, and amplifiers. Interferometers and aperture synthesis arrays. Signal analysis techniques and probability and statistics, as relevant to astronomical measurement. Ay 122 c concentrates on X-ray through gamma-ray techniques.\n Part c not offered 2024-25.",
        "offered": true,
        "instructors": "Howard, Steidel, Hallinan, Kulkarni",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#astronomical-measurements-and-instrumentation",
        "prereq_text": "Prerequisites: Ph 106 bc or equivalent.",
        "prereqs": [
            "ph-106-abc"
        ]
    },
    "ay-123": {
        "id": "ay-123",
        "course_id": "Ay 123",
        "name": "Structure and Evolution of Stars",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Thermodynamics, equation of state, convection, opacity, radiative transfer, stellar atmospheres, nuclear reactions, and stellar models. Evolution of low- and high-mass stars, supernovae, and binary stars.",
        "offered": true,
        "instructors": "El-Badry",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#structure-and-evolution-of-stars",
        "prereq_text": "Prerequisites: Ay 101; Ph 125 or equivalent (undergraduates).",
        "prereqs": [
            "ph-125-abc",
            "ay-101"
        ]
    },
    "ay-124": {
        "id": "ay-124",
        "course_id": "Ay 124",
        "name": "Structure and Evolution of Galaxies",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Stellar dynamics and properties of galaxies; instabilities; spiral and barred galaxies; tidal dynamics and galaxy mergers; stellar composition, masses, kinematics, and structure of galaxies; galactic archeology; galactic star formation; feedback from stars and super-massive black holes; circum-galactic medium.",
        "offered": true,
        "instructors": "Hopkins, El-Badry",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#structure-and-evolution-of-galaxies",
        "prereq_text": "Prerequisites: Ay 21; Ph 106 or equivalent (undergraduates).",
        "prereqs": [
            "ph-106-abc",
            "ay-21"
        ]
    },
    "ay-125": {
        "id": "ay-125",
        "course_id": "Ay 125",
        "name": "High-Energy Astrophysics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "High-energy astrophysics, the final stages of stellar evolution; supernovae, binary stars, accretion disks, pulsars; extragalactic radio sources; active galactic nuclei; black holes.",
        "offered": true,
        "instructors": "Kasliwal",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#high-energy-astrophysics",
        "prereq_text": "Prerequisites: Ph 106 and Ph 125 or equivalent (undergraduates).",
        "prereqs": [
            "ph-125-abc",
            "ph-106-abc"
        ]
    },
    "ay-126": {
        "id": "ay-126",
        "course_id": "Ay 126",
        "name": "Interstellar and Intergalactic Medium",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Physical processes in the interstellar medium. Ionization, thermal and dynamic balance of interstellar medium, molecular clouds, hydrodynamics, magnetic fields, H II regions, supernova remnants, star formation, global structure of interstellar medium.",
        "offered": true,
        "instructors": "Ravi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#interstellar-and-intergalactic-medium",
        "prereq_text": "Prerequisites: Ay 102 (undergraduates).",
        "prereqs": [
            "ay-102"
        ]
    },
    "ay-127": {
        "id": "ay-127",
        "course_id": "Ay 127",
        "name": "Astrophysical Cosmology",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Cosmology; extragalactic distance determinations; relativistic cosmological models; thermal history of the universe; nucleosynthesis; microwave background fluctuations; large-scale structure; inter-galactic medium; cosmological tests; galaxy formation and clustering.",
        "offered": true,
        "instructors": "Steidel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#astrophysical-cosmology",
        "prereq_text": "Prerequisites: Ay 21; Ph 106 or equivalent (undergraduates).",
        "prereqs": [
            "ph-106-abc",
            "ay-21"
        ]
    },
    "geay-132": {
        "id": "geay-132",
        "course_id": "Ge/Ay 132",
        "name": "Atomic and Molecular Processes in Astronomy and Planetary Sciences",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Fundamental aspects of atomic and molecular spectra that enable one to infer physical conditions in astronomical, planetary, and terrestrial environments. Topics will include the structure and spectra of atoms, molecules, and solids; transition probabilities; photoionization and recombination; collisional processes; gas-phase chemical reactions; and isotopic fractionation. Each topic will be illustrated with applications in astronomy and planetary sciences, ranging from planetary atmospheres and dense interstellar clouds to the early universe.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Blake",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#atomic-and-molecular-processes-in-astronomy-and-planetary-sciences",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "geay-133": {
        "id": "geay-133",
        "course_id": "Ge/Ay 133",
        "name": "The Formation and Evolution of Planetary Systems",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Review current theoretical ideas and observations pertaining to the formation and evolution of planetary systems. Topics to be covered include low-mass star formation, the protoplanetary disk, accretion and condensation in the solar nebula, the formation of gas giants, meteorites, the outer solar system, giant impacts, extrasolar planetary systems.",
        "offered": true,
        "instructors": "Batygin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#the-formation-and-evolution-of-planetary-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "geay-137": {
        "id": "geay-137",
        "course_id": "Ge/Ay 137",
        "name": "Planetary Physics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A quantitative review of dynamical processes that characterize long-term evolution of planetary systems. An understanding of orbit-orbit resonances, spin-orbit resonances, secular exchange of angular momentum and the onset of chaos will be developed within the framework of Hamiltonian perturbation theory. Additionally, dissipative effects associated with tidal and planet-disk interactions will be considered.",
        "offered": true,
        "instructors": "Batygin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#planetary-physics",
        "prereq_text": "Prerequisites: Ph 106 abc, ACM 95/100 ab.",
        "prereqs": [
            "acm-95100-ab",
            "ph-106-abc"
        ]
    },
    "ay-141-abc": {
        "id": "ay-141-abc",
        "course_id": "Ay 141 abc",
        "name": "Research Conference in Astronomy",
        "units": "2 units (1-0-1)",
        "terms": "first, second, third terms",
        "description": "Oral reports on current research in astronomy, providing students an opportunity for practice in the organization and presentation of technical material. A minimum of two presentations will be expected from each student each year. In addition, students are encouraged to participate in a public-level representation of the same material for posting to an outreach website. This course fulfills the option communication requirement and is required of all astronomy graduate students who have passed their qualifying exam. It is also recommended for astronomy seniors; non-seniors can attend but cannot take the course for credit. Graded pass/fail.",
        "offered": true,
        "instructors": "Steidel, Kasliwal, Hopkins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#research-conference-in-astronomy",
        "prereq_text": "",
        "prereqs": []
    },
    "ay-142": {
        "id": "ay-142",
        "course_id": "Ay 142",
        "name": "Research in Astronomy and Astrophysics",
        "units": "",
        "terms": "",
        "description": "The student should consult a member of the department and have a definite program of research outlined. Approval by the student's adviser must be obtained before registering. 36 units of Ay 142 or Ay 143 required for candidacy for graduate students. Graded pass/fail.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#research-in-astronomy-and-astrophysics",
        "prereq_text": "",
        "prereqs": []
    },
    "ay-143": {
        "id": "ay-143",
        "course_id": "Ay 143",
        "name": "Reading and Independent Study",
        "units": "",
        "terms": "",
        "description": "The student should consult a member of the department and have a definite program of reading and independent study outlined. Approval by the student's adviser must be obtained before registering. 36 units of Ay 142 or Ay 143 required for candidacy for graduate students. Graded pass/fail.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#reading-and-independent-study",
        "prereq_text": "",
        "prereqs": []
    },
    "ay-144": {
        "id": "ay-144",
        "course_id": "Ay 144",
        "name": "Independent Writing in Astronomy",
        "units": "3 units (0-0-3)",
        "terms": "offered every term",
        "description": "This course is intended to be taken by students conducting minor study in the Ay option, subsequent to a term of Ay 142 (Research in Astronomy and Astrophysics), or by students who have completed a SURF with an astronomy faculty member and are writing it up for publication. Students should sign up in the section of the faculty member who supervised the research project. Course requirements are (at minimum) bi-weekly meetings with the research adviser and preparation of a 5-20 page write-up of the work in the style of one of the major journals, such as ApJ/AJ or Science/Nature. This course is required as part of the Ay minor.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#independent-writing-in-astronomy",
        "prereq_text": "Prerequisites: Ay 142.",
        "prereqs": [
            "ay-142"
        ]
    },
    "geay-159": {
        "id": "geay-159",
        "course_id": "Ge/Ay 159",
        "name": "Astrobiology",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "We approach the age-old questions \"Why are we here?\" and \"Are we alone?\" by covering topics in cosmology, the origins of life, planetary habitability, the detection of biosignatures, the search for extraterrestrial intelligence, and humanity's future in space. Specific topics include: the emergence of life at hydrothermal vents; the habitable zone and the Gaia hypothesis; the search for ancient habitable environments on Mars; icy satellites like Europa, Enceladus, and Titan as astrobiological prospects; and the hunt for atmospheric biosignatures on exoplanets.",
        "offered": true,
        "instructors": "Yung",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#astrobiology",
        "prereq_text": "",
        "prereqs": []
    },
    "ay-190": {
        "id": "ay-190",
        "course_id": "Ay 190",
        "name": "Computational Astrophysics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Introduction to essential numerical analysis and computational methods in astrophysics and astrophysical data analysis. Basic numerical methods and techniques; N-body simulations; fluid dynamics (SPH/grid-based); MHD; radiation transport; reaction networks; data analysis methods; numerical relativity.",
        "offered": true,
        "instructors": "Hopkins, Most",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#computational-astrophysics",
        "prereq_text": "Prerequisites: Ph 20-22 (undergraduates).",
        "prereqs": [
            "ph-20"
        ]
    },
    "ayge-198": {
        "id": "ayge-198",
        "course_id": "Ay/Ge 198",
        "name": "Special Topics in the Planetary Sciences",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "Topic for 2024-25 is Extrasolar Planets. Thousands of planets have been identified in orbit around other stars. Astronomers are now embarking on understanding the statistics of extrasolar planet populations and characterizing individual systems in detail, namely star-planet, planet-planet and planet-disk dynamical interactions, physical parameters of planets and their composition, weather phenomena, etc. Direct and indirect detection techniques are now completing the big picture of extra-solar planetary systems in all of their natural diversity. The seminar-style course will review the state of the art in exoplanet science, take up case studies, detail current and future instrument needs, and anticipate findings.",
        "offered": true,
        "instructors": "Howard",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#special-topics-in-the-planetary-sciences",
        "prereq_text": "",
        "prereqs": []
    },
    "ay-211": {
        "id": "ay-211",
        "course_id": "Ay 211",
        "name": "Contemporary Extragalactic Astronomy",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Topics in extragalactic astronomy and cosmology, including observational probes of dark matter and dark energy; cosmological backgrounds and primordial element abundances; galaxy formation and evolution, including assembly histories, feedback and environmental effects; physics of the intergalactic medium; the role of active galactic nuclei; galactic structure and stellar populations; future facilities and their likely impact in the field.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#contemporary-extragalactic-astronomy",
        "prereq_text": "Prerequisites: Ay 123, Ay 124, and Ay 127.",
        "prereqs": [
            "ay-123",
            "ay-124",
            "ay-127"
        ]
    },
    "ay-215": {
        "id": "ay-215",
        "course_id": "Ay 215",
        "name": "Seminar in Theoretical Astrophysics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Course for graduate students and seniors in astronomy. Topic for 2022-23 will be compact binaries containing white dwarfs, neutron stars and black holes. Formation, mass transfer, accretion, X-ray and pulsar binaries, magnetic and wind interactions, mergers, gravitational waves. Students will be required to lead some discussions; homework will consist exclusively of reading and working through selected papers in preparation for discussions.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#seminar-in-theoretical-astrophysics",
        "prereq_text": "",
        "prereqs": []
    },
    "ay-218": {
        "id": "ay-218",
        "course_id": "Ay 218",
        "name": "Extrasolar Planets",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#extrasolar-planets",
        "prereq_text": "",
        "prereqs": []
    },
    "ay-219": {
        "id": "ay-219",
        "course_id": "Ay 219",
        "name": "Elements in the Universe and Galactic Chemical Evolution",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Survey of the formation of the elements in the universe as a function of cosmic time. Review of the determination of abundances in stars, meteorites, H II regions, and in interstellar and intergalactic gas. Overview of models of galactic chemical evolution. Participants will measure elemental abundances from the Keck spectrum of a star and construct their own numerical chemical evolution models.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ay/#elements-in-the-universe-and-galactic-chemical-evolution",
        "prereq_text": "Prerequisites: Ay 121, 123, 124, 126.",
        "prereqs": [
            "ay-121"
        ]
    }
}