{
    "be-1": {
        "id": "be-1",
        "course_id": "BE 1",
        "name": "Frontiers in Bioengineering",
        "units": "1 unit",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#frontiers-in-bioengineering",
        "prereq_text": "",
        "prereqs": []
    },
    "bibe-24": {
        "id": "bibe-24",
        "course_id": "Bi/BE 24",
        "name": "Scientific Communication for Biological Scientists and Engineers",
        "units": "6 units (3-0-3)",
        "terms": "second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Hoy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#scientific-communication-for-biological-scientists-and-engineers",
        "prereq_text": "",
        "prereqs": []
    },
    "bebi-25": {
        "id": "bebi-25",
        "course_id": "BE/Bi 25",
        "name": "Biophysical Chemistry",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course develops principles of solution thermodynamics, chemical kinetics, and transport processes applied to living systems.",
        "offered": true,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#biophysical-chemistry",
        "prereq_text": "Prerequisites: Ch 1 ab, Ma 2.",
        "prereqs": [
            "ma-2102"
        ]
    },
    "be-98": {
        "id": "be-98",
        "course_id": "BE 98",
        "name": "Undergraduate Research in Bioengineering",
        "units": "Variable units, as arranged with the advising faculty member",
        "terms": "first, second, third terms",
        "description": "Undergraduate research with a written report at the end of each term; supervised by a Caltech faculty member, or co-advised by a Caltech faculty member and an external researcher. Graded pass/fail. May not be taken after BE 99.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#undergraduate-research-in-bioengineering",
        "prereq_text": "",
        "prereqs": []
    },
    "be-99-abc": {
        "id": "be-99-abc",
        "course_id": "BE 99 abc",
        "name": "Senior Thesis in Bioengineering",
        "units": "6 or more units per term with a three-term total of at least 27 units",
        "terms": "first, second, third terms",
        "description": "Research in Bioengineering, supervised by a Caltech faculty member, culminating in a thesis. The topic is determined by the research adviser and the student and is subject to approval by the Bioengineering faculty. The first and second terms are taken pass/fail and require a written report at the end of each term. The third term is taken on grades and requires completion of a thesis and final presentation. The last two terms must be completed in the final year of study. Total units arranged with the advising faculty member.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#senior-thesis-in-bioengineering",
        "prereq_text": "Prerequisites: Junior or senior standing and instructor's permission.",
        "prereqs": []
    },
    "bebi-103-a": {
        "id": "bebi-103-a",
        "course_id": "BE/Bi 103 a",
        "name": "Introduction to Data Analysis in the Biological Sciences",
        "units": "9 units (1-3-5)",
        "terms": "first term",
        "description": "This course covers tools needed to analyze quantitative data in biological systems. Students learn basic programming topics, data organization and wrangling, data display and presentation, parameter estimation, and resampling-based statistical inference. Students analyze real data in class and in homework.",
        "offered": true,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#introduction-to-data-analysis-in-the-biological-sciences",
        "prereq_text": "Prerequisites: Bi 1 or equivalent; CS 1, BE/Bi/NB 203, or equivalent; or instructor's permission.",
        "prereqs": [
            "cs-1-x",
            "cs-1"
        ]
    },
    "bebi-103-b": {
        "id": "bebi-103-b",
        "course_id": "BE/Bi 103 b",
        "name": "Statistical Inference in the Biological Sciences",
        "units": "9 units (1-3-5)",
        "terms": "second term",
        "description": "This course introduces students to statistical modeling and inference, primarily taking a Bayesian approach. Topics include generative modeling, parameter estimation, model comparison, hierarchical modeling, Markov chain Monte Carlo, graphical display of inference results, and principled workflows. Other topics may also be included. All techniques are applied to real biological data sets in class and in homework.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#statistical-inference-in-the-biological-sciences",
        "prereq_text": "Prerequisites: BE/Bi 103 a or equivalent; Ma 1 abc and Ma 3, or Bi/CNS/NB 195, or equivalent; or instructor's permission.",
        "prereqs": [
            "ma-1-d",
            "ma-1-abc",
            "ma-3103"
        ]
    },
    "be-107": {
        "id": "be-107",
        "course_id": "BE 107",
        "name": "Exploring Biological Principles Through Bio-Inspired Design",
        "units": "9 units (3-5-1)",
        "terms": "third term",
        "description": "Students will formulate and implement an engineering project designed to explore a biological principle or property that is exhibited in nature. Students will work in small teams in which they build a hardware platform that is motivated by a biological example in which a given approach or architecture is used to implement a given behavior. Alternatively, the team will construct new experimental instruments in order to test for the presence of an engineering principle in a biological system. Example topics include bio-inspired control of motion (from bacteria to insects), processing of sensory information (molecules to neurons), and robustness/fault-tolerance. Each project will involve proposing a specific mechanism to be explored, designing an engineering system that can be used to demonstrate and evaluate the mechanism, and building a computer-controlled, electro-mechanical system in the lab that implements or characterizes the proposed mechanism, behavior or architecture.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dickinson, Murray",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#exploring-biological-principles-through-bio-inspired-design",
        "prereq_text": "",
        "prereqs": []
    },
    "be-111": {
        "id": "be-111",
        "course_id": "BE 111",
        "name": "Making Life: Genome Synthesis from Elements",
        "units": "9 units (3-0-6)",
        "terms": "Third",
        "description": "",
        "offered": true,
        "instructors": "Wang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#making-life:-genome-synthesis-from-elements",
        "prereq_text": "Prerequisites: Bi 1, Bi 8, or equivalent; or instructor's permission.",
        "prereqs": []
    },
    "chebemede-112": {
        "id": "chebemede-112",
        "course_id": "ChE/BE/MedE 112",
        "name": "Creativity and Technological Innovation with Microfluidic Systems",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Ismagilov",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#creativity-and-technological-innovation-with-microfluidic-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "bibebmb-115": {
        "id": "bibebmb-115",
        "course_id": "Bi/BE/BMB 115",
        "name": "Viruses and Applications to Biological Systems",
        "units": "9 units (3-2-4)",
        "terms": "third term",
        "description": "Learn about viruses as fascinating biological machines, focusing on naturally-occurring and evolved variants, in silico viral vector engineering, and computational methods that include structure visualization and machine learning. This course will introduce the fundamentals in the chemistry and biology of viruses, emphasizing their engineerable properties for use in basic research and translational applications. Topics include: viruses by the numbers, mammalian and non-mammalian (plant, bacteria) viruses, enveloped vs. non-enveloped viruses, host-virus interactions, viral life cycles (replication vs. dormancy), immune responses to viruses, zoonosis, diverse mechanisms of entry and replication, the application of viruses as gene-delivery vehicles (with a focus on adeno-associated viruses or AAVs, lentiviruses, and rabies), and how to engineer viral properties for applications in basic research and gene therapy. The lectures will be complemented by short lab exercises in AAV preparation, bioinformatics and machine learning, and structure visualization.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Bjorkman, Gradinaru, Van Valen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#viruses-and-applications-to-biological-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "phapheebe-118-ab": {
        "id": "phapheebe-118-ab",
        "course_id": "Ph/APh/EE/BE 118 ab",
        "name": "Physics of Measurement",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course explores the fundamental underpinnings of experimental measurements from the perspectives of information, noise, coupling, responsivity, and backaction. Its overarching goal is to enable students to develop intuition about a diversity of real measurement systems and the means to critically evaluate them. This involves developing a standard framework for estimating the ultimate and practical limits to information that can be extracted from a real measurement system. Topics will include the fundamental nature of information and signals, physical signal transduction and responsivity, the physical origin of noise processes, modulation, frequency conversion, synchronous detection, signal-sampling techniques, digitization, signal transforms, spectral analyses, and correlation methods. The first term will cover the essential underpinnings, while second-term topics will vary year-by-year according to interest. Among possible Ph 118 b topics are: high frequency, microwave, and fast time-domain measurements; biological interfaces and biosensing; the physics of functional brain imaging; and quantum measurement.\n Part b not offered 2024-25.",
        "offered": true,
        "instructors": "Roukes",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#physics-of-measurement",
        "prereq_text": "Prerequisites: Ph 127, APh 105, or equivalent, or permission from instructor.",
        "prereqs": [
            "ph-127-ab",
            "ph-105"
        ]
    },
    "bibe-119": {
        "id": "bibe-119",
        "course_id": "Bi/BE 119",
        "name": "Morphogenesis of Developmental Systems",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Stathopoulos",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#morphogenesis-of-developmental-systems",
        "prereq_text": "Prerequisites: Bi 8 and Bi 9, or instructor's permission.",
        "prereqs": []
    },
    "bibe-129": {
        "id": "bibe-129",
        "course_id": "Bi/BE 129",
        "name": "The Biology and Treatment of Cancer",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Zinn, Campbell",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#the-biology-and-treatment-of-cancer",
        "prereq_text": "",
        "prereqs": []
    },
    "chechbe-130": {
        "id": "chechbe-130",
        "course_id": "ChE/Ch/BE 130",
        "name": "Biomolecular Engineering Laboratory",
        "units": "9 units (0-6-3)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Demirer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#biomolecular-engineering-laboratory",
        "prereq_text": "Prerequisites: BE/ChE 163 or instructor's permission.",
        "prereqs": []
    },
    "gebibecnsese-147": {
        "id": "gebibecnsese-147",
        "course_id": "Ge/Bi/BE/CNS/ESE 147",
        "name": "Challenges and Opportunities in Quantitative Ecology",
        "units": "6 units (6-0-0)",
        "terms": "third term",
        "description": "Ecosystems are defined by dynamical interactions between groups of organisms, the communities they constitute, and the physical and chemical conditions and processes occurring in the environment. These dynamics are complex and multiscale across both length and time. This course will explore quantitative approaches that observe, measure, model, and monitor ecosystems and the services that they provide society-and the emerging opportunities that could employ these approaches to improve and strengthen global sustainability when it comes to our own ecology. This course will feature lectures each week from different members of the Caltech faculty working on ecological problems from different angles in order to illustrate how fresh insights can emerge by drawing on diverse ways-of-knowing.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Fischer, Tejada",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#challenges-and-opportunities-in-quantitative-ecology",
        "prereq_text": "",
        "prereqs": []
    },
    "be-150": {
        "id": "be-150",
        "course_id": "BE 150",
        "name": "Biological Circuit Design",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Quantitative studies of cellular and developmental systems in biology, including the architecture of specific circuits controlling microbial behaviors and multicellular development in model organisms. Specific topics include chemotaxis, multistability and differentiation, biological oscillations, stochastic effects in circuit operation, as well as higher-level circuit properties, such as robustness. The course will also consider the organization of transcriptional and protein-protein interaction networks at the genomic scale. Topics are approached from experimental, theoretical, and computational perspectives.",
        "offered": true,
        "instructors": "Bois, Elowitz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#biological-circuit-design",
        "prereq_text": "Prerequisites: Bi 1, Bi 8, or equivalent; Ma 2, Bi/CNS/NB 195, or equivalent; or instructor's permission.",
        "prereqs": [
            "ma-2102"
        ]
    },
    "be-153": {
        "id": "be-153",
        "course_id": "BE 153",
        "name": "Case Studies in Systems Physiology",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will explore the process of creating and validating theoretical models in systems biology and physiology. It will examine several macroscopic physiological systems in detail, including examples from immunology, endocrinology, cardiovascular physiology, and others. Emphasis will be placed on understanding how macroscopic behavior emerges from the interaction of individual components.",
        "offered": true,
        "instructors": "Petrasek",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#case-studies-in-systems-physiology",
        "prereq_text": "Prerequisites: Bi 8, Bi 9, or equivalent.",
        "prereqs": []
    },
    "nbbibe-155": {
        "id": "nbbibe-155",
        "course_id": "NB/Bi/BE 155",
        "name": "Neuropharmacology",
        "units": "6 units (3-0-3)",
        "terms": "Second term",
        "description": "The neuroscience of drugs for therapy, for prevention, and for recreation. Students learn the prospects for new generations of medications in neurology, psychiatry, aging, and treatment of substance abuse. Topics: Types of drug molecules, Drug receptors, Electrophysiology, Drugs activate ion channels, Drugs block ion channels, Drugs activate and block G protein pathways, Drugs block neurotransmitter transporters, Pharmacokinetics, Recreational drugs, Nicotine Addiction, Opiate Addiction, Drugs for neurodegenerative diseases: Alzheimer's disease, Parkinson's disease, Drugs for epilepsy and migraine, and Psychiatric diseases: Nosology and drugs. The course is taught at the research level.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Lester",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#neuropharmacology",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150.",
        "prereqs": []
    },
    "bebiaph-161": {
        "id": "bebiaph-161",
        "course_id": "BE/Bi/APh 161",
        "name": "Physical Biology of the Cell",
        "units": "12 units (3-0-9)",
        "terms": "second term",
        "description": "Physical models applied to the analysis of biological structures ranging from individual proteins and DNA to entire cells. Typical topics include the force response of proteins and DNA, models of molecular motors, DNA packing in viruses and eukaryotes, mechanics of membranes, and membrane proteins and cell motility.",
        "offered": true,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#physical-biology-of-the-cell",
        "prereq_text": "Prerequisites: Ph 2 ab and ACM 95/100 ab,or background in differential equations and statistical and quantum mechanics, or instructor's written permission..",
        "prereqs": [
            "ph-2-abc",
            "acm-95100-ab"
        ]
    },
    "beche-163": {
        "id": "beche-163",
        "course_id": "BE/ChE 163",
        "name": "Introduction to Biomolecular Engineering",
        "units": "12 units (3-0-9)",
        "terms": "first term",
        "description": "The course introduces rational design and evolutionary methods for engineering functional protein and nucleic acid systems. Rational design topics include molecular modeling, positive and negative design paradigms, simulation and optimization of equilibrium and kinetic properties, design of catalysts, sensors, motors, and circuits. Evolutionary design topics include evolutionary mechanisms and tradeoffs, fitness landscapes and directed evolution of proteins. Some assignments require programming (Python is the language of instruction).",
        "offered": true,
        "instructors": "Mayo, Pierce",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#introduction-to-biomolecular-engineering",
        "prereq_text": "Prerequisites: Bi 8, Ch/Bi 110 or instructor's permission and CS 1 or equivalent.",
        "prereqs": [
            "cs-1-x",
            "cs-1"
        ]
    },
    "medeeebe-168-abc": {
        "id": "medeeebe-168-abc",
        "course_id": "MedE/EE/BE 168 abc",
        "name": "Biomedical Optics: Principles and Imaging",
        "units": "9 units (4-0-5) each",
        "terms": "second term, part a offered 2024-25, part b offered 2025-26, part c offered 2026-27.",
        "description": "Part a covers the principles of optical photon transport in biological tissue. Topics include a brief introduction to biomedical optics, single-scatterer theories, Monte Carlo modeling of photon transport, convolution for broad-beam responses, radiative transfer equation and diffusion theory, hybrid Monte Carlo method and diffusion theory, and sensing of optical properties and spectroscopy, (absorption, elastic scattering, Raman scattering, and fluorescence). Part b covers established optical imaging technologies. Topics include ballistic imaging (confocal microscopy, two-photon microscopy, super-resolution microscopy, etc.), optical coherence tomography, Mueller optical coherence tomography, and diffuse optical tomography. Part c covers emerging optical imaging technologies. Topics include photoacoustic tomography, ultrasound-modulated optical tomography, optical time reversal (wavefront shaping/engineering), and ultrafast imaging.\n MedE/EE/BE 168 bc not offered 2024-25. Part a offered 2024-25.",
        "offered": true,
        "instructors": "Wang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#biomedical-optics:-principles-and-imaging",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "bibe-177": {
        "id": "bibe-177",
        "course_id": "Bi/BE 177",
        "name": "Principles of Modern Microscopy",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Lectures and discussions on the underlying principles behind digital, video, differential interference contrast, phase contrast, confocal, and two-photon microscopy. The course will begin with basic geometric optics and characteristics of lenses and microscopes. Specific attention will be given to how different imaging elements such as filters, detectors, and objective lenses contribute to the final image. Course work will include critical evaluation of published images and design strategies for simple optical systems and the analysis and presentation of two- and three-dimensional images. The role of light microscopy in the history of science will be an underlying theme. No prior knowledge of microscopy will be assumed.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Collazo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#principles-of-modern-microscopy",
        "prereq_text": "",
        "prereqs": []
    },
    "bibecs-183": {
        "id": "bibecs-183",
        "course_id": "Bi/BE/CS 183",
        "name": "Introduction to Computational Biology and Bioinformatics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Biology is becoming an increasingly data-intensive science. Many of the data challenges in the biological sciences are distinct from other scientific disciplines because of the complexity involved. This course will introduce key computational, probabilistic, and statistical methods that are common in computational biology and bioinformatics. We will integrate these theoretical aspects to discuss solutions to common challenges that reoccur throughout bioinformatics including algorithms and heuristics for tackling DNA sequence alignments, phylogenetic reconstructions, evolutionary analysis, and population and human genetics. We will discuss these topics in conjunction with common applications including the analysis of high throughput DNA sequencing data sets and analysis of gene expression from RNA-Seq data sets.",
        "offered": true,
        "instructors": "Guttman, Thomson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#introduction-to-computational-biology-and-bioinformatics",
        "prereq_text": "Prerequisites: Bi 8, CS 2, Ma 3; or BE/Bi 103 a; or instructor's permission.",
        "prereqs": [
            "cs-2",
            "ma-3103"
        ]
    },
    "chebemede-188": {
        "id": "chebemede-188",
        "course_id": "ChE/BE/MedE 188",
        "name": "Molecular Imaging",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will cover the basic principles of biological and medical imaging technologies including magnetic resonance, ultrasound, nuclear imaging, fluorescence, bioluminescence and photoacoustics, and the design of chemical and biological probes to obtain molecular information about living systems using these modalities. Topics will include nuclear spin behavior, sound wave propagation, radioactive decay, photon absorption and scattering, spatial encoding, image reconstruction, statistical analysis, and molecular contrast mechanisms. The design of molecular imaging agents for biomarker detection, cell tracking, and dynamic imaging of cellular signals will be analyzed in terms of detection limits, kinetics, and biological effects. Participants in the course will develop proposals for new molecular imaging agents for applications such as functional brain imaging, cancer diagnosis, and cell therapy.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Shapiro",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#molecular-imaging",
        "prereq_text": "Prerequisites: Ch/Bi 110, ChE 101 and ACM 95 or equivalent.",
        "prereqs": [
            "acm-95100-ab"
        ]
    },
    "beeemede-189-ab": {
        "id": "beeemede-189-ab",
        "course_id": "BE/EE/MedE 189 ab",
        "name": "Design and Construction of Biodevices",
        "units": "189 a, 12 units (3-6-3) offered both first and third terms. 189 b, 9 units (0-9-0) offered only third term",
        "terms": "first, third terms",
        "description": "Students will learn to use an Arduino microcontroller to interface sensing and actuation hardware with the computer. Students will learn and practice engineering design principles through a set of projects. In part a, students will design and implement biosensing systems; examples include a pulse monitor, a pulse oximeter, and a real-time polymerase-chain-reaction incubator. Part b is a student-initiated design project requiring instructor's permission for enrollment. Enrollment is limited based on laboratory capacity.",
        "offered": true,
        "instructors": "Murray,Yang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#design-and-construction-of-biodevices",
        "prereq_text": "Prerequisites: BE/EE/MedE 189 a must be taken before BE/EE/MedE 189 b.",
        "prereqs": []
    },
    "becscnsbi-191-ab": {
        "id": "becscnsbi-191-ab",
        "course_id": "BE/CS/CNS/Bi 191 ab",
        "name": "Biomolecular Computation",
        "units": "9 units (3-0-6) a; (2-4-3) b",
        "terms": "second, third terms",
        "description": "This course investigates computation by molecular systems, emphasizing models of computation based on the underlying physics, chemistry, and organization of biological cells. We will explore programmability, complexity, simulation of, and reasoning about abstract models of chemical reaction networks, molecular folding, molecular self-assembly, and molecular motors, with an emphasis on universal architectures for computation, control, and construction within molecular systems. If time permits, we will also discuss biological example systems such as signal transduction, genetic regulatory networks, and the cytoskeleton; physical limits of computation, reversibility, reliability, and the role of noise, DNA-based computers and DNA nanotechnology. Part a develops fundamental results; part b is a reading and research course: classic and current papers will be discussed, and students will do projects on current research topics.",
        "offered": true,
        "instructors": "Winfree",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#biomolecular-computation",
        "prereq_text": "Prerequisites: None. Recommended: BE/ChE 163, CS 21, or equivalent.",
        "prereqs": [
            "cs-21"
        ]
    },
    "becs-196-ab": {
        "id": "becs-196-ab",
        "course_id": "BE/CS 196 ab",
        "name": "Design and Construction of Programmable Molecular Systems",
        "units": "a is 12 units (2-4-6) ; b is 9 units (2-4-3)",
        "terms": "a is second term; b is third term.",
        "description": "This course will introduce students to the conceptual frameworks and tools of computer science as applied to molecular engineering, as well as to the practical realities of synthesizing and testing their designs in the laboratory. In part a, students will design and construct DNA circuits and self-assembled DNA nanostructures, as well as quantitatively analyze the designs and the experimental data. Students will learn laboratory techniques including fluorescence spectroscopy and atomic force microscopy and will use software tools and program in Mathematica. Part b is an open-ended design and build project requiring instructor's permission for enrollment. Limited enrollment.",
        "offered": true,
        "instructors": "Qian",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#design-and-construction-of-programmable-molecular-systems",
        "prereq_text": "Prerequisites: none.",
        "prereqs": []
    },
    "bebicnsnb-197": {
        "id": "bebicnsnb-197",
        "course_id": "BE/Bi/CNS/NB 197",
        "name": "Mentoring and Outreach",
        "units": "taken in any term, usually 3 units per term and not more than 6 in a single term",
        "terms": "",
        "description": "In consultation with, and with the approval of, a faculty advisor (usually the student’s academic advisor) and the Caltech Center for Teaching, Learning, and Outreach. Students may obtain credit for engaging in volunteer efforts to promote public understanding of science; to mentor and tutor young people and underserved populations; or to otherwise contribute to the diversity, equity, and inclusiveness of the scientific enterprise. Students will be required to fill out short pre- and post-outreach activity forms to describe their proposal and to report on the results. Students may petition their option representative (graduate students) or academic advisor (undergraduate students) if they seek credits beyond the 12-unit limit. Offered pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#mentoring-and-outreach",
        "prereq_text": "",
        "prereqs": []
    },
    "be-200": {
        "id": "be-200",
        "course_id": "BE 200",
        "name": "Research in Bioengineering",
        "units": "",
        "terms": "",
        "description": "By arrangement with members of the staff, properly qualified graduate students are directed in bioengineering research.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#research-in-bioengineering",
        "prereq_text": "",
        "prereqs": []
    },
    "be-201": {
        "id": "be-201",
        "course_id": "BE 201",
        "name": "Reading the Bioengineering Literature",
        "units": "4 units (1-0-3)",
        "terms": "second term",
        "description": "Participants will read, discuss, and critique papers on diverse topics within the bioengineering literature. Offered only for Bioengineering graduate students.",
        "offered": true,
        "instructors": "Winfree",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#reading-the-bioengineering-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "bebinb-203": {
        "id": "bebinb-203",
        "course_id": "BE/Bi/NB 203",
        "name": "Introduction to Programming for the Biological Sciences Bootcamp",
        "units": "6 units",
        "terms": "summer term",
        "description": "This course provides an intensive, hands-on, pragmatic introduction to computer programming aimed at biologists and bioengineers. No previous programming experience is assumed. Python is the language of instruction. Students will learn basic concepts such as data types, control structures, string processing, functions, input/output, etc., while writing code applied to biological problems. At the end of the course, students will be able to perform simple simulations, write scripts to run software packages and parse output, and analyze and plot data. This class is offered as a week-long summer \"boot camp\" the week after Commencement, in which students spend all day working on the course. Students who do not have a strong need for the condensed boot camp schedule are encouraged to take BE/Bi 103 a instead. Graded pass/fail.",
        "offered": true,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#introduction-to-programming-for-the-biological-sciences-bootcamp",
        "prereq_text": "",
        "prereqs": []
    },
    "bebi-205": {
        "id": "bebi-205",
        "course_id": "BE/Bi 205",
        "name": "Deep Learning for Biological Data",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course is a practical introduction to machine learning methods for biological data, focusing on three common data types in biology-images, sequences, and structures. This course will cover how to represent biological data in a manner amenable to machine learning approaches, survey tasks that can be solved with modern deep learning algorithms (e.g. image segmentation, object tracking, sequence classification, protein folding, etc.), explore architectures of deep learning models for each data type, and provide practical guidance for model development. Students will have the opportunity to apply these methods to their own datasets.",
        "offered": true,
        "instructors": "Van Valen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#deep-learning-for-biological-data",
        "prereq_text": "Prerequisites: BE/BI 103 a and BE/BI 103 b or equivalent; or instructor's permission. CMS/CS/CNS/EE/IDS 155 is strongly recommended but not required.",
        "prereqs": [
            "cmscscnseeids-155"
        ]
    },
    "bibebmb-222": {
        "id": "bibebmb-222",
        "course_id": "Bi/BE/BMB 222",
        "name": "The Structure of the Cytosol",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "The cytosol, and fluid spaces within the nucleus, were once envisioned as a concentrated soup of proteins, RNA, and small molecules, all diffusing, mixing freely, and interacting randomly. We now know that proteins in the cytosol frequently undergo only restricted diffusion and become concentrated in specialized portions of the cytosol to carry out particular cellular functions. This course consists of lectures, reading, student presentations, and discussion about newly recognized biochemical mechanisms that confer local structure and reaction specificity within the cytosol, including protein scaffolds and \"liquid-liquid phase separations\" that form \"membraneless compartments\".\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Kennedy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#the-structure-of-the-cytosol",
        "prereq_text": "Prerequisites: Bi 9, Ch/Bi 110-111 or graduate standing in a biological discipline.",
        "prereqs": []
    },
    "bibe-227": {
        "id": "bibe-227",
        "course_id": "Bi/BE 227",
        "name": "Methods in Modern Microscopy",
        "units": "12 units (2-6-4)",
        "terms": "second term",
        "description": "Discussion and laboratory-based course covering the practical use of the confocal microscope, with special attention to the dynamic analysis of living cells and embryos. Course topics include: basic optics, microscope design, Kohler illumination, confocal microscopy, light sheet microscopy, spectral unmixing and fluorescence correlation spectroscopy, three-dimensional reconstruction of fixed cells and tissues. Students will construct a light sheet microscope based on the openSPIM design, and perform time-lapse confocal analysis of living cells and embryos. Enrollment is limited.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Collazo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#methods-in-modern-microscopy",
        "prereq_text": "Prerequisites: Bi/BE 177 or a course in microscopy.",
        "prereqs": []
    },
    "bicnsbenb-230": {
        "id": "bicnsbenb-230",
        "course_id": "Bi/CNS/BE/NB 230",
        "name": "Optogenetic and CLARITY Methods in Experimental Neuroscience",
        "units": "9 units (3-2-4)",
        "terms": "third term",
        "description": "The class covers the theoretical and practical aspects of using (1) optogenetic sensors and actuators to visualize and modulate the activity of neuronal ensembles; and (2) CLARITY approaches for anatomical mapping and phenotyping using tissue-hydrogel hybrids. The class offers weekly hands-on LAB exposure for opsin viral production and delivery to neurons, recording of light-modulated activity, and tissue clearing, imaging, and 3D reconstruction of fluorescent samples. Lecture topics include: opsin design (including natural and artificial sources), delivery (genetic targeting, viral transduction), light activation requirements (power requirements, wavelength, fiberoptics), compatible readout modalities (electrophysiology, imaging); design and use of methods for tissue clearing (tissue stabilization by polymers/hydrogels and selective extractions, such as of lipids for increased tissue transparency and macromolecule access). Class will discuss applications of these methods to neuronal circuits (case studies based on recent literature).\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Gradinaru",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#optogenetic-and-clarity-methods-in-experimental-neuroscience",
        "prereq_text": "Prerequisites: Graduate standing or NB/Bi/CNS 150 or equivalent or instructor's permission.",
        "prereqs": []
    },
    "be-240": {
        "id": "be-240",
        "course_id": "BE 240",
        "name": "Special Topics in Bioengineering",
        "units": "",
        "terms": "",
        "description": "Topics relevant to the general educational goals of the bioengineering option. Graded pass/fail.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#special-topics-in-bioengineering",
        "prereq_text": "",
        "prereqs": []
    },
    "bibecnsnb-241": {
        "id": "bibecnsnb-241",
        "course_id": "Bi/BE/CNS/NB 241",
        "name": "Spatial Genomics",
        "units": "9 units (1-8-0)",
        "terms": "third term",
        "description": "Maximum enrollment: 12. Applications of spatial genomics technology to various biological samples. Projects will be selected to represent problems in neurobiology, developmental biology and translational medicine. Emphasis will be placed on generating experimental data and analysis of data with machine learning algorithms for segmentation and clustering cells with single cell genomics tools, and preparation for publication.",
        "offered": true,
        "instructors": "Cai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#spatial-genomics",
        "prereq_text": "Prerequisites: Instructor's permission.",
        "prereqs": []
    },
    "aebe-242": {
        "id": "aebe-242",
        "course_id": "Ae/BE 242",
        "name": "Biological Flows: Propulsion",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Physical principles of unsteady fluid momentum transport: equations of motion, dimensional analysis, conservation laws. Unsteady vortex dynamics: vorticity generation and dynamics, vortex dipoles/rings, wake structure in unsteady flows. Life in moving fluids: unsteady drag, added-mass effects, virtual buoyancy, bounding and schooling, wake capture. Thrust generation by flapping, undulating, rowing, jetting. Low Reynolds number propulsion. Bioinspired design of propulsion devices.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#biological-flows:-propulsion",
        "prereq_text": "Prerequisites: Ae/APh/CE/ME 101 abc or equivalent or ChE 103 a.",
        "prereqs": [
            "aeaphceme-101-abc"
        ]
    },
    "medebeae-243": {
        "id": "medebeae-243",
        "course_id": "MedE/BE/Ae 243",
        "name": "Physiological Mechanics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Internal flows: steady and pulsatile blood flow in compliant vessels, internal flows in organisms. Fluid dynamics of the human circulatory system: heart, veins, and arteries (microcirculation). Mass and momentum transport across membranes and endothelial layers. Fluid mechanics of the respiratory system. Renal circulation and circulatory system. Biological pumps. Low and High Reynolds number locomotion.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#physiological-mechanics",
        "prereq_text": "Prerequisites: Ae/APh/CE/ME 101 abc or equivalent or ChE 103 a.",
        "prereqs": [
            "aeaphceme-101-abc"
        ]
    },
    "be-262": {
        "id": "be-262",
        "course_id": "BE 262",
        "name": "Physical Biology Bootcamp",
        "units": "12 units (2-10-0)",
        "terms": "summer term",
        "description": "This course provides an intensive introduction to thinking like a quantitative biologist. Every student will build a microscope from scratch, use a confocal microscope to measure transcription in living fly embryos and perform a quantitative dissection of gene expression in bacteria. Students will then use Python to write computer code to analyze the results of all of these experiments. No previous experience in coding is presumed, though for those with previous coding experience, advanced projects will be available. In addition to the experimental thrusts, students will use \"street fighting mathematics\" to perform order of magnitude estimates on problems ranging from how many photons it takes to make a cyanobacterium to the forces that can be applied by cytoskeletal filaments. These modeling efforts will be complemented by the development of physical models of phenomena such as gene expression, phase separation in nuclei, and cytoskeletal polymerization. Graded pass/fail.",
        "offered": true,
        "instructors": "Phillips",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#physical-biology-bootcamp",
        "prereq_text": "Prerequisites: Enrollment limited to incoming Biology, Biochemistry and Molecular Biophysics, Bioengineering, and Neurobiology graduate students, or instructor's permission.",
        "prereqs": []
    },
    "be-267": {
        "id": "be-267",
        "course_id": "BE 267",
        "name": "Research Topics in Bioengineering",
        "units": "1 unit",
        "terms": "first term",
        "description": "Introduction to current research topics in Caltech bioengineering labs. Graded pass/fail.",
        "offered": true,
        "instructors": "Cai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/be/#research-topics-in-bioengineering",
        "prereq_text": "Prerequisites: Graduate Standing.",
        "prereqs": []
    }
}