{
    "bem-97": {
        "id": "bem-97",
        "course_id": "BEM 97",
        "name": "Undergraduate Research",
        "units": "",
        "terms": "any term",
        "description": "This course offers advanced undergraduates the opportunity to pursue research on a business problem individually or in a small group. Graded pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#undergraduate-research",
        "prereq_text": "Prerequisites: advanced BEM and instructor's permission.",
        "prereqs": []
    },
    "bem-101": {
        "id": "bem-101",
        "course_id": "BEM 101",
        "name": "Selected Topics in Business Economics and Management",
        "units": "",
        "terms": "offered by announcement",
        "description": "Topics determined by instructor.",
        "offered": true,
        "instructors": "Staff, visiting lecturers",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#selected-topics-in-business-economics-and-management",
        "prereq_text": "",
        "prereqs": []
    },
    "bem-102": {
        "id": "bem-102",
        "course_id": "BEM 102",
        "name": "Introduction to Accounting",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course combines accounting and finance in a dynamic, user-oriented approach. The goal is to enable students to understand what financial statements are (sources of information about a company), what they are not (facts devoid of interpretation or management influence), and how to critically understand and analyze them. The course will utilize actual SEC filings for several companies, across a variety of industries, through which the students will be exposed to important accounting concepts.",
        "offered": true,
        "instructors": "McAniff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#introduction-to-accounting",
        "prereq_text": "",
        "prereqs": []
    },
    "bem-103": {
        "id": "bem-103",
        "course_id": "BEM 103",
        "name": "Introduction to Finance",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Finance, or financial economics, covers two main areas: asset pricing and corporate finance. For asset pricing, a field that studies how investors value securities and make investment decisions, we will discuss topics like prices, risk, and return, portfolio choice, CAPM, market efficiency and bubbles, interest rates and bonds, and futures and options. For corporate finance, a field that studies how firms make financing decisions, we will discuss topics like security issuance, capital structure, and firm investment decisions (the net present value approach, and mergers and acquisitions). In addition, if time permits, we will cover some topics in behavioral finance and household finance such as limits to arbitrage and investor behavior.",
        "offered": true,
        "instructors": "Rosenthal",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#introduction-to-finance",
        "prereq_text": "Prerequisites: Ec 11 required; Ma 1 abc recommended (to be familiar with calculus and linear algebra).",
        "prereqs": [
            "ma-1-d",
            "ma-1-abc"
        ]
    },
    "bem-104": {
        "id": "bem-104",
        "course_id": "BEM 104",
        "name": "Investments",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Examines the theory of financial decision making and statistical techniques useful in analyzing financial data. Topics include portfolio selection, equilibrium security pricing, empirical analysis of equity securities, fixed-income markets, market efficiency, and risk management.",
        "offered": true,
        "instructors": "Cvitanic",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#investments",
        "prereq_text": "Prerequisites: Ec 11, BEM 103, some familiarity with statistics.",
        "prereqs": []
    },
    "bem-105": {
        "id": "bem-105",
        "course_id": "BEM 105",
        "name": "Options",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "An introduction to option pricing theory and risk management in the discrete-time, bi-nomial tree model, and the continuous time Black-Scholes-Merton framework. Both the partial differential equations approach and the martingale approach (risk-neutral pricing by expected values) will be developed. The course will cover the basics of Stochastic, Ito Calculus. Since 2015, the course is offered in the flipped format: the students are required to watch lectures online, while problem solving and case and paper presentations are done in class.",
        "offered": true,
        "instructors": "Cvitanic",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#options",
        "prereq_text": "Prerequisites: One of the following: Ec 122, Ge/ESE 118, Ma 1/103, MA 112 a, MA 112 b, or instructor's permission; BEM 103 strongly recommended; some familiarity with differential equations is helpful.",
        "prereqs": [
            "ma-1-d",
            "ma-112-ab",
            "ma-1-abc"
        ]
    },
    "bem-106": {
        "id": "bem-106",
        "course_id": "BEM 106",
        "name": "Data Science in Economics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Janas",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#data-science-in-economics",
        "prereq_text": "",
        "prereqs": []
    },
    "bem-107": {
        "id": "bem-107",
        "course_id": "BEM 107",
        "name": "Corporate Finance",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The main objective of the course is to develop insight into the process by which firms can create value for their shareholders. We will study major corporate decisions from the perspective of the firm with an emphasis on the interaction of the firm with financial markets: quantitative project evaluation for investment, choice between borrowing and issuing stock, dividend policy, organizational form (for example, mergers and acquisitions). Theory, empirical evidence, and case analysis all play significant roles in the course. Topics include discounted cash flow models, risk and return, capital asset pricing model, capital market efficiency, capital structure and the cost of capital and dividend policy.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#corporate-finance",
        "prereq_text": "Prerequisites: BEM 103.",
        "prereqs": []
    },
    "bem-108": {
        "id": "bem-108",
        "course_id": "BEM 108",
        "name": "Mathematical Models in Fintech",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "In this course we will go over recent works on topics broadly contained in the newly emerging field of Fintech. In particular, the topics include mathematical modeling of strategic actions of agents interacting via a blockchain technology, via crowdfunding platforms, and via online investment platforms (\"robo-advisors\").\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#mathematical-models-in-fintech",
        "prereq_text": "Prerequisites: Some knowledge of game theory and optimization is helpful, BEM 103 Introduction to Finance is recommended, and a calculus-based course in probability is required.",
        "prereqs": []
    },
    "bem-109": {
        "id": "bem-109",
        "course_id": "BEM 109",
        "name": "Understanding China through Finance",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Sinclair",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#understanding-china-through-finance",
        "prereq_text": "Prerequisites: BEM 103.",
        "prereqs": []
    },
    "bem-110": {
        "id": "bem-110",
        "course_id": "BEM 110",
        "name": "Venture Capital",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An introduction to the theory and practice of venture capital financing of start-ups. This course covers the underlying economic principles and theoretical models relevant to the venture investment process, as well as the standard practices used by industry and detailed examples. Topics include: The history of VC; VC stages of financing; financial returns to private equity; LBOs and MBOs; people versus ideas; biotech; IPOs; and CEO transitions.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#venture-capital",
        "prereq_text": "Prerequisites: BEM 102, 103.",
        "prereqs": []
    },
    "bem-111": {
        "id": "bem-111",
        "course_id": "BEM 111",
        "name": "Quantitative Risk and Portfolio Management",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Investors demand reward for taking risk. Concepts of Knightian risk and uncertainty; risk preference (risk-neutral Q vs. real-world P probability measures); coherent risk; and commonly used metrics for risk are explored. The integration of risk and reward in classical efficient portfolio construction is described, along with the drawbacks of this approach in practice and methods for addressing these drawbacks. The leptokurtic (fat-tailed) nature of financial data and approaches to modeling financial surprises are covered, leading to inherently leptokurtic techniques for estimating volatility and correlation. Scenario analysis, and regime-switching methods are shown to provide ways of dealing with risk in extreme environments. The special nature of modeling long/short portfolios (hedge funds) is explored. The text for the class is a Jupyter Notebook with Python code segments.",
        "offered": true,
        "instructors": "Winston",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#quantitative-risk-and-portfolio-management",
        "prereq_text": "Prerequisites: GE/ACM 118, BEM 105, or Ma 112.",
        "prereqs": [
            "acm-118",
            "ma-112-ab"
        ]
    },
    "bem-112": {
        "id": "bem-112",
        "course_id": "BEM 112",
        "name": "International Financial Markets",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The course offers an introduction to international financial markets, their comparative behavior, and their inter-relations. The principal focus will be on assets traded in liquid markets: currencies, equities, bonds, swaps, and other derivatives. Attention will be devoted to (1) institutional arrangements, taxation, and regulation, (2) international arbitrage and parity conditions, (3) valuation, (4) international diversification and portfolio management, (5) derivative instruments, (6) hedging, (7) dynamic investment strategies, (8) other topics of particular current relevance and importance.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#international-financial-markets",
        "prereq_text": "Prerequisites: BEM 103 or instructor permission.",
        "prereqs": []
    },
    "bem-113": {
        "id": "bem-113",
        "course_id": "BEM 113",
        "name": "Law and Finance for Start-Ups",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course combines elements of business, economics, engineering, financial statement analysis, strategy, and law to provide students interested in entrepreneurship with a practical understanding of the mechanics of growing a 'post-idea' company. The class will explain how prospective investor’s view entrepreneurs and their ideas, teach students about types of capital, sources of capital, and term sheets, and generally delve into the timing and financial alternatives and trade-offs facing entrepreneurs seeking capital in order to launch or grow a company. As such, this class is a complement to BEM 110 (Venture Capital) and E 102 (Scientific and Technology Entrepreneurship).",
        "offered": true,
        "instructors": "McAniff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#law-and-finance-for-start-ups",
        "prereq_text": "Prerequisites: Ec 11, E 102, or equivalent.",
        "prereqs": []
    },
    "bem-114": {
        "id": "bem-114",
        "course_id": "BEM 114",
        "name": "Hedge Funds",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course is an in-depth study of the hedge fund industry. We will study hedge fund trading strategies, the business model of hedge funds, hedge fund investors, as well as the institutional and regulatory framework in which hedge funds operate. The course will evaluate and analyze popular hedge fund trading strategies, including equity strategies (activist, market-neutral, long/short, event-driven, etc.), arbitrage strategies (derivatives, convertible, fixed-income, currency and global macro, etc.), and fund of hedge funds. The course will also analyze the hedge fund business model, including: performance evaluation and risk management; fund compensation and contractual features; transaction costs and market impact; as well as fund raising and marketing. In addition, the course will study the institutional relationships hedge funds have with service providers (prime brokers, custodian banks, etc.) and with regulators. We will also discuss public policy implications and the value of hedge funds in society. This course is designed to provide students with the skills necessary to evaluate hedge fund strategies, and to develop, manage, and successfully grow a hedge fund business.",
        "offered": true,
        "instructors": "Sinclair",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#hedge-funds",
        "prereq_text": "Prerequisites: BEM 103.",
        "prereqs": []
    },
    "bem-115": {
        "id": "bem-115",
        "course_id": "BEM 115",
        "name": "Business Law",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "McAniff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#business-law",
        "prereq_text": "Prerequisites: Ec 11 or equivalent.",
        "prereqs": []
    },
    "bem-117": {
        "id": "bem-117",
        "course_id": "BEM 117",
        "name": "Behavioral Finance",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Much of modern financial economics works with models in which agents are fully rational, in that they maximize expected utility and use Bayes' law to update their beliefs. Behavioral finance is a large and active field that develops and studies models in which some agents are less than fully rational. Such models have two building blocks: limits to arbitrage, which makes it difficult for rational traders to undo the dislocations caused by less rational traders; and psychology, which provides guidance for the kinds of deviations from full rationality we might expect to see. We discuss these two topics and consider a number of applications: asset pricing; individual trading behavior; the origin of bubbles; and financial crises.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#behavioral-finance",
        "prereq_text": "Prerequisites: Students are recommended (but not required) to take BEM 103 to become familiar with some basic concepts in finance.",
        "prereqs": []
    },
    "bemecese-119": {
        "id": "bemecese-119",
        "course_id": "BEM/Ec/ESE 119",
        "name": "Environmental Economics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course provides a survey from the perspective of economics of public policy issues regarding the management of natural resources and the protection of environmental quality. The course covers both conceptual topics and recent and current applications. Included are principles of environmental and resource economics, management of nonrenewable and renewable resources, and environmental policy with the focus on air pollution problems, both local problems (smog) and global problems (climate change).",
        "offered": true,
        "instructors": "Druckenmiller",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#environmental-economics",
        "prereq_text": "Prerequisites: Ec 11 or equivalent.",
        "prereqs": []
    },
    "bemec-120": {
        "id": "bemec-120",
        "course_id": "BEM/Ec 120",
        "name": "Introduction to Sports Science",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The use of large data sets and innovative statistical methods has revolutionized professional and intercollegiate sports. This course introduces students to the academic and professional world of contemporary sports science. The course will meet biweekly with instructor lectures on sports science and with guest speakers from collegiate and professional sports. Students will be introduced to the primary data sources for sports science, to methods used to collect sports performance and outcomes data, and to the statistical tools used for sports analytics (for example, logistic regression, regression trees and random forest, network models, time series, and natural language processing). Students will be responsible for weekly writing or homework assignments based on readings and speaker presentations, as well as a quarter-long sports analytics research project. Students should have some background in econometrics, statistics and probability, data science, or machine learning.",
        "offered": true,
        "instructors": "Alvarez and Eslinger",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bem/#introduction-to-sports-science",
        "prereq_text": "",
        "prereqs": []
    }
}