{
    "e-2": {
        "id": "e-2",
        "course_id": "E 2",
        "name": "Frontiers in Engineering and Applied Science",
        "units": "1 unit",
        "terms": "first term",
        "description": "Open for credit to first-year students and sophomores. Weekly seminar by a member of the EAS faculty to discuss their area of engineering and group's research at an introductory level. The course can be used to learn more about different areas of study within engineering and applied science. Graded pass/fail.",
        "offered": true,
        "instructors": "Gold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/e/#frontiers-in-engineering-and-applied-science",
        "prereq_text": "",
        "prereqs": []
    },
    "vce-81": {
        "id": "vce-81",
        "course_id": "VC/E 81",
        "name": "Careers in STEAM",
        "units": "1 unit (1-0-0)",
        "terms": "second term",
        "description": "A series of weekly seminars by practitioners in industry and academia working at the intersections of science, technology, engineering, art and design. The course can be used to learn more about the different careers in these interdisciplinary areas. Guest speakers will talk about their career trajectory, the nature of their work and the role that science, engineering and/or computing plays in their field. Speakers may include professionals in the fields of investigative science journalism, film/TV, apparel design and manufacturing, architecture, music/sound engineering and editing, art, culture and heritage exhibition and conservation, creative coding, technological art and other areas. Topics will be presented at an informal, introductory level. Graded pass/fail.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Mushkin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/e/#careers-in-steam",
        "prereq_text": "",
        "prereqs": []
    },
    "evc-88": {
        "id": "evc-88",
        "course_id": "E/VC 88",
        "name": "Critical Making",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course examines the concepts and practices of maker culture through hands-on engagement, guest workshops, lectures, reading and discussions on the relations between technology, culture and society. Classes may include digital fabrication, physical computing, and other DIY technologies as well as traditional making. Major writings and practitioners' work may be covered from the study of maker culture, DIY culture, media, critical theory, histories of science, design and art.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Mushkin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/e/#critical-making",
        "prereq_text": "",
        "prereqs": []
    },
    "ehvc-89": {
        "id": "ehvc-89",
        "course_id": "E/H/VC 89",
        "name": "New Media Arts in the 20th and 21st Centuries",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will examine artists' work with new technology, fabrication methods and media from the late 19th Century to the present. Major artists, exhibitions, and writings of the period will be surveyed. While considering this historical and critical context, students will create their own original new media artworks using technologies and/or fabrication methods they choose. Possible approaches to projects may involve robotics, electronics, computer programming, computer graphics, mechanics and other technologies. Students will be responsible for designing and fabricating their own projects. Topics may include systems in art, the influence of industrialism, digital art, robotics, telematics, media in performance, interactive installation art, and technology in public space. Artists studied may include Eadweard Muybridge, Marcel Duchamp, Vladmir Tatlin, John Cage, Jean Tinguely, Stelarc, Survival Research Laboratories, Lynne Hershman Leeson, Edwardo Kac, Natalie Jeremenjenko, Heath Bunting, Janet Cardiff and others.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Mushkin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/e/#new-media-arts-in-the-20th-and-21st-centuries",
        "prereq_text": "",
        "prereqs": []
    },
    "e-100": {
        "id": "e-100",
        "course_id": "E 100",
        "name": "Special Topics in Engineering Applied Science",
        "units": "",
        "terms": "terms to be arranged",
        "description": "Content may vary from year to year, at a level suitable for advanced undergraduate or graduate students. Topics will be chosen to meet the emerging needs of students.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/e/#special-topics-in-engineering-applied-science",
        "prereq_text": "",
        "prereqs": []
    },
    "esec-102": {
        "id": "esec-102",
        "course_id": "E/SEC 102",
        "name": "Scientific and Technology Entrepreneurship",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course introduces students to the conceptual frameworks, the analytical approaches, the personal understanding and skills, and the actions required to launch a successful technology-based company. Specifically, it addresses the challenges of evaluating new technologies and original business ideas for commercialization, determining how best to implement those ideas in a startup venture, attracting the resources needed for a new venture (e.g., key people, corporate partners, and funding), organizing and operating a new enterprise, structuring and negotiating important business relationships, and leading early stage companies toward \"launch velocity\".",
        "offered": true,
        "instructors": "Low",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/e/#scientific-and-technology-entrepreneurship",
        "prereq_text": "",
        "prereqs": []
    },
    "esec-103": {
        "id": "esec-103",
        "course_id": "E/SEC 103",
        "name": "Management of Technology",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "A course intended for students interested in learning how rapidly evolving technologies are harnessed to produce useful products or fertile new area for research. Students will work through Harvard Business School case studies, supplemented by lectures to elucidate the key issues. There will be a term project where students predict the future evolution of an exciting technology. The course is team-based and designed for students considering choosing an exciting research area, working in companies (any size, including start-ups) or eventually going to business school. Topics include technology as a growth agent, financial fundamentals, integration into other business processes, product development pipeline and portfolio management, learning curves, risk assessment, technology trend methodologies (scenarios, projections), motivation, rewards and recognition. Industries considered will include electronics (hardware and software), aerospace, medical, biotech, etc. Students will perform both primary and secondary research and through analysis present defensible projections. E/SEC 102 and E/ME/MedE 105 are useful but not required precursors.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/e/#management-of-technology",
        "prereq_text": "",
        "prereqs": []
    },
    "ememede-106-ab": {
        "id": "ememede-106-ab",
        "course_id": "E/ME/MedE 106 ab",
        "name": "Design for Freedom from Disability",
        "units": "9 units (3-0-6)",
        "terms": "terms to be arranged",
        "description": "This Product Design class focuses on people with Disabilities and is done in collaboration with Rancho Los Amigos National Rehabilitation Center. Students visit the Center to define products based upon actual stated and observed needs. Designs and testing are done in collaboration with Rancho associates. Speakers include people with assistive needs, therapists and researchers. Classes teach normative design methodologies as adapted for this special area.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/e/#design-for-freedom-from-disability",
        "prereq_text": "",
        "prereqs": []
    },
    "e-110": {
        "id": "e-110",
        "course_id": "E 110",
        "name": "Principles of University Teaching and Learning in STEM",
        "units": "3 units (2-0-1)",
        "terms": "second, third terms",
        "description": "This graduate course examines the research on university-level STEM (science, technology, engineering, and mathematics) teaching and learning, which has been used to inform a well-established body of evidence-based teaching practices. Weekly interactive meetings will provide focused overviews and guided application of key pedagogical research, such as prior knowledge and misconceptions, novice-expert differences, and cognitive development as applied to university teaching. We will explore the roles of active learning, student engagement, and inclusive teaching practices in designing classes where all students have an equal opportunity to be successful and feel a sense of belonging, both in the course and as scientists. Readings will inform in-class work and students will apply principles to a project of their choice.",
        "offered": true,
        "instructors": "Horii, Weaver",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/e/#principles-of-university-teaching-and-learning-in-stem",
        "prereq_text": "",
        "prereqs": []
    }
}