{
    "humen-21": {
        "id": "humen-21",
        "course_id": "Hum/En 21",
        "name": "Monsters and Marvels",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "Marvels flourish at the boundaries of literary invention, religious belief, and scientific inquiry, challenging assumptions about natural processes and expected outcomes. From Grendel, the monstrous foe of Beowulf, to Satan, Milton's charismatic antihero, this seminar examines the uses of the marvelous in a variety of texts and genres, including Shakespearian drama, medieval romance, and early travel-writing. Readings may include Beowulf, Marie de France, Chaucer, John Mandeville, Shakespeare, Milton.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Jahner",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#monsters-and-marvels",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-22": {
        "id": "humen-22",
        "course_id": "Hum/En 22",
        "name": "Inequality",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Haugen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#inequality",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-23": {
        "id": "humen-23",
        "course_id": "Hum/En 23",
        "name": "Literature and Medicine",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The relationship between patients and doctors, the ill and the well, involves a constant exchange of stories. In this course we will look more closely at the relationship between medicine and narrative through a selection of fiction, essays and poems that investigate the interplay between doubt and diagnosis, the idea of the case study, the problem of medical responsibility, and the language of pain and illness. Authors covered may include Sontag, Mantel, Conan Doyle, Freud, Woolf, Dickinson, Ishiguro and Shelley.",
        "offered": true,
        "instructors": "Gilmore",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#literature-and-medicine",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-24": {
        "id": "humen-24",
        "course_id": "Hum/En 24",
        "name": "The Scientific Imagination in English Literature",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course considers three periods of major scientific development-the Renaissance, the nineteenth century, and the modern period- to explore the influence new ideas, discoveries, and theories had on the imagination of English writers. We will look at the early modern interplay between magic and science, Romantic and Victorian debates about evolution, and the twentieth-century advent of modern physics as we confront consistent tropes like the mad scientist, the scientist-hero, and the problem of uncertainty. Authors covered may include Shakespeare, Marlowe, Bacon, Shelley, Darwin, Conan Doyle, Stevenson, Auden, McEwan, and Stoppard.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Gilmore",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#the-scientific-imagination-in-english-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-25": {
        "id": "humen-25",
        "course_id": "Hum/En 25",
        "name": "The Human Animal",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "European literature has long been a testing ground for radical new ideas which have come to shape our basic understanding of what it means to be a thinking, speaking and perhaps even autonomous human being. The question of what - if anything - makes us different from animals was debated from numerous points of view: including talking dogs, philosophizing women, bestial men, humanlike beasts, and other creatures that defied the conventions of the time. This course explores some of the key literary texts that shaped this debate and pays careful attention to their cultural environments. Selected readings from Cervantes, La Fontaine, Swift, Rousseau, Buffon, Aikin, and Wollstonecraft, among others.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#the-human-animal",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-26": {
        "id": "humen-26",
        "course_id": "Hum/En 26",
        "name": "What Is Imagination?",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Albert Einstein once said that imagination is everything, and even more important than knowledge. This course invites you to think about - and use - your imagination as we explore how the act of imagining has been viewed over time in the service of memory and creativity, in both the arts and the sciences. Readings will focus on the eighteenth and nineteenth centuries and will include Hume, Moritz, Kant, Novalis, Hoffmann, Coleridge, and Wordsworth.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#what-is-imagination?",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-27": {
        "id": "humen-27",
        "course_id": "Hum/En 27",
        "name": "Introduction to the Modern Novel",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course is an introduction to the study of the contemporary novel in English. We will explore the value of reading novels both for their own sake and for what they might tell us about the history, culture, and politics of the contemporary English language. We will read around three novels from the twenty-first century, along with relevant essays, keywords, and short stories. Authors read may include Zadie Smith, Bernadine Evaristo, Angie Cruz, Tommy Orange, Julie Buntin, Akwaeke Emezi, and Ocean Vuong.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Murphy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#introduction-to-the-modern-novel",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-28": {
        "id": "humen-28",
        "course_id": "Hum/En 28",
        "name": "Telling Time in American Modernism",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Sherazi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#telling-time-in-american-modernism",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-29": {
        "id": "humen-29",
        "course_id": "Hum/En 29",
        "name": "Dream Narratives",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Dream narratives reveal as much about cultural beliefs and superstitions as they do about techniques of narration and interpretation. This course investigates key developments in the literature on dreams and dream interpretations with examples drawn from the Renaissance through the beginning of the nineteenth century. Selected readings from Boccaccio, Descartes, Calderón, Shakespeare, and Diderot, among others.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#dream-narratives",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-30": {
        "id": "humen-30",
        "course_id": "Hum/En 30",
        "name": "Reading Animals",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "In this course we will look closely at representations of nonhuman animals in literature from the Middle Ages to our present moment as opportunities to revisit definitions of, and the boundaries created and blurred between, the \"human\" and the \"animal.\" Readings may include Marie de France, Marianne Moore, Franz Kafka, Donna Haraway, Donika Kelly, and K-Ming Chang.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Hill",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#reading-animals",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-31": {
        "id": "humen-31",
        "course_id": "Hum/En 31",
        "name": "Introduction to Black Literature and Culture in the United States",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This introductory humanities course is for anyone who wishes to celebrate, study, and pass on Black expressive culture to the next generation. Altogether, the course will be an in-depth introduction to the study of Black intersectional identities and lived experiences across the United States. Our texts will be comprised of a variety of artistic, cultural, and literary works in the US created since before its founding up until today. In addition to reading several literary texts, students will have the opportunity to learn about several works of cultural expression that have become beloved touchstones in Black history. Students will also read and apply several critical contexts and methodologies for the study of Black literature and culture and will regularly document their own goals for furthering this body of work for future scholars.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Murphy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#introduction-to-black-literature-and-culture-in-the-united-states",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-33": {
        "id": "humen-33",
        "course_id": "Hum/En 33",
        "name": "Modern Metamorphoses",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Narratives of metamorphosis have traditionally used their dramatic subject matter-a radical change of form-as a vehicle for social criticism. This course explores the ways in which twentieth-century writers experiment with the concept of metamorphosis to take on the most pressing political and social issues of their day, including slavery, women's rights, and critiques of capitalist excess. Readings to include Kafka, Garnett, Orwell, Tawada, and Erpenbeck.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#modern-metamorphoses",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-34": {
        "id": "humen-34",
        "course_id": "Hum/En 34",
        "name": "Literature and Deception",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "In this course, we will be considering lying and other types of deception from the point of view of literature and philosophy, with two main goals in mind: 1) to compare cultural practices of deception at various times in European history and 2) to think in general terms about the ability of a literary text to convey truth and falsehood. Can a fictional text be \"true\" in any meaningful sense, such as a political one? Or, as many people have thought over time, is it more accurate to think about literature as a beautiful lie? Readings will include the legend of Till Eulenspiegel as well as texts by Machiavelli, Shakespeare, Diderot, and those relating to the Ossian controversy.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#literature-and-deception",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-35": {
        "id": "humen-35",
        "course_id": "Hum/En 35",
        "name": "Beginning with Poems",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "Why begin the study of literature with poems? Written words are the building blocks of literature, and poetry, in Coleridge's famous equation, is \"the best words in the best order.\" To be understood and appreciated, poetry requires a close attention to words and their ordering as they are read and reread. All good literature requires such attention, but practically speaking, poetry provides the best way to acquire the art of rereading because of its shorter forms. More importantly, poetry can be the most emotionally intense and satisfying of literary forms. We will read a small number of poems written in English from the sixteenth to the twenty-first centuries from several genres - sonnet, ode, elegy, verse epistle, satire, villanelle - and on several subjects - love, death, and politics. Poets will include William Shakespeare, Emily Dickinson, and Louise Gluck.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Pigman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#beginning-with-poems",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-36": {
        "id": "humen-36",
        "course_id": "Hum/En 36",
        "name": "American Literature and Culture",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Studies of American aesthetics, genres, and ideas from the birth of the nation to the present. Students will be introduced to the techniques of formal analysis. We will consider what constitutes evidence in relation to texts and how to develop a persuasive interpretation. Topics may include Nature's Nation, slavery and its aftermath, individualism and the marketplace, the \"New Woman,\" and the relation between word and image.",
        "offered": true,
        "instructors": "Weinstein",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#american-literature-and-culture",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-37": {
        "id": "humen-37",
        "course_id": "Hum/En 37",
        "name": "Welcome to Dystopia",
        "units": "9 units (3-0-6)",
        "terms": "first",
        "description": "",
        "offered": true,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#welcome-to-dystopia",
        "prereq_text": "",
        "prereqs": []
    },
    "enwr-83": {
        "id": "enwr-83",
        "course_id": "En/Wr 83",
        "name": "Personal Narrative and STEM Research",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Hall",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#personal-narrative-and-stem-research",
        "prereq_text": "",
        "prereqs": []
    },
    "enwr-84": {
        "id": "enwr-84",
        "course_id": "En/Wr 84",
        "name": "Communicating Science to Non-Experts",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course offers instruction in writing and speaking about science and technology for non-expert audiences. Instruction focuses on how to convey complex technical information in clear, engaging prose and speech in a variety of contexts. Readings in different genres (e.g., the newspaper discovery story, the op-ed, the personal narrative, the explainer talk) raise issues for discussion and serve as models for assignments in these genres. The workshop-style nature of this course relies on drafting and revision in response to peer and instructor feedback. Satisfies the Institute scientific writing requirement and the option oral communications requirement for humanities majors.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Hall",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#communicating-science-to-non-experts",
        "prereq_text": "",
        "prereqs": []
    },
    "en-85": {
        "id": "en-85",
        "course_id": "En 85",
        "name": "Poetry Writing",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "When William Blake wrote \"to see a World in a Grain of Sand,\" he tapped into poetry's power to model the universe. For instance, once we set up a simile between \"world\" and \"grain of sand\", we can test this hypothesis of sameness. How is sand like the world? Where will the model fail? And what might that tell us? Imagery, sensory language, arguments, ideas, and verse form itself can lead poetry toward power and discovery. This pursuit can reach from the page into one's own life. We will work hard together on poems, our own and one another's. With permission of the instructor students may repeat the course for credit.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#poetry-writing",
        "prereq_text": "",
        "prereqs": []
    },
    "en-86": {
        "id": "en-86",
        "course_id": "En 86",
        "name": "Fiction Writing",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The class is conducted as a workshop of fiction writing. Contemporary short stories and novel excerpts are discussed, as well as the art and craft of writing well. The course covers the essential elements of fiction writing, including character, voice, setting, world building, scene, summary, plot, and dialogue. Each week, we discuss a particular craft element, analyze published fiction, and provide feedback on student writing. Near the end of the course, students critique the work of their peers in small-group workshops.",
        "offered": true,
        "instructors": "Lepucki",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#fiction-writing",
        "prereq_text": "",
        "prereqs": []
    },
    "en-87": {
        "id": "en-87",
        "course_id": "En 87",
        "name": "Creative Nonfiction",
        "units": "9 units (3-0-6)",
        "terms": "first",
        "description": "",
        "offered": true,
        "instructors": "Lepucki",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#creative-nonfiction",
        "prereq_text": "",
        "prereqs": []
    },
    "en-89": {
        "id": "en-89",
        "course_id": "En 89",
        "name": "Journalism and Storytelling",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Today's political and social turmoil have cast a sometimes harsh light on news media and the journalistic writing approach. Is the media fulfilling its role in our democracy? What should it be? And what approach should journalists take in their reporting and writing? This course will ponder these questions as it explores how to construct interesting, relevant, journalistic storytelling, including the use of new media tools. It will emphasize the foundations of the craft, such as close attention to fact, accuracy, clarity and precision, and examine its critical components, such as story form, reporting and interviewing, theme and scene, and character development. It will offer opportunities to construct a long-form journalistic piece. Students will produce numerous stories and other writing during the class, including profiles, issues, analysis and reviews. Several of these will be offered for publication in The California Tech. There will be class visits by professional journalists and a possible off-campus excursion.",
        "offered": true,
        "instructors": "Kipling",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#journalism-and-storytelling",
        "prereq_text": "",
        "prereqs": []
    },
    "en-98": {
        "id": "en-98",
        "course_id": "En 98",
        "name": "Reading in English",
        "units": "9 units (1-0-8)",
        "terms": "",
        "description": "An individual program of directed reading in English or American literature, in areas not covered by regular courses. En 98 is intended primarily for English majors and minors. Interested students should confer with an English faculty member and agree upon a topic before registering for the course.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#reading-in-english",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "en-99-ab": {
        "id": "en-99-ab",
        "course_id": "En 99 ab",
        "name": "Senior Tutorial for English Majors",
        "units": "9 units (1-0-8)",
        "terms": "",
        "description": "Students will study research methods and write a research paper. Required of students in the English option.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#senior-tutorial-for-english-majors",
        "prereq_text": "",
        "prereqs": []
    },
    "en-100": {
        "id": "en-100",
        "course_id": "En 100",
        "name": "Artificial Life: Literary Automata",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Well before the advent of the Machine Age, literary texts have been populated by various kinds of ingenious automata, often in animal or human form. This course surveys the role of the automaton in literary texts in order to consider how the notion of \"artificial life\" changes over time, with a focus on the special case of the human machine. Readings from the eighteenth and nineteenth centuries to include texts by la Mettrie, Hoffmann, Kleist, Shelley, Poe, and de l'Isle-Adam. We will conclude with a classic text from the twentieth century: Isaac Asimov'sI, Robot.",
        "offered": true,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#artificial-life:-literary-automata",
        "prereq_text": "",
        "prereqs": []
    },
    "en-101": {
        "id": "en-101",
        "course_id": "En 101",
        "name": "Recalling the Wild",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "City-dwellers invented the concept of wilderness, as a space apart from human laws and culture. This course takes a critical look at the different values attributed to that space as it has been colonized by the human imagination. Our discussions will focus on the emergence of the perception of wilderness in European literature in the eighteenth and nineteenth centuries, but we conclude with the question: what meaning do we invest the concept of \"wilderness\" with today? Readings will include works by Buffon, Toqueville, Chateaubriand, Byron, Thoreau, Wells, and London.",
        "offered": true,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#recalling-the-wild",
        "prereq_text": "",
        "prereqs": []
    },
    "en-103": {
        "id": "en-103",
        "course_id": "En 103",
        "name": "Introduction to Medieval British Literature",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course offers a tour of major (as well as some minor) genres and works written in Britain prior to 1500. Far from a literary \"dark age,\" the Middle Ages fostered dramatic experiments in narrative form, bequeathing to modern literature some of its best-loved genres and texts. We will practice reading in Middle English-the language of Chaucer and his contemporaries-while we concentrate on the following questions: how did these texts circulate among readers? How do they establish their authority? What kinds of historical and cultural currents to they engage? Texts may include the lives of saints, the confessions of sinners, drama, lyrics, romances, selections from Chaucer's Canterbury Tales, and Malory's Morte Darthur. Readings will be in Middle and modern English.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#introduction-to-medieval-british-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "en-106": {
        "id": "en-106",
        "course_id": "En 106",
        "name": "Poetry and the Project of Justice",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course explores how contemporary poets grapple with the most urgent questions of our moment: identity, equality, environmental crisis, and justice. In this class, students will gain confidence in reading, discussing, and writing about contemporary poems and will encounter recent and more distant traditions of protest poetry. We will ask how poetic language articulates questions of embodiment, community, law, and memory. The syllabus will focus in particular on writers of color, including queer and indigenous poets, and will include opportunities to attend local poetry readings.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Jahner",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#poetry-and-the-project-of-justice",
        "prereq_text": "",
        "prereqs": []
    },
    "en-107": {
        "id": "en-107",
        "course_id": "En 107",
        "name": "Medieval Romance",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The medieval term romanz designated both a language, French, and a genre, romance, dedicated to the adventures of knights and ladies and the villains, monsters, magic, and miles that stood in their way. This course explores key examples from the twelfth through the fifteenth centuries, while also examining evolutions in the form. We will consider how romances figured love and desire as well as negotiated questions of law, territory, and cultural difference. Authors and texts may include Chretien de Troyes, Marie de France, Gawain and the Green Knight, Arthurian legends, outlaw tales, and hagiography.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Jahner",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#medieval-romance",
        "prereq_text": "",
        "prereqs": []
    },
    "en-109": {
        "id": "en-109",
        "course_id": "En 109",
        "name": "Madness and Reason",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Madness threatens to dissolve boundaries of the most various kinds: between the human and the inhumane, reality and fantasy, sickness and health. One of the tasks of a literary text is to subdue and contain madness through the construction of rational frameworks. How does a literary text accomplish this? Which strategies, such as the use of irony and humor, are the most effective? What role do insane characters play in literary texts? And when - if ever - should we consider an excess of reason as a kind of madness in its own right? Selected readings from Shakespeare, Voltaire, Goethe, Hoffmann, Büchner, Gogol, and Schnitzler, among others.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#madness-and-reason",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-110": {
        "id": "envc-110",
        "course_id": "En/VC 110",
        "name": "Sinners, Saints, and Sexuality in Premodern Literature",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This class explores the history of sexuality and gender across the Middle Ages and Renaissance. Exploring both literary texts and visual representation, it considers how previous eras and cultures understood embodiment, sexuality, and gender and asks how we, as modern readers and viewers, approach these questions across the distance of centuries. We will read across a wide range of literature, including theology, philosophy, fiction, romance, and spiritual biography, and examine manuscript illustrations and other early visual media. Questions we will take up include the following: how did writers and artists construct the \"naturalness\" or \"unnaturalness\" of particular bodies and bodily acts? How did individuals understand the relationship between their own bodies and those of others? In what ways did writing and art authorize, scrutinize, or otherwise parse the boundaries of the licit and illicit? Finally, how have modern critics framed these questions? How do we approach and make use of earlier theories of sex and gender?",
        "offered": true,
        "instructors": "Jahner",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#sinners,-saints,-and-sexuality-in-premodern-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "en-112": {
        "id": "en-112",
        "course_id": "En 112",
        "name": "Nineteenth-Century American Poetry",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "In the 1855 edition of Leaves of Grass, Walt Whitman claimed that \"the United States themselves are essentially the greatest poem.\" We might ask any number of questions in response to Whitman. If the United States are a poem, then who wrote it? What is this poem about? What genre is it? Is anyone reading it? Is it actually any good? Though we might approach Whitman's statement with some apprehension from our historical moment, this course will take seriously American life lived within poetry and the lives poems lived across the country. Together, we will track the development of American poetry as it engages with enslavement, abolition, genocide, war, beauty, nature, racialization, constructions of gender, sexuality, and affect. Ultimately, we will ask what reading nineteenth-century American poetry, or nineteenth-century America as a poem, might mean for our understanding of the country today. Readings may include Bryant, Poe, Longfellow, Schoolcraft (Bamewawagezhikaquay), Whitman, Dickinson, Harper, Dunbar, and Noguchi.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Hill",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#nineteenth-century-american-poetry",
        "prereq_text": "",
        "prereqs": []
    },
    "en-113": {
        "id": "en-113",
        "course_id": "En 113",
        "name": "Shakespeare's Career: Comedies and Histories",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The first of a two-course sequence on Shakespeare's career as a dramatist and poet. We will read plays from the first half of Shakespeare's career, his comedies and histories. Particular attention will be paid to Shakespeare's use of his sources and to the textual history of the plays. En 113 and En 114 may be taken independently and, usually, are given in alternate years.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Pigman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#shakespeare's-career:-comedies-and-histories",
        "prereq_text": "",
        "prereqs": []
    },
    "en-114": {
        "id": "en-114",
        "course_id": "En 114",
        "name": "Shakespeare's Career: Tragedies and Tragicomedies",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The second of a two-course sequence on Shakespeare's career as a dramatist and poet. We will read works from the second half of Shakespeare's career, his tragedies, tragicomedies, and Sonnets. Particular attention will be paid to Shakespeare's use of his sources and to the textual history of the plays. En 113 and En 114 may be taken independently and, usually, are given in alternate years.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Pigman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#shakespeare's-career:-tragedies-and-tragicomedies",
        "prereq_text": "",
        "prereqs": []
    },
    "en-115": {
        "id": "en-115",
        "course_id": "En 115",
        "name": "The Women of Ancient Epic",
        "units": "",
        "terms": "second term",
        "description": "Epic remains the most ancient and most modern of literary genres. Women in ancient epic begin as prizes of honor for male warriors and become powerful witches and queens, while some contemporary women writers allow their ancient heroines to speak in their own voices. From Homer to the present, epic narratives also traverse continents as they narrate the founding and foundering of empires historical and imaginary. This course introduces students to key classical epics while exploring historical and contemporary adaptations from Dante'sDivine Comedyto Madeline Miller'sCirce. By examining the afterlives of epic, we will consider how the genre changes when taken up by the gender typically marginalized in the classical tradition. Possible authors include Homer, Apollonius of Rhodes, Virgil, Ovid, Dante, Christa Wolf, Ursula K. Le Guin, Madeline Miller, and María Baranda.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Jahner, Pigman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#the-women-of-ancient-epic",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-116": {
        "id": "envc-116",
        "course_id": "En/VC 116",
        "name": "Picturing the Universe",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Whether you are a physicist, photographer, or bibliophile, grab a warm jacket. The night sky beckons. In addition to observing and photographing our own starry skies, we will study 19thcentury literary, artistic, and scientific responses to new understandings of the universe as dynamic, decentered, and limitless. In Victorian England, picturing the universe in literature and recording celestial light in photographs defied the physiological limitations of human observation and fueled larger debates about objective evidence and subjective documentation. Prerequisites: students are required to take two First-Year Humanities classes before enrolling in Advanced Humanities.",
        "offered": true,
        "instructors": "Sullivan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#picturing-the-universe",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-117": {
        "id": "envc-117",
        "course_id": "En/VC 117",
        "name": "The New York School of Poets",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Schneiderman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#the-new-york-school-of-poets",
        "prereq_text": "",
        "prereqs": []
    },
    "en-118": {
        "id": "en-118",
        "course_id": "En 118",
        "name": "Mythology",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Haugen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#mythology",
        "prereq_text": "",
        "prereqs": []
    },
    "en-119": {
        "id": "en-119",
        "course_id": "En 119",
        "name": "Displacement",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Haugen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#displacement",
        "prereq_text": "",
        "prereqs": []
    },
    "en-120": {
        "id": "en-120",
        "course_id": "En 120",
        "name": "What Women Want: Desire and the Modern American Novel",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The question of what a woman wants animates a central strain of the modern American novel, as do evolving ideas about what women can and cannot have. This course considers female desire-for personal agency and freedom, self- and sexual fulfillment, economic and social opportunity-across a half dozen novels written from about 1880 - 1940, in light of some of the cultural forces that shape and constrain characters' (and real women's) horizons. Authors covered may include Henry James, Edith Wharton, Theodore Dreiser, Anzia Yezierska, Nella Larsen, and Zora Neale Hurston.",
        "offered": true,
        "instructors": "Jurca",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#what-women-want:-desire-and-the-modern-american-novel",
        "prereq_text": "",
        "prereqs": []
    },
    "en-121": {
        "id": "en-121",
        "course_id": "En 121",
        "name": "Early Novels",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Before modern media, novels had to stand in for every type of sequential entertainment: television, movies, and even hyperlinked web pages. The stories we read in this class, dating from ancient Greece to the 1600s, are long, florid, fantastic, and crammed with characters. What do these books reveal about the values and interests of people in the past? Readings may include Heliodorus, Lodovico Ariosto, and John Bunyan.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Haugen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#early-novels",
        "prereq_text": "",
        "prereqs": []
    },
    "en-123": {
        "id": "en-123",
        "course_id": "En 123",
        "name": "The 19th-Century English Novel",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "A survey of the 19th-century novel from Austen through Conrad, with special emphasis upon the Victorians. Major authors may include Austen, Shelley, Dickens, Eliot, Thackeray, Gaskell, Brontë, Collins, Trollope, Stoker, Hardy.",
        "offered": true,
        "instructors": "Gilmore",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#the-19th-century-english-novel",
        "prereq_text": "",
        "prereqs": []
    },
    "en-124": {
        "id": "en-124",
        "course_id": "En 124",
        "name": "20th-Century British Fiction",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "A survey of the 20th-century British and Irish novel, from the modernist novel to the postcolonial novel. Major authors may include Conrad, Joyce, Woolf, Forster, Lawrence, Orwell, Amis, Lessing, Rushdie.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#20th-century-british-fiction",
        "prereq_text": "",
        "prereqs": []
    },
    "en-125": {
        "id": "en-125",
        "course_id": "En 125",
        "name": "British Romantic Literature",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A selective survey of English writing in the late 18th and early 19th centuries. Major authors may include Blake, Wordsworth, Coleridge, Byron, Keats, Percy Shelley, Mary Shelley, and Austen. Particular attention will be paid to intellectual and historical contexts and to new understandings of the role of literature in society.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Gilmartin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#british-romantic-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "en-126": {
        "id": "en-126",
        "course_id": "En 126",
        "name": "Gothic Fiction",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The literature of horror, fantasy, and the supernatural, from the late 18th century to the present day. Particular attention will be paid to gothic's shifting cultural imperative, from its origins as a qualified reaction to Enlightenment rationalism, to the contemporary ghost story as an instrument of social and psychological exploration. Issues will include atmosphere and the gothic sense of space; gothic as a popular pathology; and the gendering of gothic narrative. Fiction by Walpole, Shelley, Brontë, Stoker, Poe, Wilde, Angela Carter, and Toni Morrison. Film versions of the gothic may be included.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Gilmartin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#gothic-fiction",
        "prereq_text": "",
        "prereqs": []
    },
    "en-127": {
        "id": "en-127",
        "course_id": "En 127",
        "name": "Jane Austen",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will focus on the major novels of Jane Austen: Northanger Abbey, Sense and Sensibility, Pride and Prejudice, Mansfield Park, Emma, and Persuasion. Film and television adaptations will also be considered, and students may have the opportunity to read Austen's unfinished works, as well as related eighteenth- and nineteenth-century British fiction and non-fiction.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Gilmartin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#jane-austen",
        "prereq_text": "",
        "prereqs": []
    },
    "en-128": {
        "id": "en-128",
        "course_id": "En 128",
        "name": "Modern and Contemporary Irish Literature",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The development of Irish fiction, poetry, and drama from the early 20th-century Irish literary renaissance, through the impact of modernism, to the Field Day movement and other contemporary developments. Topics may include the impact of political violence and national division upon the literary imagination; the use of folk and fairy-tale traditions; patterns of emigration and literary exile; the challenge of the English language and the relation of Irish writing to British literary tradition; and recent treatments of Irish literature in regional, postcolonial, and global terms. Works by Joyce, Yeats, Synge, Friel, O'Brien, Heaney, Boland, and others.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Gilmartin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#modern-and-contemporary-irish-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-129": {
        "id": "envc-129",
        "course_id": "En/VC 129",
        "name": "Literature/Photography/Facticity",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "\"It is the picture of life contrasted with the fact of life, the ideal contrasted with the real, which makes criticism possible,\" insists Frederick Douglass. This course will take an historical approach to the relationship between literature and photography by examining what Douglass refers to as the contrast between \"picture\" and \"fact\" from the advent of photography in the nineteenth century to our present moment. Together, we will think about how each medium creates images, invites different ways of reading or viewing, and makes forms of individual, collective, and political representation possible. We will also examine the ways in which photography and literature shape our understanding of temporality, truth, memory, and history. In addition to our experience of literary and photographic works, theoretical texts on photography will inform the ways of reading and ways of seeing we will develop in this course. Readings may include Boucicault, Douglass, Dunbar, Hartmann, Barthes, Lorde, and Rankine.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#literature/photography/facticity",
        "prereq_text": "",
        "prereqs": []
    },
    "en-131": {
        "id": "en-131",
        "course_id": "En 131",
        "name": "Poe's Afterlife",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course focuses on Edgar Allan Poe and the considerable influence his works have had on other writers. Authors as diverse as Charles Baudelaire, Jules Verne, Jorge Luis Borges, Vladimir Nabokov, John Barth, and Philip Roth have used Poe's stories as departure points for their own work. We shall begin by reading some of Poe's s classic short stories, including \"The Narrative of Arthur Gordon Pym,\" \"The Purloined Letter,\" and others. We shall then explore how and why Poe's stories have been so important for authors, despite the fact that his reputation as a great American writer, unlike Hawthorne's and Melville's, for example, is a relatively recent phenomenon.",
        "offered": true,
        "instructors": "Weinstein",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#poe's-afterlife",
        "prereq_text": "",
        "prereqs": []
    },
    "en-132": {
        "id": "en-132",
        "course_id": "En 132",
        "name": "After Austen: Nineteenth-Century British Women's Writing",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The Victorian period introduced a huge array of new possibilities and constraints for women of all classes, as it witnessed rapid urbanization and industrialization, a changing conception of marriage and motherhood, and a new set of professional restrictions but also opportunities. This class focuses on novels by and about women, as it seeks to take the measure of these transformations and of a larger culture's reaction to them. How did women imagine and re-imagine themselves and what they wanted? How did notions of femininity and masculinity change? How do the imaginings of the Victorians resonate now? Authors studied may include Eliot, Gaskell, the Brontes, Oliphant, Braddon, and Scheiner.",
        "offered": true,
        "instructors": "Gilmore",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#after-austen:-nineteenth-century-british-women's-writing",
        "prereq_text": "",
        "prereqs": []
    },
    "en-133": {
        "id": "en-133",
        "course_id": "En 133",
        "name": "Paradise Lost",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "We will spend the term studying the famous and eccentric epic poem 'Paradise Lost' (1674) by the British poet and politician John Milton. Each week we will read about 1,000 to 1,500 lines of difficult but beautiful poetry, looking especially for its visual images, literary and mythological references, and poetic sounds, as well as Milton's copious and paradoxical philosophical stances. You will never forget the central character of Satan, the parliament of devils in Hell, the theological conversations in Heaven between God and Jesus, Eve being tempted by diabolical arguments to eat the forbidden fruit, and Adam and Eve being driven from the Garden of Eden at the point of an avenging angel's sword.\n Not offered 2024-25",
        "offered": false,
        "instructors": "Haugen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#paradise-lost",
        "prereq_text": "",
        "prereqs": []
    },
    "en-134": {
        "id": "en-134",
        "course_id": "En 134",
        "name": "The Career of Herman Melville",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "The course will analyze Melville's career starting with Typee and ending with Billy Budd. Special attention will be given to Moby-Dick and Pierre. The centrality of Melville's position in American literature will be considered from a variety of perspectives, including aesthetics, representations of race, class, and gender, the role of the audience, and connections with other authors.",
        "offered": true,
        "instructors": "Weinstein",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#the-career-of-herman-melville",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-135": {
        "id": "envc-135",
        "course_id": "En/VC 135",
        "name": "Dickens's London",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Charles Dickens and London have perhaps the most famous relationship of any writer and city in English. In this course, we will investigate both the London Dickens knew, and the portrait of the city that he painted, by reading one of Dickens's great mid-career novels alongside a selection of contemporary texts and images and secondary historical sources. We will think about the gap-or overlap- between history and fiction, the idea of the novelist as alternative historian, and the idea of the novel as historical document. Historical topics covered may include: the development of the Victorian police force; plague and public health; Victorian poverty; colonialism and imperialism; Dickens and his illustrators; Victorian exhibition and museum culture; and marriage and the cult of domesticity, among others. Students will practice both textual and visual analysis skills. In addition to written work, students should expect to be responsible for making a short research presentation at some point in the term.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Gilmore",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#dickens's-london",
        "prereq_text": "",
        "prereqs": []
    },
    "en-136": {
        "id": "en-136",
        "course_id": "En 136",
        "name": "The Fiction of Charles Dickens",
        "units": "9 units (3-0-6)",
        "terms": "",
        "description": "An overview of the Great Inimitable's fiction, concentrating on four texts representative of different phases of his novel-writing career and their relationship to the changing world of Victorian Britain: Oliver Twist, Dombey and Son, Bleak House, Our Mutual Friend.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#the-fiction-of-charles-dickens",
        "prereq_text": "",
        "prereqs": []
    },
    "en-137": {
        "id": "en-137",
        "course_id": "En 137",
        "name": "African American Literature",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course analyzes some of the great works of American literature written by African Americans. This body of writing gives rise to two crucial questions: How does African American literature constitute a literary tradition of its own? How is that tradition inextricable from American literary history? From slave narratives to Toni Morrison's Beloved, from the Harlem Renaissance to Alice Walker, from Ralph Ellison to Walter Mosley, African American literature has examined topics as diverse and important as race relations, class identification, and family life. We shall analyze these texts not only in relation to these cultural issues, but also in terms of their aesthetic and formal contributions.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#african-american-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "en-138": {
        "id": "en-138",
        "course_id": "En 138",
        "name": "Twain and His Contemporaries",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will study the divergent theories of realism that arose in the period after the Civil War and before World War I. Authors covered may include Howells, James, Charlotte Perkins Gilman, Twain, Sarah Orne Jewett, Jacob Riis, Stephen Crane, and W. E. B. DuBois.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Weinstein",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#twain-and-his-contemporaries",
        "prereq_text": "",
        "prereqs": []
    },
    "en-139": {
        "id": "en-139",
        "course_id": "En 139",
        "name": "Ancient Greek Epic Poetry",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "We will start the term by reading Homer's 'Iliad' (possibly 8th century B.C.) for two weeks. This is a disconnected, strange, and violent poem, which raises the excellent question how it could become a widely revered classic down to our own time. To look for answers--answers that perhaps also apply to any \"classic\" book-- we will go on to study the acts of interpretation, revision, and recycling that made the 'Iliad' fresh and different, sometimes virtually unrecognizable, for each new generation of readers. We survey surprising ancient Greek philosophical interpretations, a medieval romance by Geoffrey Chaucer set in ancient Troy, a fake Scottish epic poem allegedly composed by \"Ossian,\" Chuck Palahniuk's novel 'Fight Club' (1996), and other works. My suggestion for you will be that the 'Iliad' has remained alive for millennia only through quasi-biological processes of mistranscription, mutation, and nonlinear evolution.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Haugen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#ancient-greek-epic-poetry",
        "prereq_text": "",
        "prereqs": []
    },
    "en-140": {
        "id": "en-140",
        "course_id": "En 140",
        "name": "African American Expatriate Culture in Postwar Europe",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "In the years following World War II, an unprecedented number of African American writers and artists moved to Paris and Rome, many seeking greater personal liberties and a refuge from racial discrimination at home. As we explore literature, nonfiction, and visual culture created by African Americans in postwar Europe, we will consider: how and why does the postwar creative scene in Paris differ from that of Rome? We will analyze postwar African American expatriate writing's unique and often critical perspectives regarding American society and culture and identify the literary strategies that writers used to address the changing times, promote social justice, and advance new narrative forms, often by crossing traditional boundaries of genre and nation. Authors and artists studied may include James Baldwin, Richard Wright, Barbara Chase-Riboud, William Demby, Maya Angelou, and Ralph Ellison.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Sherazi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#african-american-expatriate-culture-in-postwar-europe",
        "prereq_text": "",
        "prereqs": []
    },
    "en-141": {
        "id": "en-141",
        "course_id": "En 141",
        "name": "Science on Stage",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Science is no stranger to performance. There is a long tradition of presenting scientific ideas on various stages, whether for audiences comprised of experts or for a curious public, and there is an equally long tradition of integrating scientific ideas into theatrical works. In this course, we will read several scientifically informed plays, with a focus on the twentieth century. We will explore the ways in which scientific ideas shape the dialogue, plot, and staging of theatrical works and how theater can cause us to consider scientific thought from a new perspective. Readings are likely to include The Physicists (Durenmatt), Kopenhagen (Frayn), Arcadia (Stoppard), and Inherit the Wind (Lawrence and Lee), among other examples, including contemporary works. This course will also invite both scientists and playwrights into the classroom in order to enrich classroom discussions.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#science-on-stage",
        "prereq_text": "",
        "prereqs": []
    },
    "en-142": {
        "id": "en-142",
        "course_id": "En 142",
        "name": "US literature before the Civil War",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The course will focus on the literature - what F.O. Matthiessen called \"The American Renaissance\" -- produced in the period leading up to the Civil War. We will consider representations of gender, race, and class, as well as the aesthetic sensibilities in works by the following: Frederick Douglass, Ralph Waldo Emerson, Harriet Jacobs, Herman Melville, Edgar Allan Poe, Harriet Beecher Stowe, and Henry David Thoreau.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Weinstein",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#us-literature-before-the-civil-war",
        "prereq_text": "",
        "prereqs": []
    },
    "en-149": {
        "id": "en-149",
        "course_id": "En 149",
        "name": "The Literature of Crisis",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Novels, poetry, and memoirs often hinge on experiences of crisis. They can be individual and/or general, historically particular and/or universal: a plane crash; a war; a sudden death; a prolonged one. This course will examine representations of crisis, with a specific focus on their narrative implications. What are the temporal, spatial, and aesthetic effects of crisis? Authors covered may include Joan Didion, Percival Everett, Allen Ginsberg, Tom McCarthy, Toni Morrison, Kurt Vonnegut, Virginia Woolf, Elie Wiesel, Joy Williams.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Weinstein",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#the-literature-of-crisis",
        "prereq_text": "",
        "prereqs": []
    },
    "en-150": {
        "id": "en-150",
        "course_id": "En 150",
        "name": "Chaos and Literature",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "We tend to think of literary texts as models of a stable poetic order, but modern and postmodern writers conduct increasingly bold experiments to test the contrary. This class explores how writers from the nineteenth century onward draw upon ancient and contemporary concepts of chaos to test out increasingly sophisticated models of disorder though writing. Readings to include Lucretius, Serres, Calvino, Barth, Stoppard, and Kehlmann.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#chaos-and-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "en-151": {
        "id": "en-151",
        "course_id": "En 151",
        "name": "Keeping Time",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The way in which humans perceive and record time has a discernable history, and literary texts offer us one of the best ways to study it, particularly in times of war and natural catastrophe. With a focus on 16th- through 18th-century European literature, we will examine various techniques of literary time-keeping as they relate to topics such as, fame and mortality, as well as the experience of time's slowness and acceleration. Readings will include selections from Baroque emblem books as well as texts by Montaigne, Milton, Pepys, Defoe, and Rousseau.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#keeping-time",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-160-ab": {
        "id": "envc-160-ab",
        "course_id": "En/VC 160 ab",
        "name": "Classical Hollywood Cinema",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course introduces students to Hollywood films and filmmaking during the classical period, from the coming of sound through the '50s. Students will develop the techniques and vocabulary appropriate to the distinct formal properties of film. Topics include the rise and collapse of the studio system, technical transformations (sound, color, deep focus), genre (the musical, the melodrama), cultural contexts (the Depression, World War II, the Cold War), audience responses, and the economic history of the film corporations. Terms may be taken independently. Part a covers the period 1927-1940. Part b covers 1941-1960.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Jurca",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#classical-hollywood-cinema",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-161": {
        "id": "envc-161",
        "course_id": "En/VC 161",
        "name": "The New Hollywood",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course examines the post-classical era of Hollywood filmmaking with a focus on the late 1960s through the 1970s, a period of significant formal and thematic experimentation. We will study American culture and politics as well as film in this era, as we consider the relation between broader social transformations and the development of new narrative conventions and cinematic techniques. We will pay particular attention to the changing film industry and its influence on this body of work. Films covered may includeBonnie and Clyde,The Graduate,The Godfather,Taxi Driver, andJaws.",
        "offered": true,
        "instructors": "Jurca",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#the-new-hollywood",
        "prereq_text": "",
        "prereqs": []
    },
    "en-163": {
        "id": "en-163",
        "course_id": "En 163",
        "name": "Octavia E. Butler and the Literature of Black Futures",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This advanced humanities course begins with a selection of Octavia E. Butler's (1947-2006) novels and short stories. Born here in Pasadena, CA, Butler's writing explored issues such as chattel slavery, climate change, genetic engineering, pandemics, nuclear apocalypse, and post-apocalyptic life. She was attentive to Black and indigenous modes of care, healing, social justice, and organizing. We will pay special attention to Butler's critical and theoretical contributions to the fields of Afrofuturism, Black studies, feminisms, gender and sexuality studies, and the environmental humanities by reading her works in conjunction with criticism and theory. In the second half of the seminar, we will explore connections between Butler and the works of other Afrofuturists and Black science fiction writers today. Finally, we will explore our own ideas for extending Butler's literature of Black futures today.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Murphy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#octavia-e.-butler-and-the-literature-of-black-futures",
        "prereq_text": "",
        "prereqs": []
    },
    "en-164": {
        "id": "en-164",
        "course_id": "En 164",
        "name": "Contemporary Black Diasporic Literature and Culture",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "What is a Black diasporic analytic and how might it deepen our understandings of the cultural and literary significance of Black lives around the world? The expressive genius of Black people across Black diasporas has resulted in an extensive tradition within and beyond English-speaking nations. This is an intensive advanced humanities reading course on Black diasporic literature and culture since the 1980s as well as the various histories that inform and shape this body of work. Students will read several recent works of Black diasporic literature and culture and criticism that have reshaped our understandings of family, gender, identity, labor, migration, nation, race, sexuality, and more. Students will analyze several literary and cultural works and practice writing their own Black diasporic criticism and interpretive methodologies.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Murphy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#contemporary-black-diasporic-literature-and-culture",
        "prereq_text": "",
        "prereqs": []
    },
    "en-165": {
        "id": "en-165",
        "course_id": "En 165",
        "name": "Black Feminist and Queer Literature and Thought",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "For centuries, Black people, especially queer and trans women, and non-binary and queer folx, writing in Africa, the Caribbean, Europe, the United States, and more, have used literature to reimagine feminisms and queerness. In the decades following the second-wave feminist movement, a body of writing necessitated the creation of \"Black feminist criticism\" and \"queer of color critique.\" It was a moment in which Black people across identities and national origins wrote several works that radically retheorized family, home, gender, love, race, sexuality, work, and more, in ways that challenged cultures of violence in favor of imagining beloved communities. In this advanced humanities course, students will read, discuss, and better understand multiple literary and critical works participating in Black feminisms and Black queer thought in order to theorize new possibilities for Black futures.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Murphy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#black-feminist-and-queer-literature-and-thought",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-172": {
        "id": "envc-172",
        "course_id": "En/VC 172",
        "name": "Heritage and Its Discontents",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Jurca",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#heritage-and-its-discontents",
        "prereq_text": "",
        "prereqs": []
    },
    "en-179": {
        "id": "en-179",
        "course_id": "En 179",
        "name": "Constituting Citizenship before the Fourteenth Amendment",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "What can a slave's narrative teach us about citizenship? How did the new nation identify citizens when its Constitution seemed so silent on the matter? And how did one tailor's pamphlet result in one of most massive restrictions of free speech in U.S. history? Our goal over the semester will be to sketch a story of African American literary production from the latter half of the eighteenth century to the Civil War and to tease out, through this literature, developing understandings of citizenship in the United States. We will read letters, poems, sermons, songs, constitutions and bylaws, short stories, and texts that simply defy easy categorization. We will also spend several sessions becoming familiar with key newspapers and magazines-Freedom's Journal, Frederick Douglass's Paper, The Anglo-African Magazine, Christian Recorder, and The Crisis-to deepen our understanding of the kinds of things people were reading and writing on a regular basis and the kinds of arguments they were making. Writers up for discussion may include: Frederick Douglass, James Madison, Harriet Jacobs, Henry David Thoreau, Sojourner Truth, and David Walker.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#constituting-citizenship-before-the-fourteenth-amendment",
        "prereq_text": "",
        "prereqs": []
    },
    "en-180": {
        "id": "en-180",
        "course_id": "En 180",
        "name": "Special Topics in English",
        "units": "9 units (3-0-6)",
        "terms": "offered by announcement",
        "description": "This is an advanced humanities course on a specialized topic in English. It is usually taught by new or visiting faculty. The course may be re-taken for credit except as noted in the course announcement. Limited to 15 students. See registrar's announcement for details.",
        "offered": true,
        "instructors": "Staff, visitor",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#special-topics-in-english",
        "prereq_text": "",
        "prereqs": []
    },
    "en-181": {
        "id": "en-181",
        "course_id": "En 181",
        "name": "Hardy: The Wessex Novels",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will examine the body of work that the late Victorian novelist Thomas Hardy published under the general title The Wessex Novels, that is, the sequence of works from Far from the Madding Crowd to Jude the Obscure. The six main novels will be read critically to give a sense of the totality of this greatest British regional novelist's achievement.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#hardy:-the-wessex-novels",
        "prereq_text": "",
        "prereqs": []
    },
    "en-183": {
        "id": "en-183",
        "course_id": "En 183",
        "name": "Victorian Crime Fiction",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "In 19th-century Britain, for the first time in human history, more of a nation's citizens came to live in urban areas than in rural ones. This result of the Industrial Revolution produced many effects, but in the fiction of the period, one of the most striking was an obsession with the problem of crime. Victorian authors filled their novels with murder, prisons, poisonings, prostitution, criminals, and the new figure of the detective; in this class we will look at the social history, publishing developments, and formal dilemmas that underlay such a response. Authors studied may include Dickens, Collins, Braddon, Conan Doyle, Chesterton, and Conrad, among others.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Gilmore",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#victorian-crime-fiction",
        "prereq_text": "",
        "prereqs": []
    },
    "en-185": {
        "id": "en-185",
        "course_id": "En 185",
        "name": "Dickens and the Dickensian",
        "units": "9 units (3-0-6)",
        "terms": "",
        "description": "The adjective \"Dickensian\" makes an almost daily appearance in today's newspapers, magazines, and other media sources. It is used to describe everything from outrageous political scandals, to Bollywood musicals, to multiplot novels. But what does the word really mean? And what part of Charles Dickens's output does it refer to? This class will consider some of Dickens's most famous works alongside a series of contemporary novels, all critically described in \"Dickensian\" terms. The main concern will be equally with style and form, and 19th-century and present-day circumstances of production (e.g., serialization, mass production, Web publication, etc.). Authors considered (aside from Dickens) may include Richard Price, Zadie Smith, Monica Ali, and Jonathan Franzen.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#dickens-and-the-dickensian",
        "prereq_text": "",
        "prereqs": []
    },
    "en-186": {
        "id": "en-186",
        "course_id": "En 186",
        "name": "The Novel of Education",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This class takes up a set of mostly very funny, mostly 20th century British novels to frame a simple-seeming, yet deceptively complicated set of questions: What does it mean to be educated? Who has access to education? What does an ideal education consist in? And ultimately: What is a university for? As we think through these questions we will read op/eds and investigative journalism in addition to fiction, and we will consider a variety of university-centered topics (determined by student interest) including issues of gender, class, privilege, race, and genius. Authors read may include Sayers, Larkin, Amis, C.P. Snow, Lodge, and Zadie Smith.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Gilmore",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#the-novel-of-education",
        "prereq_text": "",
        "prereqs": []
    },
    "en-190": {
        "id": "en-190",
        "course_id": "En 190",
        "name": "Chaucer",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course devotes itself to the writings of the diplomat, courtier, bureaucrat, and poet, Geoffrey Chaucer. Best known for the Canterbury Tales, Chaucer also authored dream visions, lyrics, and philosophical meditations. This course will introduce you to some better-known and lesser-known works in the Chaucerian corpus, while also exploring questions central to the production and circulation of literature in the fourteenth and fifteenth centuries. What did it mean to \"invent\" a literary work in late medieval England? How did Chaucer imagine himself as a writer and reader? What are the hallmarks of Chaucerian style, and how did Chaucer become the canonical author he is today? We will read Chaucer's works in their original language, Middle English, working slowly enough to give participants time to familiarize themselves with syntax and spelling. No previous experience with the language is necessary.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Jahner",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#chaucer",
        "prereq_text": "",
        "prereqs": []
    },
    "en-191": {
        "id": "en-191",
        "course_id": "En 191",
        "name": "Masterworks of Contemporary Latin American Fiction",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course studies Latin America's most influential authors in the 20th and 21st centuries, with a focus on short stories and novellas produced by the region's avant-garde and \"boom\" generations. Authors may include Allende, Bombal, Borges, García Márquez, Quiroga, Poniatowska, and Vargas Llosa. All readings and discussions are in English.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#masterworks-of-contemporary-latin-american-fiction",
        "prereq_text": "",
        "prereqs": []
    },
    "enh-193": {
        "id": "enh-193",
        "course_id": "En/H 193",
        "name": "Cervantes, Truth or Dare: Don Quixote in an Age of Empire",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Studies Cervantes's literary masterpiece, Don Quixote, with a view to the great upheavals that shaped the early modern world: Renaissance Europe's discovery of America; feudalism's demise and the rise of mass poverty; Reformation and Counter-Reformation; extermination of heretics and war against infidels; and the decline of the Hapsburg dynasty. The hapless protagonist of Don Quixote calls into question the boundaries between sanity and madness, truth and falsehood, history and fiction, objectivity and individual experience. What might be modern, perhaps even revolutionary, in Cervantes's dramatization of the moral and material dilemmas of his time? Conducted in English.",
        "offered": true,
        "instructors": "Wey-Gomez",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/en/#cervantes,-truth-or-dare:-don-quixote-in-an-age-of-empire",
        "prereq_text": "",
        "prereqs": []
    }
}