{
    "ge-1": {
        "id": "ge-1",
        "course_id": "Ge 1",
        "name": "Earth and Environment",
        "units": "9 units (3-3-3)",
        "terms": "third term",
        "description": "An introduction to the ideas and approaches of earth and planetary sciences, including both the special challenges and viewpoints of these kinds of science as well as the ways in which basic physics, chemistry, and biology relate to them. In addition to a wide-ranging lecture-oriented component, there will be a required field trip component. The lectures and topics cover such issues as solid Earth structure and evolution, plate tectonics, oceans and atmospheres, climate change, and the relationship between geological and biological evolution. Not offered on a pass/fail basis.  Satisfies the menu requirement of the Caltech core curriculum.",
        "offered": false,
        "instructors": "Asimow",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#earth-and-environment",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-10": {
        "id": "ge-10",
        "course_id": "Ge 10",
        "name": "Frontiers in Geological and Planetary Sciences",
        "units": "2 units (2-0-0)",
        "terms": "second term",
        "description": "The course may be taken multiple times. Weekly seminar by a member of the Division of Geological and Planetary Sciences or a visitor to discuss a topic of their current research at an introductory level. The course is designed to introduce students to research and research opportunities in the division and to help students find faculty sponsors for individual research projects. Graded pass/fail.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Knutson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#frontiers-in-geological-and-planetary-sciences",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-11-a": {
        "id": "ge-11-a",
        "course_id": "Ge 11 a",
        "name": "Introduction to Earth and Planetary Sciences: Earth as a Planet",
        "units": "9 units (3-3-3)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Bucholz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#introduction-to-earth-and-planetary-sciences:-earth-as-a-planet",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-11-b": {
        "id": "ge-11-b",
        "course_id": "Ge 11 b",
        "name": "Introduction to Earth and Planetary Sciences: Earth and the Biosphere",
        "units": "9 units (3-3-3)",
        "terms": "third term",
        "description": "Systematic introduction to the origin and evolution of life and its impact on the oceans, atmosphere, and climate of Earth. Topics covered include ancient Earth surface environments and the rise of atmospheric oxygen. Microbial and molecular evolution, photosynthesis, genes as fossils. Banded iron stones, microbial mats, stromatolites, and global glaciation. Biological fractionation of stable isotopes. Numerical calibration of the geological timescale, the Cambrian explosion, mass extinctions, and human evolution. The course usually includes one major field trip and laboratory studies of rocks, fossils, and geological processes. Although Ge 11 abcd is designed as a sequence, any one term may be taken as a standalone course. Biologists are particularly welcome.",
        "offered": true,
        "instructors": "Fischer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#introduction-to-earth-and-planetary-sciences:-earth-and-the-biosphere",
        "prereq_text": "Prerequisites: Ch 1 a.",
        "prereqs": []
    },
    "geay-11-c": {
        "id": "geay-11-c",
        "course_id": "Ge/Ay 11 c",
        "name": "Introduction to Earth and Planetary Sciences: Planetary Sciences",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A broad introduction to the present state and early history of the solar system, including terrestrial planets, giant planets, moons, asteroids, comets, and rings. Earth-based observations, observations by planetary spacecraft, study of meteorites, and observations of extrasolar planets are used to constrain models of the dynamical and chemical processes of planetary systems. Although Ge 11 abcd is designed as a sequence, any one term may be taken as a standalone course. Physicists and astronomers are particularly welcome.",
        "offered": true,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#introduction-to-earth-and-planetary-sciences:-planetary-sciences",
        "prereq_text": "Prerequisites: Ma 1 ab, Ph 1 ab.",
        "prereqs": [
            "ma-1-d",
            "ph-1-abc",
            "ma-1-abc"
        ]
    },
    "ge-11-d": {
        "id": "ge-11-d",
        "course_id": "Ge 11 d",
        "name": "Introduction to Earth and Planetary Sciences: Geophysics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An introduction to the geophysics of the solid earth; formation of planets; structure and composition of Earth; interactions between crust, mantle, and core; surface and internal dynamics; mantle convection; imaging of the interior; seismic tomography. Although Ge 11 abcd is designed as a sequence, any one term can be taken as a standalone course.",
        "offered": true,
        "instructors": "Gurnis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#introduction-to-earth-and-planetary-sciences:-geophysics",
        "prereq_text": "Prerequisites: Ch 1, Ma 2 a, Ph 2 a.",
        "prereqs": [
            "ph-2-abc",
            "ma-2102"
        ]
    },
    "fsge-16": {
        "id": "fsge-16",
        "course_id": "FS/Ge 16",
        "name": "First-year Seminar: Earthquakes",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "Earthquakes and volcanic eruptions constitute some of the world's major natural hazards. What is the science behind prediction and/or rapid response to these events? We will review the current understanding of the science, the efforts that have been made in earthquake and volcano forecasting, and real-time response to these events. We will learn about advances in earthquake preparation in Southern California, and volcanic eruption forecasting and hazard mitigation elsewhere. There is a required field trip to visit faults and volcanoes somewhere in southern California. First-year (undergraduates) only; limited enrollment.",
        "offered": true,
        "instructors": "Stock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#first-year-seminar:-earthquakes",
        "prereq_text": "",
        "prereqs": []
    },
    "fsesege-18": {
        "id": "fsesege-18",
        "course_id": "FS/ESE/Ge 18",
        "name": "First-Year Seminar: The Unseen Microbial World in Plain Sight",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "To paraphrase a Caltech engineering colleague: \"In terms of Earth and the Environment, our species had been nothing more than the hood ornament on a really interesting car. We should be studying what's under the hood, the microbial world, if we want to understand the engine\". We will spend the term examining striking examples of microbes and microbial activities in the environment. First-year (undergraduates) only; limited enrollment.",
        "offered": true,
        "instructors": "Leadbetter",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#first-year-seminar:-the-unseen-microbial-world-in-plain-sight",
        "prereq_text": "",
        "prereqs": []
    },
    "fsge-20": {
        "id": "fsge-20",
        "course_id": "FS/Ge 20",
        "name": "First-Year Seminar: Life in the Universe",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#first-year-seminar:-life-in-the-universe",
        "prereq_text": "",
        "prereqs": []
    },
    "esege-21": {
        "id": "esege-21",
        "course_id": "ESE/Ge 21",
        "name": "Tutorial: Biogeochemistry of Carbon Sequestration",
        "units": "9 units (2-0-7)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Sessions",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#tutorial:-biogeochemistry-of-carbon-sequestration",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-40": {
        "id": "ge-40",
        "course_id": "Ge 40",
        "name": "Special Problems for Undergraduates",
        "units": "",
        "terms": "any term",
        "description": "This course provides a mechanism for undergraduates to undertake honors-type work in the geologic sciences. By arrangement with individual members of the staff. Graded pass/fail.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#special-problems-for-undergraduates",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-41-abc": {
        "id": "ge-41-abc",
        "course_id": "Ge 41 abc",
        "name": "Undergraduate Research and Bachelor's Thesis",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Guidance in seeking research opportunities and in formulating a research plan leading to preparation of a bachelor's thesis is available from the GPS option representatives. Graded pass/fail.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#undergraduate-research-and-bachelor's-thesis",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-101": {
        "id": "ge-101",
        "course_id": "Ge 101",
        "name": "Introduction to Geology and Geochemistry",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "A broad, high-level survey of geology and geochemistry with emphasis on quantitative understanding. Historical deduction in the geological and planetary sciences. Plate tectonics as a unifying theory of geology. Igneous and metamorphic processes, structural geology and geomorphology; weathering and sedimentary processes. Nucleosynthesis and chemical history of the solar system; distribution of the elements in the earth; isotopic systems as tracers and clocks; evolution of the biosphere; global geochemical and biogeochemical cycles; geochemical constraints on deep Earth structure. One mandatory overnight field trip, selected laboratory exercises, and problem sets.",
        "offered": true,
        "instructors": "Bucholz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#introduction-to-geology-and-geochemistry",
        "prereq_text": "Prerequisites: graduate standing or instructor's permission.",
        "prereqs": []
    },
    "ge-102": {
        "id": "ge-102",
        "course_id": "Ge 102",
        "name": "Introduction to Geophysics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An introduction to the physics of the earth. The present internal structure and dynamics of the earth are considered in light of constraints from the gravitational and magnetic fields, seismology, and mineral physics. The fundamentals of wave propagation in earth materials are developed and applied to inferring Earth structure. The earthquake source is described in terms of seismic and geodetic signals. The following are also considered: the contributions that heat-flow, gravity, paleomagnetic, and earthquake mechanism data have made to our understanding of plate tectonics, the driving mechanism of plate tectonics, and the energy sources of mantle convection and the geodynamo.",
        "offered": true,
        "instructors": "Gurnis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#introduction-to-geophysics",
        "prereq_text": "Prerequisites: Ma 2, Ph 2, or Ge 108, or equivalents.",
        "prereqs": [
            "ph-2-abc",
            "ma-2102"
        ]
    },
    "ge-103": {
        "id": "ge-103",
        "course_id": "Ge 103",
        "name": "Introduction to the Solar System",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Formation and evolution of the solar system. Interiors, surfaces, and atmospheres. Orbital dynamics, chaos, and tidal friction. Cratering. Comets and asteroids. Extrasolar planetary systems.",
        "offered": true,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#introduction-to-the-solar-system",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "ge-104": {
        "id": "ge-104",
        "course_id": "Ge 104",
        "name": "Introduction to Geobiology",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Lectures about the interaction and coevolution of life and Earth surface environments. We will cover essential concepts and major outstanding questions in the field of geobiology, and introduce common approaches to solving these problems. Topics will include biological fractionation of stable isotopes; history and operation of the carbon and sulfur cycles; evolution of oxygenic photosynthesis; biomineralization; mass extinctions; analyzing biodiversity data; constructing simple mathematical models constrained by isotope mass balance; working with public databases of genetic information; phlyogenetic techniques; microbial and molecular evolution.",
        "offered": true,
        "instructors": "Fischer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#introduction-to-geobiology",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "bigeese-105": {
        "id": "bigeese-105",
        "course_id": "Bi/Ge/ESE 105",
        "name": "Evolution",
        "units": "12 units (3-4-5)",
        "terms": "second term",
        "description": "The theory of evolution is arguably biology’s greatest idea and serves as the overarching framework for thinking about the diversity and relationships between organisms. This course will present a broad picture of evolution starting with discussions of the insights of the great naturalists, the study of the genetic basis of variation, and an introduction to the key driving forces of evolution. Following these foundations, we will then focus on a number of case studies including the following: evolution of oxygenic photosynthesis, origin of eukaryotes, multicellularity, influence of symbiosis, the emergence of life from the water (i.e. fins to limbs), the return of life to the water (i.e. limbs to fins), diversity following major extinction events, the discovery of Archaea, insights into evolution that have emerged from sequence analysis, and finally human evolution and the impact of humans on evolution (including examples such as antibiotic resistance). A specific focus for considering these issues will be the island biogeography of the Galapagos.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Phillips, Orphan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#evolution",
        "prereq_text": "Prerequisites: Completion of Core Curriculum Courses. Maximum enrollment: 15, by application only.",
        "prereqs": []
    },
    "ge-106": {
        "id": "ge-106",
        "course_id": "Ge 106",
        "name": "Introduction to Structural Geology",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Description and origin of main classes of deformational structures. Introduction to continuum mechanics and its application to rock deformation. Interpretation of the record of deformation of the earth's crust and upper mantle on microscopic, mesoscopic, and megascopic scales. Introduction to the tectonics of mountain belts.",
        "offered": true,
        "instructors": "Avouac",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#introduction-to-structural-geology",
        "prereq_text": "Prerequisites: Ge 11 ab.",
        "prereqs": []
    },
    "ayge-107": {
        "id": "ayge-107",
        "course_id": "Ay/Ge 107",
        "name": "Introduction to Astronomical Observation",
        "units": "12 units (2-2-8)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Hillenbrand, de Kleer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#introduction-to-astronomical-observation",
        "prereq_text": "Prerequisites: CS 1 or equivalent coding experience recommended.",
        "prereqs": [
            "cs-1-x",
            "cs-1"
        ]
    },
    "ge-108": {
        "id": "ge-108",
        "course_id": "Ge 108",
        "name": "Applications of Physics to the Earth Sciences",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "An intermediate course in the application of the basic principles of classical physics to the earth sciences. Topics will be selected from: mechanics of rotating bodies, the two-body problem, tidal theory, oscillations and normal modes, diffusion and heat transfer, wave propagation, electro- and magneto-statics, Maxwell's equations, and elements of statistical and fluid mechanics.",
        "offered": true,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#applications-of-physics-to-the-earth-sciences",
        "prereq_text": "Prerequisites: Ph 2 and Ma 2 or equivalent.",
        "prereqs": [
            "ph-2-abc",
            "ma-2102"
        ]
    },
    "ge-109": {
        "id": "ge-109",
        "course_id": "Ge 109",
        "name": "Oral Presentation",
        "units": "",
        "terms": "",
        "description": "Practice in the effective organization and the delivery of oral presentation of scientific results before groups. Units and scheduling are done by the individual options. Graded pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#oral-presentation",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-111-ab": {
        "id": "ge-111-ab",
        "course_id": "Ge 111 ab",
        "name": "Applied Geophysics Seminar and Field Course",
        "units": "6 units (3-3-0); second term. Prerequisite: instructor’s permission. 9 units (0-3-6); spring break, third term. Prerequisite: Ge 111 a",
        "terms": "",
        "description": "An introduction to the theory and application of basic geophysical field techniques consisting of a comprehensive survey of a particular field area using a variety of methods (e.g., gravity, magnetic, electrical, GPS, seismic studies, and satellite remote sensing). The course will consist of a seminar that will discuss the scientific background for the chosen field area, along with the theoretical basis and implementation of the various measurement techniques. The 4-5-day field component will be held in spring break, and the data analysis component is covered in Ge 111 b. May be repeated for credit with an instructor’s permission.\n Taught every other year; not offered 2024-25.",
        "offered": true,
        "instructors": "Clayton, Simons",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#applied-geophysics-seminar-and-field-course",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-112": {
        "id": "ge-112",
        "course_id": "Ge 112",
        "name": "Sedimentology and Stratigraphy",
        "units": "12 units (3-5-4)",
        "terms": "third term",
        "description": "Systematic analysis of transport and deposition in sedimentary environments and the resulting composition, texture, and structure of both clastic and chemical sedimentary rocks. The nature and genesis of sequence architecture of sedimentary basins and cyclic aspects of sedimentary accumulation will be introduced. Covers the formal and practical principles of definition of stratigraphic units, correlation, and the construction of a geologic timescale. Field trip and laboratory exercises.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Grotzinger",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#sedimentology-and-stratigraphy",
        "prereq_text": "Prerequisites: Ge 11 ab.",
        "prereqs": []
    },
    "ge-114-a": {
        "id": "ge-114-a",
        "course_id": "Ge 114 a",
        "name": "Mineralogy",
        "units": "",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Rossman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#mineralogy",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-114-b": {
        "id": "ge-114-b",
        "course_id": "Ge 114 b",
        "name": "Mineralogy Laboratory",
        "units": "3 units (0-3-0)",
        "terms": "first term",
        "description": "Laboratory work involving the examination, characterization and identification of important minerals by their physical properties.",
        "offered": true,
        "instructors": "Rossman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#mineralogy-laboratory",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-115-a": {
        "id": "ge-115-a",
        "course_id": "Ge 115 a",
        "name": "Petrology and Petrography: Igneous Petrology",
        "units": "9 units (3-3-3)",
        "terms": "second term",
        "description": "Study of the origin, occurrence, tectonic significance and evolution of igneous rocks with emphasis on use of phase equilibria and geochemistry.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Stolper",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#petrology-and-petrography:-igneous-petrology",
        "prereq_text": "Prerequisites: Ge 114 ab.",
        "prereqs": []
    },
    "ge-115-b": {
        "id": "ge-115-b",
        "course_id": "Ge 115 b",
        "name": "Petrology and Petrography: Metamorphic Petrology",
        "units": "9 units (3-3-3)",
        "terms": "third term",
        "description": "The mineralogic and chemical composition, occurrence, and classification of metamorphic rocks; interpretation of mineral assemblages in the light of chemical equilibrium and experimental studies. Discussion centers on the use of metamorphic assemblages to understand tectonic, petrologic, and geochemical problems associated with convergent plate boundaries and intrusion of magmas into the continental crust. May be taken before Ge 115 a.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Eiler",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#petrology-and-petrography:-metamorphic-petrology",
        "prereq_text": "Prerequisites: Ge 114 ab.",
        "prereqs": []
    },
    "ge-115-c": {
        "id": "ge-115-c",
        "course_id": "Ge 115 c",
        "name": "Petrography Laboratory",
        "units": "6 units (0-4-2)",
        "terms": "third term",
        "description": "Laboratory exercises dealing with examination of igneous and metamorphic rocks and minerals in hand-sample and with the petrographic microscope and other mineral identification methods.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#petrography-laboratory",
        "prereq_text": "Prerequisites: Ge 114 and either Ge 115 a or Ge 115 b.",
        "prereqs": []
    },
    "ge-116": {
        "id": "ge-116",
        "course_id": "Ge 116",
        "name": "Analytical Techniques Laboratory",
        "units": "9 units (1-4-4)",
        "terms": "second term",
        "description": "Methods of quantitative laboratory analysis of rocks, minerals, and fluids in geological and planetary sciences. Consists of five intensive two-week modules covering scanning electron microscopy (imaging, energy-dispersive X-ray spectroscopy, electron backscatter diffraction); the electron microprobe (wavelength-dispersive X-ray spectroscopy); X-ray powder diffraction; optical, infrared, and Raman spectroscopy; and plasma source mass spectrometry for elemental and radiogenic isotope analysis. Satisfies the Institute core requirement for an additional introductory laboratory course.",
        "offered": true,
        "instructors": "Asimow, Ehlmann, Jackson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#analytical-techniques-laboratory",
        "prereq_text": "Prerequisites: Ge 114 a or instructor's permission.",
        "prereqs": []
    },
    "geay-117": {
        "id": "geay-117",
        "course_id": "Ge/Ay 117",
        "name": "Bayesian Statistics and Data Analysis",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "In modern fields of planetary science and astronomy, vast quantities of data are often available to researchers. The challenge is converting this information into meaningful knowledge about the universe. The primary focus of this course is the development of a broad and general tool set that can be applied to the student's own research. We will use case studies from the astrophysical and planetary science literature as our guide as we learn about common pitfalls, explore strategies for data analysis, understand how to select the best model for the task at hand, and learn the importance of properly quantifying and reporting the level of confidence in one's conclusions.",
        "offered": true,
        "instructors": "Knutson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#bayesian-statistics-and-data-analysis",
        "prereq_text": "Prerequisites: CS 1 or equivalent.",
        "prereqs": [
            "cs-1-x",
            "cs-1"
        ]
    },
    "ge-119": {
        "id": "ge-119",
        "course_id": "Ge 119",
        "name": "Geology of the American Southwest",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course is a lecture-based course on the geologic history of the American Southwest (broadly defined as the southern parts of California, Nevada, Utah, and Colorado as well as Arizona and New Mexico). Lectures will cover the geologic history in chronologic order and will highlight the important scientific studies that deciphered the geologic record of the region.",
        "offered": true,
        "instructors": "Bucholz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#geology-of-the-american-southwest",
        "prereq_text": "Prerequisites: Ge 11 a or Ge 101 or permission of the instructor.",
        "prereqs": []
    },
    "ge-120-a": {
        "id": "ge-120-a",
        "course_id": "Ge 120 a",
        "name": "Introduction to Field Geology",
        "units": "9 units (1-6-2)",
        "terms": "third term",
        "description": "A comprehensive introduction to methods of geological field mapping in preparation for summer field camp. Field exercises and associated projects introduce methods of geological mapping, field observations, and graphical techniques in the analysis of geologic maps.\n Offered every other year. Offered 2024-25.",
        "offered": true,
        "instructors": "Bucholz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#introduction-to-field-geology",
        "prereq_text": "Prerequisites: Ge 11 ab, Ge 106 (may be taken concurrently with Ge 106).",
        "prereqs": []
    },
    "ge-120-b": {
        "id": "ge-120-b",
        "course_id": "Ge 120 b",
        "name": "Field Geology: Summer Field Camp",
        "units": "15 units (0-15-0)",
        "terms": "summer term",
        "description": "",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#field-geology:-summer-field-camp",
        "prereq_text": "Prerequisites: Ge 120 a or instructor's permission.",
        "prereqs": []
    },
    "ge-121-abc": {
        "id": "ge-121-abc",
        "course_id": "Ge 121 abc",
        "name": "Advanced Field Geology",
        "units": "12 units (0-9-3)",
        "terms": "first, second, third terms",
        "description": "Field mapping and supporting laboratory studies in topical problems related to the geology of the southwestern United States. Course provides a breadth of experience in igneous, metamorphic, or sedimentary rocks or geomorphology. Multiple terms of 121 may be taken more than once for credit if taught by different instructors.",
        "offered": true,
        "instructors": "Avouac (a), Bucholz (b), Tejada (c)",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#advanced-field-geology",
        "prereq_text": "Prerequisites: Ge 120 or equivalent, or instructor's permission. For Ge 121a (Lamb): Ge 125 or instructor approval.",
        "prereqs": []
    },
    "ge-122-abc": {
        "id": "ge-122-abc",
        "course_id": "Ge 122 abc",
        "name": "Field Geology Seminar",
        "units": "6 units (1-3-2)",
        "terms": "first, second, third terms",
        "description": "Each term, a different field topic will be examined in both seminar and field format. Relevant readings will be discussed in a weekly class meeting. During the 3-day weekend field trip we will examine field localities relevant to the topic, to permit detailed discussion of the observations. Topic varies every year. Graded pass/fail.\n Ge 122b offered 2024-25 (second term only).",
        "offered": true,
        "instructors": "Stock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#field-geology-seminar",
        "prereq_text": "Prerequisites: Ge 11 ab or Ge 101, or instructor's permission.",
        "prereqs": []
    },
    "ge-123": {
        "id": "ge-123",
        "course_id": "Ge 123",
        "name": "Continental Crust Seminar",
        "units": "3 units (1-0-2)",
        "terms": "third term",
        "description": "A seminar course focusing on a topic related to the continental crust, which will be decided depending on the interest of participating students. Potential topics include arc magmatism, the evolution of the composition of continental crust through time, formation of granites, or specific localities/regions that help shape our understanding of continental crust generation. The course will comprise weekly student-lead discussion of scientific journal articles.",
        "offered": true,
        "instructors": "Bucholz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#continental-crust-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-124-a": {
        "id": "ge-124-a",
        "course_id": "Ge 124 a",
        "name": "Paleomagnetism and Magnetostratigraphy",
        "units": "6 units (0-0-6)",
        "terms": "third term",
        "description": "Application of paleomagnetism to the solution of problems in stratigraphic correlation and to the construction of a high-precision geological timescale. A field trip to the southwest United States or Mexico to study the physical stratigraphy and magnetic zonation, followed by lab analysis.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Kirschvink",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#paleomagnetism-and-magnetostratigraphy",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-124-b": {
        "id": "ge-124-b",
        "course_id": "Ge 124 b",
        "name": "Paleomagnetism and Magnetostratigraphy",
        "units": "9 units (3-3-3)",
        "terms": "third term",
        "description": "The principles of rock magnetism and physical stratigraphy; emphasis on the detailed application of paleomagnetic techniques to the determination of the history of the geomagnetic field.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Kirschvink",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#paleomagnetism-and-magnetostratigraphy",
        "prereq_text": "Prerequisites: Ge 11 ab.",
        "prereqs": []
    },
    "geese-125": {
        "id": "geese-125",
        "course_id": "Ge/ESE 125",
        "name": "Geomorphology",
        "units": "12 units (3-5-4)",
        "terms": "first term",
        "description": "A quantitative examination of landforms, runoff generation, river hydraulics, sediment transport, erosion and deposition, hillslope creep, landslides and debris flows, glacial processes, and submarine and Martian landscapes. Field and laboratory exercises are designed to facilitate quantitative measurements and analyses of geomorphic processes.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Lamb",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#geomorphology",
        "prereq_text": "Prerequisites: Ge 11 a or instructor's permission.",
        "prereqs": []
    },
    "ge-126": {
        "id": "ge-126",
        "course_id": "Ge 126",
        "name": "Topics in Earth Surface Processes",
        "units": "6 units (2-0-4)",
        "terms": "second term",
        "description": "A seminar-style course focusing on a specific theme within geomorphology and sedimentology depending on student interest. Potential themes could include river response to climate change, bedrock erosion in tectonically active mountain belts, or delta evolution on Earth and Mars. The course will consist of student-led discussions centered on readings from peer-reviewed literature.",
        "offered": true,
        "instructors": "Lamb",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#topics-in-earth-surface-processes",
        "prereq_text": "",
        "prereqs": []
    },
    "gech-127": {
        "id": "gech-127",
        "course_id": "Ge/Ch 127",
        "name": "Nuclear Chemistry",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "A survey course in the properties of nuclei, and in atomic phenomena associated with nuclear-particle detection. Topics include rates of production and decay of radioactive nuclei; interaction of radiation with matter; nuclear masses, shapes, spins, and moments; modes of radioactive decay; nuclear fission and energy generation.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Burnett",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#nuclear-chemistry",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "gech-128": {
        "id": "gech-128",
        "course_id": "Ge/Ch 128",
        "name": "Cosmochemistry",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Examination of the chemistry of the interstellar medium, of protostellar nebulae, and of primitive solar-system objects with a view toward establishing the relationship of the chemical evolution of atoms in the interstellar radiation field to complex molecules and aggregates in the early solar system that may contribute to habitability. Emphasis will be placed on identifying the physical conditions in various objects, timescales for physical and chemical change, chemical processes leading to change, observational constraints, and various models that attempt to describe the chemical state and history of cosmological objects in general and the early solar system in particular.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Blake",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#cosmochemistry",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "ge-131": {
        "id": "ge-131",
        "course_id": "Ge 131",
        "name": "Planetary Structure and Evolution",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "A critical assessment of the physical and chemical processes that influence the initial condition, evolution, and current state of planets, including our planet and planetary satellites. Topics to be covered include a short survey of condensed-matter physics as it applies to planetary interiors, remote sensing of planetary interiors, planetary modeling, core formation, physics of ongoing differentiation, the role of mantle convection in thermal evolution, and generation of planetary magnetic fields.",
        "offered": true,
        "instructors": "Stevenson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#planetary-structure-and-evolution",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "geay-132": {
        "id": "geay-132",
        "course_id": "Ge/Ay 132",
        "name": "Atomic and Molecular Processes in Astronomy and Planetary Sciences",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Fundamental aspects of atomic and molecular spectra that enable one to infer physical conditions in astronomical, planetary, and terrestrial environments. Topics will include the structure and spectra of atoms, molecules, and solids; transition probabilities; photoionization and recombination; collisional processes; gas-phase chemical reactions; and isotopic fractionation. Each topic will be illustrated with applications in astronomy and planetary sciences, ranging from planetary atmospheres and dense interstellar clouds to the early universe.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Blake",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#atomic-and-molecular-processes-in-astronomy-and-planetary-sciences",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "geay-133": {
        "id": "geay-133",
        "course_id": "Ge/Ay 133",
        "name": "The Formation and Evolution of Planetary Systems",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Review current theoretical ideas and observations pertaining to the formation and evolution of planetary systems. Topics to be covered include low-mass star formation, the protoplanetary disk, accretion and condensation in the solar nebula, the formation of gas giants, meteorites, the outer solar system, giant impacts, extrasolar planetary systems.",
        "offered": true,
        "instructors": "Batygin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#the-formation-and-evolution-of-planetary-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-136-abc": {
        "id": "ge-136-abc",
        "course_id": "Ge 136 abc",
        "name": "Regional Field Geology of the Southwestern United States",
        "units": "3 units (1-0-2)",
        "terms": "first, second, or third terms, by announcement",
        "description": "Includes approximately three days of weekend field trips into areas displaying highly varied geology. Each student is assigned the major responsibility of being the resident expert on a pertinent subject for each trip. Graded pass/fail.",
        "offered": true,
        "instructors": "Kirschvink",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#regional-field-geology-of-the-southwestern-united-states",
        "prereq_text": "Prerequisites: Ge 11 ab or Ge 101, or instructor's permission.",
        "prereqs": []
    },
    "geay-137": {
        "id": "geay-137",
        "course_id": "Ge/Ay 137",
        "name": "Planetary Physics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A quantitative review of dynamical processes that characterize long-term evolution of planetary systems. An understanding of orbit-orbit resonances, spin-orbit resonances, secular exchange of angular momentum and the onset of chaos will be developed within the framework of Hamiltonian perturbation theory. Additionally, dissipative effects associated with tidal and planet-disk interactions will be considered.",
        "offered": true,
        "instructors": "Batygin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#planetary-physics",
        "prereq_text": "Prerequisites: Ph 106 abc, ACM 95/100 ab.",
        "prereqs": [
            "acm-95100-ab",
            "ph-106-abc"
        ]
    },
    "geese-139": {
        "id": "geese-139",
        "course_id": "Ge/ESE 139",
        "name": "Introduction to Atmospheric Radiation",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The basic physics of absorption and scattering of light by molecules, aerosols, and clouds. Theory of radiative transfer. Band models, correlated-k distributions and other approximate methods. Solar insolation, thermal emission, heating rates and radiances. Applications to Earth, Planets and Exoplanets.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Yung",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#introduction-to-atmospheric-radiation",
        "prereq_text": "Prerequisites: Ma 2, Ph 2, or instructor's permission.",
        "prereqs": [
            "ph-2-abc",
            "ma-2102"
        ]
    },
    "ge-140-a": {
        "id": "ge-140-a",
        "course_id": "Ge 140 a",
        "name": "Stable Isotope Geochemistry",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An introduction to the principles and applications of stable isotope systems to earth science, emphasizing the physical, chemical and biological processes responsible for isotopic fractionation, and their underlying chemical-physics principles. Topics include the kinetic theory of gases and related isotopic fractionations, relevant subjects in quantum mechanics and statistical thermodynamics, equations of motion of charged particles in electrical and magnetic fields (the basis of mass spectrometry), the photochemistry of isotopic species, and applications to the earth, environmental and planetary sciences.\n Taught in odd years; alternates with Ge 140 b.",
        "offered": true,
        "instructors": "Eiler",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#stable-isotope-geochemistry",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-140-b": {
        "id": "ge-140-b",
        "course_id": "Ge 140 b",
        "name": "Radiogenic Isotope Geochemistry",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An introduction to the principles and applications of radiogenic isotope systems in earth science, with emphasis on the applications of these systems, from dating to forensic. Topics to be covered include nucleosynthesis, radioactive decay phenomena, geochronology, geochronometry, isotopes as tracers of solar system and planetary evolution, extinct radioactivities, cosmogenic isotopes and forensic geochemistry.\n Taught in even years; alternates with Ge 140 a. Not offered 2024-25.",
        "offered": false,
        "instructors": "Tissot",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#radiogenic-isotope-geochemistry",
        "prereq_text": "",
        "prereqs": []
    },
    "geese-140-c": {
        "id": "geese-140-c",
        "course_id": "Ge/ESE 140 c",
        "name": "Stable Isotope Biogeochemistry",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "An introduction to the use of stable isotopes in biogeochemistry, intended to give interested students the necessary background to understand applications in a variety of fields, from modern carbon cycling to microbial ecology to records of Ancient Earth. Topics include the principles of isotope distribution in reaction networks; isotope effects in enzyme-mediated reactions, and in metabolism and biosynthesis; characteristic fractionations accompanying carbon, nitrogen, and sulfur cycling; and applications of stable isotopes in the biogeosciences.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Sessions",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#stable-isotope-biogeochemistry",
        "prereq_text": "Prerequisites: Ge 140 a or equivalent.",
        "prereqs": []
    },
    "ge-141": {
        "id": "ge-141",
        "course_id": "Ge 141",
        "name": "Isotope Cosmochemistry",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "An introduction to the study of the origin, abundances and distribution of the elements and their isotopes in the Universe, with emphasis on the isotopic constraints into the conditions, events and processes that shaped our Solar System. Topics to be covered include: cosmology and the age of the Universe, the age of the Milky Way and the duration of nucleosynthesis, the fundamentals of isotopic fractionations, the key roles of isotopic anomalies in understanding Solar System dynamics, early Solar System chronology from short- and long-lived nuclei, chondritic meteorite components as clues to solar nebula and asteroid evolution, as well as planetary formation and chronology (e.g., Moon, Mars, Earth).",
        "offered": true,
        "instructors": "Tissot",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#isotope-cosmochemistry",
        "prereq_text": "Prerequisites: Instructor's permission.",
        "prereqs": []
    },
    "esegech-142": {
        "id": "esegech-142",
        "course_id": "ESE/Ge/Ch 142",
        "name": "Aquatic Chemistry of Natural Waters",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Zakem",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#aquatic-chemistry-of-natural-waters",
        "prereq_text": "Prerequisites: Ch 1 or instructor's permission.",
        "prereqs": []
    },
    "geese-143": {
        "id": "geese-143",
        "course_id": "Ge/ESE 143",
        "name": "Organic Geochemistry",
        "units": "9 units (3-2-4)",
        "terms": "third term",
        "description": "Main topics include the analysis, properties, sources, and cycling of natural organic materials in the environment, from their production in living organisms to burial and decomposition in sediments and preservation in the rock record. Specific topics include analytical methods for organic geochemistry, lipid structure and biochemistry, composition of organic matter, factors controlling organic preservation, organic climate and CO2 proxies, diagenesis and catagenesis, and biomarkers for ancient life. A laboratory component (three evening labs) teaches the extraction and analysis of modern and ancient organic biomarkers by GC/MS. Class includes a mandatory one-day (weekend) field trip to observe the Monterey Formation.",
        "offered": true,
        "instructors": "Sessions",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#organic-geochemistry",
        "prereq_text": "Prerequisites: Ch 41 a or equivalent.",
        "prereqs": []
    },
    "ge-145": {
        "id": "ge-145",
        "course_id": "Ge 145",
        "name": "Isotope-Ratio Mass Spectrometry",
        "units": "9 units (1-4-4)",
        "terms": "first term",
        "description": "This class provides a hands-on introduction to the construction and operating principles of instrumentation used for isotope-ratio mass spectrometry. The class is structured as a 1-hour lecture plus 4-hour lab each week examining the major subsystems of an IRMS, including vacuum systems, ionization source, mass analyzer, and detector. Laboratories involve hands-on deconstruction and re-assembly of a retired IRMS instrument to examine its components. Course is limited to 6 students at the discretion of the instructor, with preference given to graduate students using this instrumentation in their research.\n Taught in odd years; not offered 2024-25.",
        "offered": true,
        "instructors": "Sessions",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#isotope-ratio-mass-spectrometry",
        "prereq_text": "",
        "prereqs": []
    },
    "mecegeese-146": {
        "id": "mecegeese-146",
        "course_id": "ME/CE/Ge/ESE 146",
        "name": "Computational Methods for Flow in Porous Media",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Fu",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#computational-methods-for-flow-in-porous-media",
        "prereq_text": "Prerequisites: ME 11 abc, ME 12 abc, ACM 95/100, ACM 106 ab (may be taken concurrently).",
        "prereqs": [
            "me-12-abc",
            "acm-95100-ab",
            "me-11-abc"
        ]
    },
    "gebibecnsese-147": {
        "id": "gebibecnsese-147",
        "course_id": "Ge/Bi/BE/CNS/ESE 147",
        "name": "Challenges and Opportunities in Quantitative Ecology",
        "units": "6 units (6-0-0)",
        "terms": "third term",
        "description": "Ecosystems are defined by dynamical interactions between groups of organisms, the communities they constitute, and the physical and chemical conditions and processes occurring in the environment. These dynamics are complex and multiscale across both length and time. This course will explore quantitative approaches that observe, measure, model, and monitor ecosystems and the services that they provide society-and the emerging opportunities that could employ these approaches to improve and strengthen global sustainability when it comes to our own ecology. This course will feature lectures each week from different members of the Caltech faculty working on ecological problems from different angles in order to illustrate how fresh insights can emerge by drawing on diverse ways-of-knowing.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Fischer, Tejada",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#challenges-and-opportunities-in-quantitative-ecology",
        "prereq_text": "",
        "prereqs": []
    },
    "geese-149": {
        "id": "geese-149",
        "course_id": "Ge/ESE 149",
        "name": "Marine Geochemistry",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Introduction to chemical oceanography and sediment geochemistry. We will address the question \"Why is the ocean salty?\" by examining the processes that determine the major, minor, and trace element distributions of seawater and ocean sediments. Topics include river and estuarine chemistry, air/sea exchange, nutrient uptake by the biota, radioactive tracers, redox processes in the water column and sediments, carbonate chemistry, and ventilation.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Adkins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#marine-geochemistry",
        "prereq_text": "Prerequisites: ESE 102.",
        "prereqs": []
    },
    "geese-150": {
        "id": "geese-150",
        "course_id": "Ge/ESE 150",
        "name": "Planetary Atmospheres",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "A broad survey of the formation, evolution, and present-day properties of planetary atmospheres, drawing examples from both the solar system and extrasolar planet literature. We will cover topics including energy balance, radiative transfer, chemistry, cloud formation, dynamics, and escape. The goal of this class is to provide an overview of key concepts relevant to planetary atmospheres that can serve as a foundation for future coursework or research in this area.",
        "offered": true,
        "instructors": "Knutson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#planetary-atmospheres",
        "prereq_text": "Prerequisites: Ch 1, Ma 2, Ph 2, or equivalents.",
        "prereqs": [
            "ph-2-abc",
            "ma-2102"
        ]
    },
    "ge-151": {
        "id": "ge-151",
        "course_id": "Ge 151",
        "name": "Planetary Surfaces",
        "units": "9 units (3-3-3)",
        "terms": "second term",
        "description": "We will review the mechanisms responsible for the formation and modification of the surfaces of solar system bodies, studying both composition and physical processes. Topics include exogenous processes (impact cratering, space weathering) and endogenous processes (tectonic, volcanic, weathering, fluvial, aeolian, and periglacial) that shape the surfaces of planets. Lectures, occasional labs, and one required field trip.",
        "offered": true,
        "instructors": "de Kleer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#planetary-surfaces",
        "prereq_text": "",
        "prereqs": []
    },
    "geese-154": {
        "id": "geese-154",
        "course_id": "Ge/ESE 154",
        "name": "Readings in Paleoclimate",
        "units": "3 units (1-0-2)",
        "terms": "second term",
        "description": "Lectures and readings in areas of current interest in paleoceanography and paleoclimate.",
        "offered": true,
        "instructors": "Adkins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#readings-in-paleoclimate",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "geese-155": {
        "id": "geese-155",
        "course_id": "Ge/ESE 155",
        "name": "Paleoceanography",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Evaluation of the data and models that make up our current understanding of past climates. Emphasis will be placed on a historical introduction to the study of the past ten thousand to a few hundred thousand years, with some consideration of longer timescales. Evidence from marine and terrestrial sediments, ice cores, corals, and speleothems will be used to address the mechanisms behind natural climate variability. Models of this variability will be evaluated in light of the data. Topics will include sea level and ice volume, surface temperature evolution, atmospheric composition, deep ocean circulation, tropical climate, ENSO variability, and terrestrial/ocean linkages.",
        "offered": true,
        "instructors": "Adkins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#paleoceanography",
        "prereq_text": "Prerequisites: ESE 102.",
        "prereqs": []
    },
    "ge-156": {
        "id": "ge-156",
        "course_id": "Ge 156",
        "name": "Topics in Planetary Surfaces",
        "units": "6 units (3-0-3)",
        "terms": "",
        "description": "Offered by announcement only. Reading about and discussion of current understanding of the surface of a selected terrestrial planet, major satellite, or asteroid. Important \"classic\" papers will be reviewed, relative to the data that are being returned from recent and current missions. May be repeated for credit.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#topics-in-planetary-surfaces",
        "prereq_text": "",
        "prereqs": []
    },
    "geeeese-157-c": {
        "id": "geeeese-157-c",
        "course_id": "Ge/EE/ESE 157 c",
        "name": "Remote Sensing for Environmental and Geological Applications",
        "units": "9 units (3-3-3)",
        "terms": "third term",
        "description": "Analysis of electromagnetic radiation at visible, infrared, and radio wavelengths for interpretation of the physical and chemical characteristics of the surfaces of Earth and other planets. Topics: interaction of light with materials, spectroscopy of minerals and vegetation, atmospheric removal, image analysis, classification, and multi-temporal studies. This course does not require but is complementary to EE 157 ab with emphasis on applications for geological and environmental problems, using data acquired from airborne and orbiting remote sensing platforms. Students will work with digital remote sensing datasets in the laboratory and there will be one field trip.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Ehlmann",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#remote-sensing-for-environmental-and-geological-applications",
        "prereq_text": "",
        "prereqs": []
    },
    "geay-159": {
        "id": "geay-159",
        "course_id": "Ge/Ay 159",
        "name": "Astrobiology",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "We approach the age-old questions \"Why are we here?\" and \"Are we alone?\" by covering topics in cosmology, the origins of life, planetary habitability, the detection of biosignatures, the search for extraterrestrial intelligence, and humanity's future in space. Specific topics include: the emergence of life at hydrothermal vents; the habitable zone and the Gaia hypothesis; the search for ancient habitable environments on Mars; icy satellites like Europa, Enceladus, and Titan as astrobiological prospects; and the hunt for atmospheric biosignatures on exoplanets.",
        "offered": true,
        "instructors": "Yung",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#astrobiology",
        "prereq_text": "",
        "prereqs": []
    },
    "aegeme-160-ab": {
        "id": "aegeme-160-ab",
        "course_id": "Ae/Ge/ME 160 ab",
        "name": "Continuum Mechanics of Fluids and Solids",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms.",
        "description": "Elements of Cartesian tensors. Configurations and motions of a body. Kinematics-study of deformations, rotations and stretches, polar decomposition. Lagrangian and Eulerian strain velocity and spin tensor fields. Irrotational motions, rigid motions. Kinetics-balance laws. Linear and angular momentum, force, traction stress. Cauchy's theorem, properties of Cauchy's stress. Equations of motion, equilibrium equations. Power theorem, nominal (Piola-Kirchoff) stress. Thermodynamics of bodies. Internal energy, heat flux, heat supply. Laws of thermodynamics, notions of entropy, absolute temperature. Entropy inequality (Clausius-Duhem). Examples of special classes of constitutive laws for materials without memory. Objective rates, corotational, convected rates. Principles of materials frame indifference. Examples: the isotropic Navier-Stokes fluid, the isotropic thermoelastic solid. Basics of finite differences, finite elements, and boundary integral methods, and their applications to continuum mechanics problems illustrating a variety of classes of constitutive laws.\n part b not offered 2024-25",
        "offered": true,
        "instructors": "Lapusta",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#continuum-mechanics-of-fluids-and-solids",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-161": {
        "id": "ge-161",
        "course_id": "Ge 161",
        "name": "Plate Tectonics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Geophysical and geological observations related to plate tectonic theory. Instantaneous and finite motion of rigid plates on a sphere; marine magnetic and paleomagnetic measurements; seismicity and tectonics of plate boundaries; reference frames and absolute plate motions. Interpretations of geologic data in the context of plate tectonics; plate tectonic evolution of the ocean basins.",
        "offered": true,
        "instructors": "Stock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#plate-tectonics",
        "prereq_text": "Prerequisites: Ge 11 ab or equivalent.",
        "prereqs": []
    },
    "ge-162": {
        "id": "ge-162",
        "course_id": "Ge 162",
        "name": "Seismology",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Review of concepts in classical seismology. Topics to be covered: basic theories of wave propagation in the earth, instrumentation, Earth's structure and tomography, theory of the seismic source, physics of earthquakes, and seismic risk. Emphasis will be placed on how quantitative mathematical and physical methods are used to understand complex natural processes, such as earthquakes.",
        "offered": true,
        "instructors": "Zhan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#seismology",
        "prereq_text": "Prerequisites: ACM 95/100 ab or equivalent.",
        "prereqs": [
            "acm-95100-ab"
        ]
    },
    "ge-163": {
        "id": "ge-163",
        "course_id": "Ge 163",
        "name": "Geodynamics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Quantitative introduction to the dynamics of the earth, including core, mantle, lithosphere, and crust. Mechanical models are developed for each of these regions and compared to a variety of data sets. Potential theory applied to the gravitational and geomagnetic fields. Special attention is given to the dynamics of plate tectonics and the earthquake cycle.",
        "offered": true,
        "instructors": "Gurnis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#geodynamics",
        "prereq_text": "Prerequisites: Ae/Ge/ME 160 ab.",
        "prereqs": [
            "aegeme-160-ab"
        ]
    },
    "ge-164": {
        "id": "ge-164",
        "course_id": "Ge 164",
        "name": "Mineral Physics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Introduction to the mineral physics of Earth's interior. Topics covered: mineralogy and phase transitions at high pressures and temperatures; elasticity and equations of state; vibrational, electronic, and transport properties; application of mineral physics data to Earth and planetary interiors.\n Taught every other year; not offered 2024-25.",
        "offered": true,
        "instructors": "Jackson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#mineral-physics",
        "prereq_text": "Prerequisites: Ge 11 ad or equivalent, or instructor's permission.",
        "prereqs": []
    },
    "ge-165": {
        "id": "ge-165",
        "course_id": "Ge 165",
        "name": "Geophysical Inverse Problems",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Ross",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#geophysical-inverse-problems",
        "prereq_text": "Prerequisites: basic linear algebra and Fourier transforms.",
        "prereqs": []
    },
    "ge-166": {
        "id": "ge-166",
        "course_id": "Ge 166",
        "name": "Machine Learning in Geophysics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Introduction to deep learning, with applications to modern geophysical research. Supervised and unsupervised learning with spatiotemporal data; architecture design; deep generative models; solving partial differential equations and operator learning; physics-informed deep learning. The course will address data requirements, current limitations, and the role of machine learning in the future of geophysics.",
        "offered": true,
        "instructors": "Ross",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#machine-learning-in-geophysics",
        "prereq_text": "Prerequisites: Ge 117 or Ge 165; or equivalent, with instructor's permission.",
        "prereqs": []
    },
    "ge-167": {
        "id": "ge-167",
        "course_id": "Ge 167",
        "name": "Tectonic Geodesy",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "An introduction to the use of modern geodetic observations (e.g., GPS and InSAR) to constrain crustal deformation models. Secular velocity fields, coseismic and time-dependent processes; volcano deformation and seasonal loading phenomena. Basic inverse approaches for parameter estimation and basic temporal filtering algorithms.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Simons",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#tectonic-geodesy",
        "prereq_text": "Prerequisites: a working knowledge of unix/linux or equivalent, linear algebra, and coursework in geophysics.",
        "prereqs": []
    },
    "ge-169-abcd": {
        "id": "ge-169-abcd",
        "course_id": "Ge 169 abcd",
        "name": "Readings in Geophysics",
        "units": "6 units (3-0-3)",
        "terms": "first, second, third, summer terms",
        "description": "Reading courses are offered to teach students to read critically the work of others and to broaden their knowledge about specific topics. Each student will be required to write a short summary of each paper that summarizes the main goals of the paper, to give an assessment of how well the author achieved those goals, and to point out related issues not discussed in the paper. Each student will be expected to lead the discussion on one or more papers. The leader will summarize the discussion on the paper(s) in writing. A list of topics offered each year will be posted on the Web. Individual terms may be taken for credit multiple times without regard to sequence.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#readings-in-geophysics",
        "prereq_text": "",
        "prereqs": []
    },
    "esegech-171": {
        "id": "esegech-171",
        "course_id": "ESE/Ge/Ch 171",
        "name": "Atmospheric Chemistry I",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A detailed course about chemical transformation in Earth's atmosphere. Kinetics, spectroscopy, and thermodynamics of gas-phase chemistry of the stratosphere and troposphere; sources, sinks, and lifetimes of trace atmospheric species; stratospheric ozone chemistry; oxidation mechanisms in the troposphere; aerosol chemistry.",
        "offered": true,
        "instructors": "Wennberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#atmospheric-chemistry-i",
        "prereq_text": "Prerequisites: Ch 1 or equivalent.",
        "prereqs": []
    },
    "esegech-172": {
        "id": "esegech-172",
        "course_id": "ESE/Ge/Ch 172",
        "name": "Atmospheric Chemistry II",
        "units": "3 units (3-0-0)",
        "terms": "first term",
        "description": "A lecture and discussion course about active research in atmospheric chemistry. Potential topics include halogen chemistry of the stratosphere and troposphere; aerosol formation in remote environments; coupling of dynamics and photochemistry; development and use of modern remote-sensing and in situ instrumentation. Graded pass/fail.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Seinfeld, Wennberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#atmospheric-chemistry-ii",
        "prereq_text": "Prerequisites: ESE/Ge/Ch 171 or equivalent.",
        "prereqs": []
    },
    "mecege-174": {
        "id": "mecege-174",
        "course_id": "ME/CE/Ge 174",
        "name": "Mechanics of Rocks",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Basic principles of deformation, strength, and stressing of rocks. Elastic behavior, plasticity, viscoelasticity, viscoplasticity, creep, damage, friction, failure mechanisms, shear localization, and interaction of deformation processes with fluids. Engineering and geological applications.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#mechanics-of-rocks",
        "prereq_text": "Prerequisites: Ae/Ge/ME 160 a.",
        "prereqs": [
            "aegeme-160-ab"
        ]
    },
    "ge-177": {
        "id": "ge-177",
        "course_id": "Ge 177",
        "name": "Active Tectonics",
        "units": "12 units (3-3-6)",
        "terms": "third term",
        "description": "Introduction to techniques for identifying and quantifying active tectonic processes. Geomorphology, stratigraphy, structural geology, and geodesy applied to the study of active faults and folds in a variety of tectonic settings. Relation of seismicity and geodetic measurements to geologic structure and active tectonics processes. Review of case studies of selected earthquakes.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Avouac",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#active-tectonics",
        "prereq_text": "Prerequisites: Ge 112 and Ge 106 or equivalent.",
        "prereqs": []
    },
    "geesebi-178": {
        "id": "geesebi-178",
        "course_id": "Ge/ESE/Bi 178",
        "name": "Microbial Ecology",
        "units": "9 units (3-2-4)",
        "terms": "second term",
        "description": "Structural, phylogenetic, and metabolic diversity of microorganisms in nature. The course explores microbial interactions, relationships between diversity and physiology in modern and ancient environments, and influence of microbial community structure on biogeochemical cycles. Introduction to ecological principles and molecular approaches used in microbial ecology and geobiological investigations.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Orphan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#microbial-ecology",
        "prereq_text": "Prerequisites: either ESE/Bi 166 or ESE/Bi 168 recommended.",
        "prereqs": []
    },
    "esegebiche-184": {
        "id": "esegebiche-184",
        "course_id": "ESE/Ge/Bi/ChE 184",
        "name": "Computational Tools for Decoding Microbial Ecosystems",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Karthikeyan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#computational-tools-for-decoding-microbial-ecosystems",
        "prereq_text": "Prerequisites: Prior knowledge in Microbiology/Microbial Ecology is required (or instructor's approval). Proficiency in python, bash, slurm, while encouraged, is not required.",
        "prereqs": []
    },
    "ge-190": {
        "id": "ge-190",
        "course_id": "Ge 190",
        "name": "The Nature and Evolution of the Earth",
        "units": "",
        "terms": "offered by announcement only",
        "description": "Advanced-level discussions of problems of current interest in the earth sciences. Students may enroll for any or all terms of this course without regard to sequence.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#the-nature-and-evolution-of-the-earth",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-191": {
        "id": "ge-191",
        "course_id": "Ge 191",
        "name": "Special Topics in Geochemistry",
        "units": "",
        "terms": "offered by announcement only",
        "description": "Advanced-level discussions of problems of current interest in geochemistry. Students may enroll for any or all terms of this course without regard to sequence.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#special-topics-in-geochemistry",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-192": {
        "id": "ge-192",
        "course_id": "Ge 192",
        "name": "Special Topics in the Geological Sciences",
        "units": "",
        "terms": "first term",
        "description": "Advanced-level discussions of problems of current interest in the geological sciences. Students may enroll for any or all terms of this course without regard to sequence.",
        "offered": true,
        "instructors": "Venditti",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#special-topics-in-the-geological-sciences",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-193": {
        "id": "ge-193",
        "course_id": "Ge 193",
        "name": "Special Topics in Geophysics",
        "units": "",
        "terms": "second term",
        "description": "Advanced-level discussions of problems of current interest in geophysics. Students may enroll for any or all terms of this course without regard to sequence.",
        "offered": true,
        "instructors": "Barbot",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#special-topics-in-geophysics",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-194": {
        "id": "ge-194",
        "course_id": "Ge 194",
        "name": "Special Topics in Planetary Sciences",
        "units": "",
        "terms": "offered by announcement only",
        "description": "Advanced-level discussions of problems of current interest in planetary sciences. Students may enroll for any or all terms of this course without regard to sequence.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#special-topics-in-planetary-sciences",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-195": {
        "id": "ge-195",
        "course_id": "Ge 195",
        "name": "Special Topics in Field Geology",
        "units": "",
        "terms": "offered by announcement only",
        "description": "Field experiences in different geological settings. Supporting lectures will usually occur before and during the field experience. This course will be scheduled only when special opportunities arise. Class may be taken more than once.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#special-topics-in-field-geology",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-196": {
        "id": "ge-196",
        "course_id": "Ge 196",
        "name": "Special Topics in Atmospheres and Oceans",
        "units": "",
        "terms": "offered by announcement only",
        "description": "Advanced-level discussions of problems of current interest in atmospheric and ocean sciences.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#special-topics-in-atmospheres-and-oceans",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-197": {
        "id": "ge-197",
        "course_id": "Ge 197",
        "name": "Special Topics in Geobiology: Oxygen",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "Abundant molecular oxygen is a defining feature of the biology and geochemistry at the surface of our planet, but the geological record shows us that this was not always the case.  This course will combine lectures with advanced-level discussions of selected literature and project-based work focused on the modern oxygen cycle, current knowledge of the history of atmospheric oxygen, and new ideas and constraints on the evolution of aerobic metabolisms.",
        "offered": true,
        "instructors": "Fischer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#special-topics-in-geobiology:-oxygen",
        "prereq_text": "",
        "prereqs": []
    },
    "ayge-198": {
        "id": "ayge-198",
        "course_id": "Ay/Ge 198",
        "name": "Special Topics in the Planetary Sciences",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "Topic for 2024-25 is Extrasolar Planets. Thousands of planets have been identified in orbit around other stars. Astronomers are now embarking on understanding the statistics of extrasolar planet populations and characterizing individual systems in detail, namely star-planet, planet-planet and planet-disk dynamical interactions, physical parameters of planets and their composition, weather phenomena, etc. Direct and indirect detection techniques are now completing the big picture of extra-solar planetary systems in all of their natural diversity. The seminar-style course will review the state of the art in exoplanet science, take up case studies, detail current and future instrument needs, and anticipate findings.",
        "offered": true,
        "instructors": "Howard",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#special-topics-in-the-planetary-sciences",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-211": {
        "id": "ge-211",
        "course_id": "Ge 211",
        "name": "Applied Geophysics II",
        "units": "",
        "terms": "first term",
        "description": "Intensive geophysical field experience in either marine or continental settings. Marine option will include participation in a student training cruise, with several weeks aboard a geophysical research vessel, conducting geophysical measurements (multibeam bathymetry, gravity, magnetics, and/or seismics), and processing and interpreting the data. Supporting lectures and problem sets on the theoretical basis of the relevant geophysical techniques and the tectonic background of the survey area will occur before and during the training cruise. The course might be offered in a similar format in other isolated situations. The course will be scheduled only when opportunities arise and this usually means that only six months' notice can be given. Auditing not permitted. Class may be taken more than once.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#applied-geophysics-ii",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "ge-212": {
        "id": "ge-212",
        "course_id": "Ge 212",
        "name": "Thermodynamics of Geological Systems",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Chemical thermodynamics as applied to geological and geochemical problems. Classical thermodynamics, including stability criteria, homogeneous and heterogeneous equilibria, equilibria subject to generalized constraints, equations of state, ideal and non-ideal solutions, redox systems, and electrolyte conventions. Brief discussion of statistical foundations and an introduction to the thermodynamics of irreversible processes.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Asimow",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#thermodynamics-of-geological-systems",
        "prereq_text": "Prerequisites: Either Ch 21 abc, Ge 115 a, or equivalents.",
        "prereqs": []
    },
    "ge-214": {
        "id": "ge-214",
        "course_id": "Ge 214",
        "name": "Spectroscopy of Minerals",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "An overview of the interaction of minerals with electromagnetic radiation from gamma rays to microwaves. Particular emphasis is placed on visible, infrared, Raman, and Mössbauer spectroscopies as applied to mineralogical problems such as phase identification, chemical analysis, site populations, and origin of color and pleochroism.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Rossman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#spectroscopy-of-minerals",
        "prereq_text": "Prerequisites: Ge 114 a, Ch 21 ab, or instructor's permission.",
        "prereqs": []
    },
    "ge-215": {
        "id": "ge-215",
        "course_id": "Ge 215",
        "name": "Topics in Advanced Petrology",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Lectures, readings, seminars, and/or laboratory studies in igneous or metamorphic petrology, paragenesis, and petrogenesis. The course may cover experimental, computational, or analytical methods. Format and content are flexible according to the needs of the students.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Asimow",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#topics-in-advanced-petrology",
        "prereq_text": "Prerequisites: Ge 115 ab or instructor's permission.",
        "prereqs": []
    },
    "ge-217": {
        "id": "ge-217",
        "course_id": "Ge 217",
        "name": "Radiogenic Isotopes Seminar",
        "units": "6 units (3-0-3)",
        "terms": "third term",
        "description": "The course deals with advanced topics in radiogenic isotope geochemistry and builds on Ge 140 b, addressing unconventional applications of radioisotopes as well as treating several conventional radiogenic systems in more detail. Topics to be covered will be guided by class interests.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Farley",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#radiogenic-isotopes-seminar",
        "prereq_text": "Prerequisites: Ge 140 b or permission of instructor.",
        "prereqs": []
    },
    "ge-218": {
        "id": "ge-218",
        "course_id": "Ge 218",
        "name": "Stable Isotopes Seminar",
        "units": "6 units (3-0-3)",
        "terms": "second term",
        "description": "The course deals with advanced topics in stable isotope geochemistry and builds on Ge 140. The course will explore in depth the theory and applications of a subject in stable isotope geochemistry, selected by consensus of the enrolled students at or before the beginning of term. Example subjects could include: stable isotope thermometry; paleoclimate studies; paleoaltimetry; the early solar system; terrestrial weathering; photochemistry; or biosynthetic fractionations. The class will read and discuss classic papers in that subject area, supplemented with instructor lectures and broader background reading. All participants will lead discussions of papers and present one lecture on a relevant subject.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Eiler",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#stable-isotopes-seminar",
        "prereq_text": "Prerequisites: Ge 140 or permission of instructor.",
        "prereqs": []
    },
    "ge-219": {
        "id": "ge-219",
        "course_id": "Ge 219",
        "name": "Non-traditional Isotopes Seminar",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Tissot",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#non-traditional-isotopes-seminar",
        "prereq_text": "Prerequisites: Ge 140 a or b, or permission of instructor.",
        "prereqs": []
    },
    "aeammege-225": {
        "id": "aeammege-225",
        "course_id": "Ae/AM/ME/Ge 225",
        "name": "Special Topics in Solid Mechanics",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Subject matter changes depending on staff and student interest.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#special-topics-in-solid-mechanics",
        "prereq_text": "",
        "prereqs": []
    },
    "gebi-244": {
        "id": "gebi-244",
        "course_id": "Ge/Bi 244",
        "name": "Paleobiology Seminar",
        "units": "6 units (3-0-3)",
        "terms": "third term",
        "description": "Critical reviews and discussion of classic investigations and current research in paleoecology, evolution, and biogeochemistry.",
        "offered": true,
        "instructors": "Kirschvink",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#paleobiology-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "gebiese-246": {
        "id": "gebiese-246",
        "course_id": "Ge/Bi/ESE 246",
        "name": "Molecular Geobiology Seminar",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "Critical reviews and discussion of classic papers and current research in microbiology and geomicrobiology. As the topics will vary from year to year, it may be taken multiple times.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Orphan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#molecular-geobiology-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "geesebi-248": {
        "id": "geesebi-248",
        "course_id": "Ge/ESE/Bi 248",
        "name": "Environmental Justice",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "This seminar course will explore and discuss the unique intersection of environmental racism, environmental justice, and academia. Course material will primarily feature readings and videos on a case study-like basis and focus on bringing conversations typically had in humanities, social sciences and activism to the bio and geosciences. Topics will center around two primary approaches: an \"outward-facing\" component that looks at environmental racism through the lens of various activisms, and an \"inward-facing\" component addressing the biases/malpractices broadly employed in the biological and geosciences, as well as the apparent moral dilemmas of decisions involving multiple stakeholders. Out of class work will largely be based on assigned readings, some multimedia presentations, and occasional writings and thought exercises. This course is taught concurrently with Hum 61 and can only be taken once, as Ge/ESE/Bi 248 or Hum 61.",
        "offered": true,
        "instructors": "Orphan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#environmental-justice",
        "prereq_text": "",
        "prereqs": []
    },
    "gebiesece-249": {
        "id": "gebiesece-249",
        "course_id": "Ge/Bi/ESE/CE 249",
        "name": "Stable Isotopes: Ecological and Environmental Applications",
        "units": "9 units (3-3-3)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Tejada",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#stable-isotopes:-ecological-and-environmental-applications",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-261": {
        "id": "ge-261",
        "course_id": "Ge 261",
        "name": "Advanced Seismology",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Continuation of Ge 162 with special emphasis on particular complex problems; includes generalizations of analytical methods to handle nonplanar structures and methods of interfacing numerical-analytical codes in two and three dimensions; construction of Earth models using tomographic methods and synthetics. Requires a class project.",
        "offered": true,
        "instructors": "Zhan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#advanced-seismology",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-263": {
        "id": "ge-263",
        "course_id": "Ge 263",
        "name": "Computational Geophysics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Finite-difference, pseudo-spectral, finite-element, and spectral-element methods will be presented and applied to a number of geophysical problems including heat flow, deformation, and wave propagation. Students will program simple versions of methods.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Gurnis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#computational-geophysics",
        "prereq_text": "Prerequisites: introductory class in geophysics, class in partial differential equations, some programming experience.",
        "prereqs": []
    },
    "aeamcemege-265-ab": {
        "id": "aeamcemege-265-ab",
        "course_id": "Ae/AM/CE/ME/Ge 265 ab",
        "name": "Static and Dynamic Failure of Brittle Solids and Interfaces, from the Micro to the Mega",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Linear elastic fracture mechanics of homogeneous brittle solids (e.g. geo-materials, ceramics, metallic glasses); small scale yielding concepts; experimental methods in fracture, fracture of bi-material interfaces with applications to composites as well as bonded and layered engineering and geological structures; thin-film and micro-electronic components and systems; dynamic fracture mechanics of homogeneous engineering materials; dynamic shear dominated failure of coherent and incoherent interfaces at all length scales; dynamic rupture of frictional interfaces with application to earthquake source mechanics; allowable rupture speeds regimes and connections to earthquake seismology and the generation of Tsunamis.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#static-and-dynamic-failure-of-brittle-solids-and-interfaces,-from-the-micro-to-the-mega",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 abc (concurrently) or equivalent and/or instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "megeae-266-ab": {
        "id": "megeae-266-ab",
        "course_id": "ME/Ge/Ae 266 ab",
        "name": "Fracture and Frictional Faulting",
        "units": "9 units (3-0-6)",
        "terms": "second",
        "description": "Introduction to elastodynamics and waves in solids. Fracture theory, energy concepts, cohesive zone models. Friction laws, nucleation of frictional instabilities, rupture of frictional interfaces. Radiation from moving cracks. Thermal effects during dynamic fracture and faulting. Interaction of faulting with fluids. Applications to engineering phenomena a physics and mechanics of earthquakes.",
        "offered": true,
        "instructors": "Lapusta",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#fracture-and-frictional-faulting",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 a or Ae/Ge/ME 160 a or instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc",
            "aegeme-160-ab"
        ]
    },
    "ge-271": {
        "id": "ge-271",
        "course_id": "Ge 271",
        "name": "Dynamics of Seismicity",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A comprehensive introduction to seismicity of the Earth. Topics covered: Empirical laws for seismicity; spatial and temporal evolution of earthquake sequences; earthquake location algorithms; seismicity in crustal fault zones, subduction zones, creeping faults, volcanoes, and intraplate regions; earthquake triggering; induced seismicity; tectonic tremor and low-frequency earthquakes. Requires a class project.",
        "offered": true,
        "instructors": "Ross",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#dynamics-of-seismicity",
        "prereq_text": "",
        "prereqs": []
    },
    "ge-277": {
        "id": "ge-277",
        "course_id": "Ge 277",
        "name": "Active Tectonics Seminar",
        "units": "6 units (2-0-4)",
        "terms": "second term",
        "description": "Discussion of key issues in active tectonics based on a review of the literature. The topic of the seminar is adjusted every year based on students' interest and recent literature.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Avouac",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#active-tectonics-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "geese-298": {
        "id": "geese-298",
        "course_id": "Ge/ESE 298",
        "name": "Mentoring and Outreach",
        "units": "Units to be arranged, up to 12 units per year",
        "terms": "",
        "description": "In consultation with a faculty advisor and the Caltech Center for Teaching, Learning, and Outreach, students may obtain credit for engaging in volunteer efforts to promote public understanding of science; to mentor and tutor young people and underserved populations; or to otherwise contribute to the diversity, equity, and inclusiveness of the scientific enterprise. Students may petition their option representative (graduate students) or academic advisor (undergraduate students) if they seek credits beyond the 12-unit limit.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ge/#mentoring-and-outreach",
        "prereq_text": "",
        "prereqs": []
    }
}