{
    "humhhps-14": {
        "id": "humhhps-14",
        "course_id": "Hum/H/HPS 14",
        "name": "Race, Science, and Medicine in U.S. History",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will explore how natural philosophers and scientists have defined, used, and sometimes challenged ideas about race from the eighteenth century to today. Using a range of primary and secondary sources, we will examine how scientific ideas about race developed in concert with European imperial expansion and slavery; how these ideas were employed in legal cases, medical practice, and eugenics policies; and how activists and scholars have challenged racist practices and ideas. Finally, we will turn to the recent resurgence of racial thinking in biology and medicine in the light of the history of race and science.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#race,-science,-and-medicine-in-u.s.-history",
        "prereq_text": "",
        "prereqs": []
    },
    "humhhps-15": {
        "id": "humhhps-15",
        "course_id": "Hum/H/HPS 15",
        "name": "Waste in the World",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "The things that human beings make and throw away rarely stay where we put them. Just as humans have shaped the biological and physical world, the biological and physical world shapes human actions. In this course, we will examine how these interacting forces propel environmental and cultural change. We will explore these concepts through the lens of waste - how different groups at different points in history define waste, where discarded things go and what they become as they move through space and time. We will consider how conflicting perceptions of utility and waste in different cultural and historical contexts have factored into shifting ideas about race, class, gender, wilderness, technology, consumption, and sovereignty. In rethinking waste, we will explore the multiple meanings of \"nature,\" assess the roots of sustainability, and evaluate past events in light of current ideas about environmental justice. While this course prioritizes reading and discussion, we will also engage with the world around us through visual analysis. Pasadena and Los Angeles will be among our most important resources, allowing us to ground global ideas in a local context.",
        "offered": true,
        "instructors": "Rand",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#waste-in-the-world",
        "prereq_text": "",
        "prereqs": []
    },
    "humhhps-18": {
        "id": "humhhps-18",
        "course_id": "Hum/H/HPS 18",
        "name": "Introduction to the History of Science",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "Major topics include the following: What are the origins of modern Western science, when did it emerge as distinct from philosophy and other cultural and intellectual productions, and what are its distinguishing features? When and how did observation, experiment, quantification, and precision enter the practice of science? What were some of the major turning points in the history of science? What is the changing role of science and technology? Using primary and secondary sources, students will take up significant topics in the history of science, from ancient Greek science to the 20th-century revolution in physics, biology, and technology. Hum/H/HPS 10 may be taken for credit toward the additional 36-unit HSS requirement by HPS majors and minors who have already fulfilled their first-year humanities requirement and counts as a history course in satisfying the first-year humanities breadth requirement.",
        "offered": true,
        "instructors": "Feingold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#introduction-to-the-history-of-science",
        "prereq_text": "",
        "prereqs": []
    },
    "humhhps-20": {
        "id": "humhhps-20",
        "course_id": "Hum/H/HPS 20",
        "name": "COVID-19 and Other Pandemics: Science, Medicine, and Public Controversies",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Kormos-Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#covid-19-and-other-pandemics:-science,-medicine,-and-public-controversies",
        "prereq_text": "",
        "prereqs": []
    },
    "hps-90": {
        "id": "hps-90",
        "course_id": "HPS 90",
        "name": "Public Lecture Series",
        "units": "1 unit",
        "terms": "first, second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Visiting lecturers",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#public-lecture-series",
        "prereq_text": "",
        "prereqs": []
    },
    "hps-98": {
        "id": "hps-98",
        "course_id": "HPS 98",
        "name": "Reading in History and Philosophy of Science",
        "units": "9 units (1-0-8)",
        "terms": "",
        "description": "An individual program of directed reading in history and philosophy of science, in areas not covered by regular courses.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#reading-in-history-and-philosophy-of-science",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "hps-102-ab": {
        "id": "hps-102-ab",
        "course_id": "HPS 102 ab",
        "name": "Senior Research Seminar",
        "units": "12 units (2-0-10)",
        "terms": "",
        "description": "Offered in any two consecutive terms, by arrangement with HPS faculty. Under the guidance of an HPS faculty member, students will research and write a focused research paper of 15,000 words (approximately 50 pages). Work in the first term will comprise intensive reading in the relevant literature and/or archival or other primary source research. In the second term, students will draft and revise their paper. Open to seniors in the HPS option and to others by special permission of an HPS faculty member.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#senior-research-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsplcs-110": {
        "id": "hpsplcs-110",
        "course_id": "HPS/Pl/CS 110",
        "name": "Causation and Explanation",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An examination of theories of causation and explanation in philosophy and neighboring disciplines. Topics discussed may include probabilistic and counterfactual treatments of causation, the role of statistical evidence and experimentation in causal inference, and the deductive-nomological model of explanation. The treatment of these topics by important figures from the history of philosophy such as Aristotle, Descartes, and Hume may also be considered.",
        "offered": true,
        "instructors": "Eberhardt",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#causation-and-explanation",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-120": {
        "id": "hpspl-120",
        "course_id": "HPS/Pl 120",
        "name": "Introduction to Philosophy of Science",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An introduction to fundamental philosophical problems concerning the nature of science. Topics may include the character of scientific explanation, criteria for the conformation and falsification of scientific theories, the relationship between theory and observation, philosophical accounts of the concept of \"law of nature,\" causation, chance, realism about unobservable entities, the objectivity of science, and issues having to do with the ways in which scientific knowledge changes over time.",
        "offered": true,
        "instructors": "McKenna",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#introduction-to-philosophy-of-science",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-122": {
        "id": "hpspl-122",
        "course_id": "HPS/Pl 122",
        "name": "Probability, Evidence, and Belief",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Philosophical and conceptual issues arising from the study of probability theory and how it relates to rationality and belief. Topics discussed may include the foundations and interpretations of probability, arguments for and against the view that we ought to have personal degrees of belief, rational change in beliefs over time, and the relationship between probability and traditional epistemological topics like evidence, justification, and knowledge.",
        "offered": true,
        "instructors": "Hitchcock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#probability,-evidence,-and-belief",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-123": {
        "id": "hpspl-123",
        "course_id": "HPS/Pl 123",
        "name": "Introduction to the Philosophy of Physics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course will examine the philosophical foundations of the physical theories covered in the first-year physics sequence: classical mechanics, electromagnetism, and special relativity. Topics may include: the goals of physics; what laws of nature are; the unification of physical theories; symmetries; determinism; locality; the reality of fields; the arrow of time.",
        "offered": true,
        "instructors": "Sebens",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#introduction-to-the-philosophy-of-physics",
        "prereq_text": "Prerequisites: Ph 1 abc or instructor's permission.",
        "prereqs": [
            "ph-1-abc"
        ]
    },
    "hpspl-124": {
        "id": "hpspl-124",
        "course_id": "HPS/Pl 124",
        "name": "Philosophy of Space and Time",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will focus on questions about the nature of space and time, particularly as they arise in connection with physical theory. Topics may include the nature and existence of space, time, and motion; the relationship between geometry and physical space (or space-time); entropy and the direction of time; the nature of simultaneity; and the possibility of time travel.",
        "offered": true,
        "instructors": "Hitchcock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#philosophy-of-space-and-time",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-125": {
        "id": "hpspl-125",
        "course_id": "HPS/Pl 125",
        "name": "Philosophical Issues in Quantum Physics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course will focus on philosophical and foundational questions raised by quantum physics. Questions may include: Is quantum mechanics a local theory? Is the theory deterministic or indeterministic? What is the role of measurement and observation? Does the wave function always obey the Schrödinger equation? Does the wave function give a complete description of the state of a system? Are there parallel universes? How are we to understand quantum probabilities?",
        "offered": true,
        "instructors": "Sebens",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#philosophical-issues-in-quantum-physics",
        "prereq_text": "Prerequisites: Ph 2 b, Ph 12 b, or Ch 21 a.",
        "prereqs": [
            "ph-2-abc",
            "ph-12-abc"
        ]
    },
    "hpspl-128": {
        "id": "hpspl-128",
        "course_id": "HPS/Pl 128",
        "name": "Philosophy of Mathematics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An examination of conceptual issues that arise in mathematics. The sorts of issues addressed may include the following: Are mathematical objects such as numbers in some sense real? How do we obtain knowledge of the mathematical world? Are proofs the only legitimate source of mathematical knowledge? What is the relationship between mathematics and the world? How is it possible to apply abstract theory to the world? Views of major historical figures such as Plato, Hume, Kant, and Mill, as well as of contemporary writers are examined. The course will also examine philosophical issues that arise in particular areas of mathematics such as probability theory and geometry.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Hitchcock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#philosophy-of-mathematics",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-129": {
        "id": "hhps-129",
        "course_id": "H/HPS 129",
        "name": "History of Satellites: From Sputnik to Starlink",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The artificial satellites encircling the planet make up a global information infrastructure. Most of us living in industrialized regions use satellites daily without even realizing it. How did satellites become so integral to terrestrial technological systems? How did Earth orbit transform from a wilderness into a landscape during the second half of the 20th century, and how is that landscape changing in the 21st? We will trace the history of satellites beginning with the first artificial \"moons\" and moving into the current moment of private industry ascendance, taking into account the development, use, and decay of these technologies. We will consider how designers and users shape satellites, and map out the ways that objects in orbit reflect and reinforce power and geopolitics on the ground below.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Rand",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#history-of-satellites:-from-sputnik-to-starlink",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-130": {
        "id": "hhps-130",
        "course_id": "H/HPS 130",
        "name": "Critical Infrastructures",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Rand",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#critical-infrastructures",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-131": {
        "id": "hhps-131",
        "course_id": "H/HPS 131",
        "name": "History of Extinction",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Lewis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#history-of-extinction",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-132": {
        "id": "hhps-132",
        "course_id": "H/HPS 132",
        "name": "Humanistic Ecology",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Humans' conceptions of nature have changed dramatically over time. Ecological systems influence human culture, politics, law, and many other spheres, and in turn, humans influence those systems. This class introduces students to the field of humanistic ecology-a discipline that looks to a number of cultural, political, historical and economic elements to better understand the role of ecology in a larger sphere outside of its scientific structure and uses. Humanistic ecology is designed to provide context for the study of ecology, and in a fundamental way, focuses on the appropriate role of humanity in its relationship to nature: what is ethical, or not, what is useful, or not, and a variety of other matters that should be considered when taking a fully three-dimensional view of ecological science.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Lewis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#humanistic-ecology",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-133": {
        "id": "hhps-133",
        "course_id": "H/HPS 133",
        "name": "Forests and Humans",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Forests - which cover 31 percent of the world's land surface - have played essential roles in enhancing the planet's biodiversity. Forests have also served humans in numerous and often controversial ways, and have also been subjected to dramatic change through human activity. How well have we served forests, as well as being served by them? The class will cover the growth and use of forests from a humanistic and historic perspective, as well as discussions about the role of fire in forests, with a particular emphasis on the unprecedented forest fires in California in the past several years and the global ecological implications.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Lewis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#forests-and-humans",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-134": {
        "id": "hhps-134",
        "course_id": "H/HPS 134",
        "name": "Birds, Evolution, Speciation and Society",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The cultural, scientific, social and political roles of birds make them an excellent lens through which to view humans' interactions with the natural world. This course will cover our changing understandings of birds, starting with hawking and falconry in earlier centuries, through the discovery of new species, up through Darwinian understandings of speciation and evolution, and continuing up to present scientific understandings of birds' capabilities and their ties to humankind, as well as to other anchors in the natural world. We will take a strong biographical as well as avian approach to understanding key personalities who furthered our understandings of avian science.",
        "offered": true,
        "instructors": "Lewis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#birds,-evolution,-speciation-and-society",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-135": {
        "id": "hpspl-135",
        "course_id": "HPS/Pl 135",
        "name": "The Moral Brain",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will critically examine attempts to understand moral judgment and behavior from the perspective of neuroscience and controversies surrounding its implications for moral philosophy. Starting from an evolutionary perspective, we will investigate the search for moral precursors in non-human primates and the evolutionary innovations in cognitive, emotional, and motivational mechanisms purported to underlie human morality. From there, we will investigate controversies regarding this emerging \"neuroethics\" for debates in moral psychology and normative ethics, including the role of reason, desire, and the self in normative theory and whether neuroscience can play any role in adjudicating among competing theories of normative ethics.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Quartz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#the-moral-brain",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-136": {
        "id": "hpspl-136",
        "course_id": "HPS/Pl 136",
        "name": "Happiness and the Good Life",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course will critically examine the emerging science of happiness and positive psychology, its philosophical assumptions, methodology, and its role in framing social policy and practice. Topics to be addressed include: the relation between happiness as subjective well-being or life satisfaction and philosophical visions of the good life; the relation between happiness and virtue; the causes of happiness and the role of life experience; happiness and economic notions of human welfare, attempts to measure happiness, and the prospect for an economics of happiness; happiness as a brain state and whether brain science can illuminate the nature of happiness; mental illness and psychiatry in light of positive psychology.",
        "offered": true,
        "instructors": "Quartz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#happiness-and-the-good-life",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-138": {
        "id": "hpspl-138",
        "course_id": "HPS/Pl 138",
        "name": "Human Nature and Society",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course will investigate how assumptions about human nature shape political philosophy, social institutions, and social policy. The course will begin with a historical perspective, examining the work of such political philosophers as Plato, Locke, Rousseau, and Marx, along with such psychologists as Freud and Skinner. Against this historical perspective, it will then turn to examine contemporary views on human nature from cognitive neuroscience and evolutionary psychology and explore their potential implications for political philosophy and social policy. Among topics to be discussed will be the nature of human sociality and cooperation; economic systems and assumptions regarding production and consumption; and propaganda, marketing, and manipulation.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Quartz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#human-nature-and-society",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-139": {
        "id": "hpspl-139",
        "course_id": "HPS/Pl 139",
        "name": "Human Nature, Welfare, & Sustainability",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Policy makers since at least the time of Jeremy Bentham have argued that welfare maximization ought to be the goal of social policy. When this includes perfectionist notions of realizing one's capacities, economic prosperity, prosocial norms, and democratization have all coincided as key drivers of human development. Although the UN 2030 Agenda for Sustainable Development envisions worldwide inclusive and sustainable economic growth, there is substantial debate regarding the extent to which sustainability and economic growth are compatible. This course will critically examine the links between human welfare, economic growth, and material culture to better understand why economic growth and welfare have been taken to be intertwined - and the extent to which they could be decoupled. Our starting point will be the Brundtland report, its conception of welfare based on human needs, and subsequent articulations of needs-based theories of human welfare, including evolutionary and biological accounts that include social comparison processes such as esteem, status, and recognition. This will provide us with a theoretical framework for investigating the role of material culture in satisfying these needs and whether they may be satisfied by less resource-intense routes.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Quartz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#human-nature,-welfare,-&-sustainability",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-153": {
        "id": "hhps-153",
        "course_id": "H/HPS 153",
        "name": "Inequality and Environment",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This seminar introduces students to the history of environmental inequality, environmental racism, and environmental justice. Human bodies are inescapably enmeshed in our environments: human health and environmental health are inseparable. But environmental burdens and benefits are distributed unevenly along lines of race, gender, class, and nationality. We will examine local, national, and transnational case studies to understand the historical development of environmental inequalities and movements for environmental justice. We will consider different methods for studying environmental injustice and the politics of environmental knowledge.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#inequality-and-environment",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-154": {
        "id": "hhps-154",
        "course_id": "H/HPS 154",
        "name": "Feminist Science Studies",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This seminar offers an introduction to scholarship on gender and science. Feminist science studies can seem oxymoronic: the objectivity on which science depends appears opposed to the political commitments feminism implies. Scholars in feminist science studies, however, argue that feminist theory and methods can in fact improve scientific practice. This course will introduce students to the historical development of feminist Science & Technology Studies and what this field tells us about the history of women in science, the history of scientific theories of sex/gender, and the future of feminist research. This reading-heavy class will also include discussions of feminist epistemology, feminist research methods, and new directions in feminist STS.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#feminist-science-studies",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-155": {
        "id": "hhps-155",
        "course_id": "H/HPS 155",
        "name": "Mortality Crises and Social Change: Epidemic Disease from 1300 to the Present",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "What do we know about epidemics in the past? What did contemporaries understand about these events? How did societies respond to periodic bouts of epidemic disease? This course examines mortality crises and epidemics from the Black Death in the 14th century to the current coronavirus pandemic, with attention given to the impact of epidemics on societies, the ways in which such outbreaks have been understood over time and the kinds of responses they have elicited. We will draw on studies for a range of societies in order to identify patterns across space and time, and to highlight both continuity and change in the ways societies have dealt with contagious diseases.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dennison",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#mortality-crises-and-social-change:-epidemic-disease-from-1300-to-the-present",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-160": {
        "id": "hpsh-160",
        "course_id": "HPS/H 160",
        "name": "Einstein on the Run: European Scientists Fleeing Fascism, War, and the Holocaust",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Kormos-Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#einstein-on-the-run:-european-scientists-fleeing-fascism,-war,-and-the-holocaust",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-162": {
        "id": "hpsh-162",
        "course_id": "HPS/H 162",
        "name": "Social Studies of Science",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A comparative, multidisciplinary course that examines the practice of science in a variety of locales, using methods from the history, sociology, and anthropology of scientific knowledge. Topics covered include the high-energy particle laboratory as compared with a biological one; Western as compared to non-Western scientific reasoning; the use of visualization techniques in science from their inception to virtual reality; gender in science; and other topics.",
        "offered": true,
        "instructors": "Feingold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#social-studies-of-science",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-165": {
        "id": "hpspl-165",
        "course_id": "HPS/Pl 165",
        "name": "Selected Topics in Philosophy of Science",
        "units": "9 units (3-0-6)",
        "terms": "offered by announcement",
        "description": "",
        "offered": true,
        "instructors": "Staff, visiting lecturers",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#selected-topics-in-philosophy-of-science",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-166": {
        "id": "hpsh-166",
        "course_id": "HPS/H 166",
        "name": "Historical Perspectives on the Relations between Science and Religion",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The course develops a framework for understanding the changing relations between science and religion in Western culture since antiquity. Focus will be on the ways in which the conceptual, personal, and social boundaries between the two domains have been reshaped over the centuries. Questions to be addressed include the extent to which a particular religious doctrine was more or less amenable to scientific work in a given period, how scientific activity carved an autonomous domain, and the roles played by scientific activity in the overall process of secularization.",
        "offered": true,
        "instructors": "Feingold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#historical-perspectives-on-the-relations-between-science-and-religion",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-167": {
        "id": "hpsh-167",
        "course_id": "HPS/H 167",
        "name": "Experimenting with History/Historic Experiment",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course uses a combination of lectures with hands-on laboratory work to bring out the methods, techniques, and knowledge that were involved in building and conducting historical experiments. We will connect our laboratory work with the debates and claims made by the original discoverers, asking such questions as how experimental facts have been connected to theories, how anomalies arise and are handled, and what sorts of conditions make historically for good data. Typical experiments might include investigations of refraction, laws of electric force, interference of polarized light, electromagnetic induction, or resonating circuits and electric waves. We will reconstruct instrumentation and experimental apparatus based on a close reading of original sources.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#experimenting-with-history/historic-experiment",
        "prereq_text": "Prerequisites: Ph 1 abc, and Ph 2 abc (may be taken concurrently).",
        "prereqs": [
            "ph-2-abc",
            "ph-1-abc"
        ]
    },
    "hpsh-168": {
        "id": "hpsh-168",
        "course_id": "HPS/H 168",
        "name": "History of Electromagnetism and Heat Science",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course covers the development of electromagnetism and thermal science from its beginnings in the early 18th century through the early 20th century. Topics covered include electrostatics, magnetostatics, electrodynamics, Maxwell's field theory, the first and second laws of thermodynamics, and statistical mechanics as well as related experimental discoveries.",
        "offered": true,
        "instructors": "Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#history-of-electromagnetism-and-heat-science",
        "prereq_text": "Prerequisites: Ph 1 abc, and Ph 2 abc (may be taken concurrently).",
        "prereqs": [
            "ph-2-abc",
            "ph-1-abc"
        ]
    },
    "hpsh-169": {
        "id": "hpsh-169",
        "course_id": "HPS/H 169",
        "name": "Selected Topics in the History of Science and Technology",
        "units": "9 units (3-0-6)",
        "terms": "",
        "description": "",
        "offered": true,
        "instructors": "Staff, visiting lecturers",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#selected-topics-in-the-history-of-science-and-technology",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-170": {
        "id": "hpsh-170",
        "course_id": "HPS/H 170",
        "name": "History of Light from Antiquity to the 20th Century",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "A study of the experimental, mathematical, and theoretical developments concerning light, from the time of Ptolemy in the 2nd century A.D. to the production of electromagnetic optics in the 20th century.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#history-of-light-from-antiquity-to-the-20th-century",
        "prereq_text": "Prerequisites: Ph 1 abc, and Ph 2 abc (may be taken concurrently).",
        "prereqs": [
            "ph-2-abc",
            "ph-1-abc"
        ]
    },
    "hpsh-171": {
        "id": "hpsh-171",
        "course_id": "HPS/H 171",
        "name": "History of Mechanics from Galileo through Euler",
        "units": "9 units (3-0-6)",
        "terms": "",
        "description": "This course covers developments in mechanics, as well as related aspects of mathematics and models of nature, from just before the time of Galileo through the middle of the 18th century, which saw the creation of fluid and rotational dynamics in the hands of Euler and others.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#history-of-mechanics-from-galileo-through-euler",
        "prereq_text": "Prerequisites: Ph 1 abc, and Ph 2 abc (may be taken concurrently).",
        "prereqs": [
            "ph-2-abc",
            "ph-1-abc"
        ]
    },
    "hpsh-172": {
        "id": "hpsh-172",
        "course_id": "HPS/H 172",
        "name": "History of Mathematics: A Global View with Close-ups",
        "units": "9 units (3-0-6)",
        "terms": "offered by announcement",
        "description": "The course will provide students with a brief yet adequate survey of the history of mathematics, characterizing the main developments and placing these in their chronological, cultural, and scientific contexts. A more detailed study of a few themes, such as Archimedes' approach to infinite processes, the changing meanings of \"analysis\" in mathematics, Descartes' analytic geometry, and the axiomatization of geometry c. 1900; students' input in the choice of these themes will be welcomed.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#history-of-mathematics:-a-global-view-with-close-ups",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-175": {
        "id": "hpsh-175",
        "course_id": "HPS/H 175",
        "name": "Matter, Motion, and Force: Physical Astronomy from Ptolemy to Newton",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The course will examine how elements of knowledge that evolved against significantly different cultural and religious backgrounds motivated the great scientific revolution of the 17th century.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#matter,-motion,-and-force:-physical-astronomy-from-ptolemy-to-newton",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-180": {
        "id": "hpsh-180",
        "course_id": "HPS/H 180",
        "name": "Forbidden Knowledge",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Why does the notion of freedom of knowledge and teaching in science and engineering matter? What kinds of restrictions have been placed on scientists and engineers, their publications and institutions? Who restrained scientific and engineering knowledge of what sorts; for what reasons; and how successfully? These questions will be addressed by exploring the strategies developed by the U.S. research community to protect the international circulation of knowledge after World War II, when scientific freedom and the export of technical data had to be balanced with the needs of national security. Case studies will include the atomic bomb, the semiconductor industry in the 1970s and space technologies, notably rockets/missiles, in the 1990s. The threat to U.S. economics and military security posed by the Soviet Union in the Cold War, and by China today, has transformed the practice of research in university and in industry alike building new walls around the production and circulation of knowledge to affirm national sovereignty that is, all the while, being undermined by the global circulation of trained scientists and engineers.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#forbidden-knowledge",
        "prereq_text": "",
        "prereqs": []
    },
    "plhps-183": {
        "id": "plhps-183",
        "course_id": "Pl/HPS 183",
        "name": "Bioethics",
        "units": "9 units (3-0-6)",
        "terms": "first, third terms",
        "description": "",
        "offered": true,
        "instructors": "Gurcan, Helou",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#bioethics",
        "prereq_text": "",
        "prereqs": []
    },
    "hhpsvc-185": {
        "id": "hhpsvc-185",
        "course_id": "H/HPS/VC 185",
        "name": "Angels and Monsters: Cosmology, Anthropology, and the Ends of the World",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course explores late medieval European understandings of the origins, structure, and workings of the cosmos in the realms of theology, physics, astronomy, astrology, magic, and medicine. Attention is given to the position of humans as cultural creatures at the intersection of nature and spirit; as well as to the place of Christian Europeans in relation to non-Christians and other categories of outsiders within and beyond Europe. We will examine the knowledge system that anticipated racializing theories in the West.",
        "offered": true,
        "instructors": "Wey-Gomez",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#angels-and-monsters:-cosmology,-anthropology,-and-the-ends-of-the-world",
        "prereq_text": "",
        "prereqs": []
    },
    "hhpsvc-186": {
        "id": "hhpsvc-186",
        "course_id": "H/HPS/VC 186",
        "name": "From Plato to Pluto: Maps, Exploration and Culture from Antiquity to the Present",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course covers a broad range of topics in the history of maps and exploration from Antiquity to the present. These topics range from the earliest visualizations of earth and space in the Classical world to contemporary techniques in interplanetary navigation. By way of maps, students will explore various ways in which different cultures have conceptualized and navigated earth and space. While maps emulate the world as perceived by the human eye, they, in fact, comprise a set of observations and perceptions of the relationship between bodies in space and time. Thus, students will study maps, and the exploration they enable, as windows to the cultures that have produced them, not only as scientific and technical artifacts to measure and navigate our world.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Wey-Gomez",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hps/#from-plato-to-pluto:-maps,-exploration-and-culture-from-antiquity-to-the-present",
        "prereq_text": "",
        "prereqs": []
    }
}