{
    "eeme-7": {
        "id": "eeme-7",
        "course_id": "EE/ME 7",
        "name": "Introduction to Mechatronics",
        "units": "6 units (2-3-1)",
        "terms": "first term",
        "description": "Mechatronics is the multi-disciplinary design of electro-mechanical systems. This course is intended to give the student a basic introduction to such systems. The course will focus on the implementations of sensor and actuator systems, the mechanical devices involved and the electrical circuits needed to interface with them. The class will consist of lectures and short labs where the student will be able to investigate the concepts discussed in lecture. Topics covered include motors, piezoelectric devices, light sensors, ultrasonic transducers, and navigational sensors such as accelerometers and gyroscopes. Graded pass/fail.",
        "offered": true,
        "instructors": "George",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#introduction-to-mechatronics",
        "prereq_text": "",
        "prereqs": []
    },
    "me-8": {
        "id": "me-8",
        "course_id": "ME 8",
        "name": "Introduction to Robotics",
        "units": "6 units (1-4-1)",
        "terms": "first term",
        "description": "This course examines the range of concepts and engineering approaches applicable to robotics. This includes tools from mechanical design and fabrication, mathematical analysis of mechanisms, a variety of sensors, programming at all levels, algorithms to interpret visual images, and planners to determine actions. Robots also act in a larger context, involving human-robot interactions, social cues, and even raising ethical questions. The course will explore these topics through hardware and software mini-projects. Lab work will combine instructor-led, mandatory sessions with additional self-paced times. Open only to first-year students.  Sophomore students by permission of the instructor.",
        "offered": true,
        "instructors": "Niemeyer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#introduction-to-robotics",
        "prereq_text": "Prerequisites: Basic python programming, evidenced by the successful completion of a programming exercise by the end of the first week of classes.",
        "prereqs": []
    },
    "me-10": {
        "id": "me-10",
        "course_id": "ME 10",
        "name": "Thinking Like an Engineer",
        "units": "1 unit",
        "terms": "first term",
        "description": "A series of weekly seminars by practicing engineers in industry and academia to introduce students to principles and techniques useful for Mechanical Engineering. The course can be used to learn more about the different areas of study within Mechanical Engineering. Topics will be presented at an informal, introductory level. Required for ME undergraduates. Graded pass/fail.",
        "offered": true,
        "instructors": "Colonius",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#thinking-like-an-engineer",
        "prereq_text": "",
        "prereqs": []
    },
    "me-11-abc": {
        "id": "me-11-abc",
        "course_id": "ME 11 abc",
        "name": "Thermal Science",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "An introduction to classical thermodynamics and transport with engineering applications. First and second laws; closed and open systems; properties of a pure substance; availability and irreversibility; generalized thermodynamic relations; gas and vapor power cycles; propulsion; mixtures; combustion and thermochemistry; chemical equilibrium; momentum and heat transfer including boundary layers with applications to internal and external flows. Not offered on a pass/fail basis.",
        "offered": false,
        "instructors": "Hunt, Minnich, Fu",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#thermal-science",
        "prereq_text": "Prerequisites: Sophomore standing required; ME 12 abc, may be taken concurrently.",
        "prereqs": [
            "me-12-abc"
        ]
    },
    "me-12-abc": {
        "id": "me-12-abc",
        "course_id": "ME 12 abc",
        "name": "Mechanics",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "An introduction to statics and dynamics of rigid bodies, deformable bodies, and fluids. Equilibrium of force systems, principle of virtual work, distributed force systems, friction, static analysis of rigid and deformable structures, hydrostatics, kinematics, particle dynamics, rigid-body dynamics, Euler's equations, ideal flow, vorticity, viscous stresses in fluids, dynamics of deformable systems, waves in fluids and solids. Not offered on a pass/fail basis.",
        "offered": false,
        "instructors": "Mello, Andrade, Asimaki",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#mechanics",
        "prereq_text": "Prerequisites: Sophomore standing required; ME 11 abc, may be taken concurrently.",
        "prereqs": [
            "me-11-abc"
        ]
    },
    "me-13113": {
        "id": "me-13113",
        "course_id": "ME 13/113",
        "name": "Mechanical Prototyping",
        "units": "4 units (0-4-0)",
        "terms": "first, second, summer terms",
        "description": "Enrollment is limited and is based on responses to a questionnaire available in the Registrar's Office. Introduction to the technologies and practices needed to fabricate mechanical prototypes. Students will acquire the fundamental skills necessary to begin using 3D Computer-Aided Design (CAD) software. Students will learn how to build parametric models of parts and assemblies and learn how to generate detailed drawings of their designs. Students will also be introduced to manual machining techniques, as well as computer-controlled prototyping technologies, such as three-dimensional printing, laser cutting, and water jet cutting. Students will receive safety-training, instruction on the theories underlying different machining methods, and hands-on demonstrations of machining and mechanical assembly methods. Several prototypes will be constructed using the various technologies available in the Mechanical Engineering Machine Shop.",
        "offered": true,
        "instructors": "Stovall, Wilson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#mechanical-prototyping",
        "prereq_text": "",
        "prereqs": []
    },
    "me-14": {
        "id": "me-14",
        "course_id": "ME 14",
        "name": "Design and Fabrication",
        "units": "9 units (3-5-1)",
        "terms": "third term",
        "description": "Enrollment is limited and is based on responses to a questionnaire available in the Registrar's office. Introduction to mechanical engineering design, fabrication, and visual communication. Principles of mechanical engineering design are taught through a series of lectures and short group-based design projects with an emphasis on formal design reviews and team competitions. Course lectures address the strength properties of engineering materials, statistical descriptions of stress and strength, design safety factors, static and variable loading design criteria, engineering case studies, and the design of mechanical elements. Group-based projects include formal design reviews and involve substantial use of the machine shop and maker-space facilities, for the construction of working prototypes. Not offered on a pass/fail basis.",
        "offered": false,
        "instructors": "Mello, Stovall",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#design-and-fabrication",
        "prereq_text": "Prerequisites: ME 12 ab, ME 13.",
        "prereqs": [
            "me-13113",
            "me-12-abc"
        ]
    },
    "me-23123": {
        "id": "me-23123",
        "course_id": "ME 23/123",
        "name": "CNC Machining",
        "units": "4 units (0-4-0)",
        "terms": "third, summer terms",
        "description": "Enrollment is limited and is based on responses to a questionnaire available in the Registrar's office. Introduction to computer numerical control machining. Students will learn to create Gcode and Mcode using Computer-Aided Manufacturing (CAM) software; they will be instructed on how to safely prepare and operate the machine's functions; and will be taught how to implement programmed data into several different types of CNC equipment. The class will cover the parts and terminology of the equipment, fixturing materials, setting workpiece, and tool offsets. Weekly assignments will include the use of CAM software, machine operation demonstrations, and machining projects.",
        "offered": true,
        "instructors": "Stovall, Wilson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#cnc-machining",
        "prereq_text": "Prerequisites: ME 13/113.",
        "prereqs": [
            "me-13113"
        ]
    },
    "me-40": {
        "id": "me-40",
        "course_id": "ME 40",
        "name": "Dimensional and Data Analyses in Engineering",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Colonius",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#dimensional-and-data-analyses-in-engineering",
        "prereq_text": "Prerequisites: Ma 1 abc, ME 11 abc, ME 12 abc.",
        "prereqs": [
            "me-11-abc",
            "ma-1-d",
            "me-12-abc",
            "ma-1-abc"
        ]
    },
    "me-50-ab": {
        "id": "me-50-ab",
        "course_id": "ME 50 ab",
        "name": "Experiments and Modeling in Mechanical Engineering",
        "units": "12 units (3-6-3)",
        "terms": "second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Mello",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#experiments-and-modeling-in-mechanical-engineering",
        "prereq_text": "Prerequisites: ME 11 abc, ME 12 abc, ME 13, ME 14, and programming skills at the level of ACM 11.",
        "prereqs": [
            "me-13113",
            "me-12-abc",
            "me-14",
            "acm-11",
            "me-11-abc"
        ]
    },
    "me-72-ab": {
        "id": "me-72-ab",
        "course_id": "ME 72 ab",
        "name": "Engineering Design Laboratory",
        "units": "12 units (2-8-2) first term; 15 units (1-13-1) second term",
        "terms": "first, second terms",
        "description": "",
        "offered": true,
        "instructors": "Mello, Stovall",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#engineering-design-laboratory",
        "prereq_text": "Prerequisites: ME 14.",
        "prereqs": [
            "me-14"
        ]
    },
    "cseeme-75-abc": {
        "id": "cseeme-75-abc",
        "course_id": "CS/EE/ME 75 abc",
        "name": "Multidisciplinary Systems Engineering",
        "units": "3 units (2-0-1), 6 units (2-0-4), or 9 units (2-0-7) first term; 6 units (2-3-1), 9 units (2-6-1), or 12 units (2-9-1) second and third terms",
        "terms": "first, second, third terms",
        "description": "This course presents the fundamentals of modern multidisciplinary systems engineering in the context of a substantial design project. Students from a variety of disciplines will conceive, design, implement, and operate a system involving electrical, information, and mechanical engineering components. Specific tools will be provided for setting project goals and objectives, managing interfaces between component subsystems, working in design teams, and tracking progress against tasks. Students will be expected to apply knowledge from other courses at Caltech in designing and implementing specific subsystems. During the first two terms of the course, students will attend project meetings and learn some basic tools for project design, while taking courses in CS, EE, and ME that are related to the course project. During the third term, the entire team will build, document, and demonstrate the course design project, which will differ from year to year. First-year undergraduate students must receive permission from the lead instructor to enroll.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#multidisciplinary-systems-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "me-90-abc": {
        "id": "me-90-abc",
        "course_id": "ME 90 abc",
        "name": "Senior Thesis: Major Design Experience",
        "units": "9 units (0-0-9)",
        "terms": "first, second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Ames",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#senior-thesis:-major-design-experience",
        "prereq_text": "Prerequisites: senior status; instructor's permission.",
        "prereqs": []
    },
    "me-91-abc": {
        "id": "me-91-abc",
        "course_id": "ME 91 abc",
        "name": "Senior Thesis",
        "units": "9 units (0-0-9)",
        "terms": "first, second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Ames",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#senior-thesis",
        "prereq_text": "Prerequisites: senior status; instructor's permission.",
        "prereqs": []
    },
    "me-100": {
        "id": "me-100",
        "course_id": "ME 100",
        "name": "Independent Studies in Mechanical Engineering",
        "units": "",
        "terms": "",
        "description": "A faculty mentor will oversee a student proposed, independent research or study project to meet the needs of undergraduate students. Graded pass/fail. The consent of a faculty mentor and a written report is required for each term of work.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#independent-studies-in-mechanical-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "aeaphceme-101-abc": {
        "id": "aeaphceme-101-abc",
        "course_id": "Ae/APh/CE/ME 101 abc",
        "name": "Fluid Mechanics",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Fundamentals of fluid mechanics. Microscopic and macroscopic properties of liquids and gases; the continuum hypothesis; review of thermodynamics; general equations of motion; kinematics; stresses; constitutive relations; vorticity, circulation; Bernoulli's equation; potential flow; thin-airfoil theory; surface gravity waves; buoyancy-driven flows; rotating flows; viscous creeping flow; viscous boundary layers; introduction to stability and turbulence; quasi one-dimensional compressible flow; shock waves; unsteady compressible flow; and acoustics.",
        "offered": true,
        "instructors": "Bae, Pullin, Colonius",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#fluid-mechanics",
        "prereq_text": "Prerequisites: APh 17 or ME 11 abc, and ME 12 or equivalent, ACM 95/100 or equivalent (may be taken concurrently).",
        "prereqs": [
            "me-12-abc",
            "acm-95100-ab",
            "me-11-abc",
            "aph-17-abc"
        ]
    },
    "aeamceme-102-abc": {
        "id": "aeamceme-102-abc",
        "course_id": "Ae/AM/CE/ME 102 abc",
        "name": "Mechanics of Structures and Solids",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Introduction to continuum mechanics: kinematics, balance laws, constitutive laws with an emphasis on solids. Static and dynamic stress analysis. Two- and three-dimensional theory of stressed elastic solids. Wave propagation. Analysis of rods, plates and shells with applications in a variety of fields. Variational theorems and approximate solutions. Elastic stability.",
        "offered": true,
        "instructors": "Lapusta, Ravichandran",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#mechanics-of-structures-and-solids",
        "prereq_text": "Prerequisites: ME 12 abc.",
        "prereqs": [
            "me-12-abc"
        ]
    },
    "aphmsme-105-abc": {
        "id": "aphmsme-105-abc",
        "course_id": "APh/MS/ME 105 abc",
        "name": "States of Matter",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Thermodynamics and statistical mechanics, with emphasis on gases, liquids, materials, and condensed matter. Effects of heat, pressure, and fields on states of matter are presented with both classical thermodynamics and with statistical mechanics. Conditions of equilibrium in systems with multiple degrees of freedom. Applications include ordered states of matter and phase transitions. The three terms cover, approximately, thermodynamics, statistical mechanics, and phase transitions.",
        "offered": true,
        "instructors": "Minnich, Troian, Falson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#states-of-matter",
        "prereq_text": "Prerequisites: APh 17 abc or equivalent.",
        "prereqs": [
            "aph-17-abc"
        ]
    },
    "ememede-106-ab": {
        "id": "ememede-106-ab",
        "course_id": "E/ME/MedE 106 ab",
        "name": "Design for Freedom from Disability",
        "units": "9 units (3-0-6)",
        "terms": "terms to be arranged",
        "description": "This Product Design class focuses on people with Disabilities and is done in collaboration with Rancho Los Amigos National Rehabilitation Center. Students visit the Center to define products based upon actual stated and observed needs. Designs and testing are done in collaboration with Rancho associates. Speakers include people with assistive needs, therapists and researchers. Classes teach normative design methodologies as adapted for this special area.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#design-for-freedom-from-disability",
        "prereq_text": "",
        "prereqs": []
    },
    "me-110": {
        "id": "me-110",
        "course_id": "ME 110",
        "name": "Special Laboratory Work in Mechanical Engineering",
        "units": "3-9 units per term",
        "terms": "maximum two terms",
        "description": "Special laboratory work or experimental research projects may be arranged by members of the faculty to meet the needs of individual students as appropriate. A written report is required for each term of work.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#special-laboratory-work-in-mechanical-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "cheesemems-111": {
        "id": "cheesemems-111",
        "course_id": "ChE/ESE/ME/MS 111",
        "name": "Sustainable Engineering",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Examines the Earth's resources including fresh water, nitrogen, carbon and other biogeochemical cycles that impose planetary constraints on engineering; systems approaches to sustainable development goals; fossil fuel formation, chemical composition, production and use; engineering challenges and opportunities in decarbonizing energy, transportation and industry; global flows of critical elements used in zero-carbon energy systems; food-water-energy nexus; analysis of regional and local systems to model effects of human activities on air, water and soil.",
        "offered": true,
        "instructors": "Kornfield",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#sustainable-engineering",
        "prereq_text": "Prerequisites: (ChE 62 and ChE 63 ab) or (ME 11 abc) or (Ph 2 c and MS 115) or Instructor's permission.",
        "prereqs": [
            "ph-2-abc",
            "me-11-abc"
        ]
    },
    "msmemede-116": {
        "id": "msmemede-116",
        "course_id": "MS/ME/MedE 116",
        "name": "Mechanical Behavior of Materials",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Introduction to the mechanical behavior of solids, emphasizing the relationships between microstructure, architecture, defects, and mechanical properties. Elastic, inelastic, and plastic properties of crystalline and amorphous materials. Relations between stress and strains for different types of materials. Introduction to dislocation theory, motion and forces on dislocations, strengthening mechanisms in crystalline solids. Nanomaterials: properties, fabrication, and mechanics. Architected solids: fabrication, deformation, failure, and energy absorption. Biomaterials: mechanical properties of composites, multi-scale microstructure, biological vs. synthetic, shear lag model. Fracture in brittle solids and linear elastic fracture mechanics.",
        "offered": true,
        "instructors": "Greer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#mechanical-behavior-of-materials",
        "prereq_text": "",
        "prereqs": []
    },
    "meeeest-117": {
        "id": "meeeest-117",
        "course_id": "ME/EE/EST 117",
        "name": "Energy Technology and Policy",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Energy technologies and the impact of government policy. Fossil fuels, nuclear power, and renewables for electricity production and transportation. Resource models and climate change policies. New and emerging technologies.",
        "offered": true,
        "instructors": "Blanquart",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#energy-technology-and-policy",
        "prereq_text": "Prerequisites: Ph 1 abc, Ch 1 ab and Ma 1 abc.",
        "prereqs": [
            "ma-1-d",
            "ph-1-abc",
            "ma-1-abc"
        ]
    },
    "aeme-118": {
        "id": "aeme-118",
        "course_id": "Ae/ME 118",
        "name": "Classical Thermodynamics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Fundamentals of Classical Thermodynamics. Basic laws of thermodynamics, work and heat, entropy and available work, and thermal systems. Equations of state, compressibility functions, and the Law of Corresponding States. Thermodynamic potentials, phase equilibrium, phase transitions, and thermodynamic properties of solids, liquids, and gases. Examples will be drawn from fluid dynamics, solid mechanics, energy systems, and thermal-science applications.",
        "offered": true,
        "instructors": "Minnich",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#classical-thermodynamics",
        "prereq_text": "Prerequisites: ME 11 abc, ME 12 abc, or equivalent.",
        "prereqs": [
            "me-12-abc",
            "me-11-abc"
        ]
    },
    "me-119": {
        "id": "me-119",
        "course_id": "ME 119",
        "name": "Heat and Mass Transfer",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Transport properties, conservation equations, conduction heat transfer, convective heat and mass transport in laminar and turbulent flows, phase change processes, thermal radiation.",
        "offered": true,
        "instructors": "Hunt",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#heat-and-mass-transfer",
        "prereq_text": "Prerequisites: ME 11 abc, ME 12 abc, ACM 95/100 (may be taken concurrently).",
        "prereqs": [
            "me-12-abc",
            "acm-95100-ab",
            "me-11-abc"
        ]
    },
    "meae-120": {
        "id": "meae-120",
        "course_id": "ME/Ae 120",
        "name": "Combustion Fundamentals",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Blanquart",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#combustion-fundamentals",
        "prereq_text": "Prerequisites: ME 11 abc or equivalent, ACM 95/100 or equivalent (may be taken concurrently).",
        "prereqs": [
            "acm-95100-ab",
            "me-11-abc"
        ]
    },
    "mecsee-129": {
        "id": "mecsee-129",
        "course_id": "ME/CS/EE 129",
        "name": "Experimental Robotics",
        "units": "9 units (1-7-1)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Niemeyer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#experimental-robotics",
        "prereq_text": "Prerequisites: some experience with (i) Python programming (CS1, CS2, or equivalent), (ii) Hardware, Sensors, and Signal Processing (EE/ME7, ME8, EE1, or similar), and/or (iii) Robotic Devices (ME13, ME72, or related), as evidenced to the instructor.   Not recommended for first-year students.",
        "prereqs": []
    },
    "mecsee-133-ab": {
        "id": "mecsee-133-ab",
        "course_id": "ME/CS/EE 133 ab",
        "name": "Robotics",
        "units": "9 units (3-2-4)",
        "terms": "first, second terms",
        "description": "The course develops the core concepts of robotics. The first quarter focuses on classical robotic manipulation, including topics in rigid body kinematics and dynamics. It develops planar and 3D kinematic formulations and algorithms for forward and inverse computations, Jacobians, and manipulability. The second quarter transitions to planning, navigation, and perception. Topics include configuration space, sample-based planners, A* and D* algorithms, to achieve collision-free motions. Course work transitions from homework and programming assignments to more open-ended team-based projects.",
        "offered": true,
        "instructors": "Niemeyer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#robotics",
        "prereq_text": "Prerequisites: ME/CS/EE 129, or Python programming experience, evidenced to instructor.",
        "prereqs": [
            "mecsee-129"
        ]
    },
    "mecsee-134": {
        "id": "mecsee-134",
        "course_id": "ME/CS/EE 134",
        "name": "Robotic Systems",
        "units": "9 units (1-7-1)",
        "terms": "second term",
        "description": "This course builds up, and brings to practice, the elements of robotic systems at the intersection of hardware, kinematics and control, computer vision, and autonomous behaviors. It presents selected topics from these domains, focusing on their integration into a full sense-think-act robot. The lectures will drive team-based projects, progressing from building custom robotic arms (5 to 7 degrees of freedom) to writing all necessary software (utilizing the Robotics Operating system, ROS). Teams are required to implement and customize general concepts for their selected tasks. Working systems will autonomously operate and demonstrate their capabilities during final presentations.",
        "offered": true,
        "instructors": "Niemeyer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#robotic-systems",
        "prereq_text": "Prerequisites: ME/CS/EE 133 a, or with permission of instructor.",
        "prereqs": [
            "mecsee-133-ab"
        ]
    },
    "mecegeese-146": {
        "id": "mecegeese-146",
        "course_id": "ME/CE/Ge/ESE 146",
        "name": "Computational Methods for Flow in Porous Media",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Fu",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#computational-methods-for-flow-in-porous-media",
        "prereq_text": "Prerequisites: ME 11 abc, ME 12 abc, ACM 95/100, ACM 106 ab (may be taken concurrently).",
        "prereqs": [
            "me-12-abc",
            "acm-95100-ab",
            "me-11-abc"
        ]
    },
    "amceme-150-abc": {
        "id": "amceme-150-abc",
        "course_id": "AM/CE/ME 150 abc",
        "name": "Graduate Engineering Seminar",
        "units": "1 unit",
        "terms": "each term",
        "description": "Students attend a graduate seminar each week of each term and submit a report about the attended seminars. At least four of the attended seminars each term should be from the Mechanical and Civil Engineering seminar series. Students not registered for the M.S. and Ph.D. degrees must receive the instructor's permission. Graded pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#graduate-engineering-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "aegeme-160-ab": {
        "id": "aegeme-160-ab",
        "course_id": "Ae/Ge/ME 160 ab",
        "name": "Continuum Mechanics of Fluids and Solids",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms.",
        "description": "Elements of Cartesian tensors. Configurations and motions of a body. Kinematics-study of deformations, rotations and stretches, polar decomposition. Lagrangian and Eulerian strain velocity and spin tensor fields. Irrotational motions, rigid motions. Kinetics-balance laws. Linear and angular momentum, force, traction stress. Cauchy's theorem, properties of Cauchy's stress. Equations of motion, equilibrium equations. Power theorem, nominal (Piola-Kirchoff) stress. Thermodynamics of bodies. Internal energy, heat flux, heat supply. Laws of thermodynamics, notions of entropy, absolute temperature. Entropy inequality (Clausius-Duhem). Examples of special classes of constitutive laws for materials without memory. Objective rates, corotational, convected rates. Principles of materials frame indifference. Examples: the isotropic Navier-Stokes fluid, the isotropic thermoelastic solid. Basics of finite differences, finite elements, and boundary integral methods, and their applications to continuum mechanics problems illustrating a variety of classes of constitutive laws.\n part b not offered 2024-25",
        "offered": true,
        "instructors": "Lapusta",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#continuum-mechanics-of-fluids-and-solids",
        "prereq_text": "",
        "prereqs": []
    },
    "msme-161": {
        "id": "msme-161",
        "course_id": "MS/ME 161",
        "name": "Imperfections in Crystals",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The relation of lattice defects to the physical and mechanical properties of crystalline solids. Introduction to point imperfections and their relationships to transport properties in metallic, covalent, and ionic crystals. Kroeger-Vink notation. Introduction to dislocations: geometric, crystallographic, elastic, and energetic properties of dislocations. Dislocation reactions and interactions including formation of locks, stacking faults, and surface effects. Relations between collective dislocation behavior and mechanical properties of crystals. Introduction to computer simulations of dislocations. Grain boundaries. The structure and properties of interfaces in solids. Emphasis on materials science aspects of role of defects in electrical, morphological, optical, and mechanical properties of solids.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Greer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#imperfections-in-crystals",
        "prereq_text": "Prerequisites: graduate standing or MS 115.",
        "prereqs": []
    },
    "amme-165": {
        "id": "amme-165",
        "course_id": "AM/ME 165",
        "name": "Finite Elasticity",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Finite theory of elasticity: constitutive theory, semi-inverse methods. Variational methods. Applications to problems of current interest.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#finite-elasticity",
        "prereq_text": "Prerequisites: Ae/Ge/ME 160 a.",
        "prereqs": [
            "aegeme-160-ab"
        ]
    },
    "msme-166": {
        "id": "msme-166",
        "course_id": "MS/ME 166",
        "name": "Fracture of Brittle Solids",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The mechanical response of brittle materials (ceramics, glasses and some network polymers) will be treated using classical elasticity, energy criteria, and fracture mechanics. The influence of environment and microstructure on mechanical behavior will be explored. Transformation toughened systems, large-grain crack-bridging systems, nanostructured ceramics, porous ceramics, anomalous glasses, and the role of residual stresses will be highlighted. Strength, flaw statistics and reliability will be discussed.",
        "offered": true,
        "instructors": "Faber",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#fracture-of-brittle-solids",
        "prereq_text": "Prerequisites: graduate standing or MS 115 and MS 116.",
        "prereqs": []
    },
    "mecsee-169": {
        "id": "mecsee-169",
        "course_id": "ME/CS/EE 169",
        "name": "Mobile Robots",
        "units": "9 units (1-7-1)",
        "terms": "third term",
        "description": "Mobile robots need to perceive their environment and localize themselves with respect to maps thereof. They further require planners to move along collision-free paths. This course builds up mobile robots in team-based projects. Teams will write all necessary software from low-level hardware I/O to high level algorithms, using the robotic operating system (ROS). The final systems will autonomously maneuver to reach their goals or track various objectives.",
        "offered": true,
        "instructors": "Niemeyer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#mobile-robots",
        "prereq_text": "Prerequisites: ME/CS/EE 133 b, or with permission of instructor.",
        "prereqs": [
            "mecsee-133-ab"
        ]
    },
    "mecege-174": {
        "id": "mecege-174",
        "course_id": "ME/CE/Ge 174",
        "name": "Mechanics of Rocks",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Basic principles of deformation, strength, and stressing of rocks. Elastic behavior, plasticity, viscoelasticity, viscoplasticity, creep, damage, friction, failure mechanisms, shear localization, and interaction of deformation processes with fluids. Engineering and geological applications.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#mechanics-of-rocks",
        "prereq_text": "Prerequisites: Ae/Ge/ME 160 a.",
        "prereqs": [
            "aegeme-160-ab"
        ]
    },
    "esemeesteccheee-179": {
        "id": "esemeesteccheee-179",
        "course_id": "ESE/ME/EST/Ec/ChE/EE 179",
        "name": "Climate Change Impacts, Mitigation and Adaptation",
        "units": "3 units (3-0-0)",
        "terms": "second term",
        "description": "Climate change has already begun to impact life on the planet, and will continue in the coming decades. This class will explore particular causes and impacts of climate change, technologies to mitigate or adapt to those impacts, and the economic and social costs associated with them - particular focus will be paid to distributional issues, environmental and racial justice and equity intersections. The course will consist of 3-4 topical modules, each focused on a specific impact or sector (e.g. the electricity or transportation sector, climate impacts of food and agriculture, increasing fires and floods). Each module will contain lectures/content on the associated climate science background, engineering/technological developments to combat the issue, and an exploration of the economics and the inequities that exacerbate the situation, followed by group discussion and synthesis of the different perspectives.",
        "offered": true,
        "instructors": "Wennberg, Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#climate-change-impacts,-mitigation-and-adaptation",
        "prereq_text": "",
        "prereqs": []
    },
    "me-200": {
        "id": "me-200",
        "course_id": "ME 200",
        "name": "Advanced Work in Mechanical Engineering",
        "units": "",
        "terms": "",
        "description": "A faculty mentor will oversee a student proposed, independent research or study project to meet the needs of graduate students. Graded pass/fail. The consent of a faculty mentor and a written report is required for each term of work.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#advanced-work-in-mechanical-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "me-201": {
        "id": "me-201",
        "course_id": "ME 201",
        "name": "Advanced Topics in Mechanical Engineering",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The faculty will prepare courses on advanced topics to meet the needs of graduate students.",
        "offered": true,
        "instructors": "Andrade",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#advanced-topics-in-mechanical-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "aeammsme-213": {
        "id": "aeammsme-213",
        "course_id": "Ae/AM/MS/ME 213",
        "name": "Mechanics and Materials Aspects of Fracture",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Analytical and experimental techniques in the study of fracture in metallic and nonmetallic solids. Mechanics of brittle and ductile fracture; connections between the continuum descriptions of fracture and micromechanisms. Discussion of elastic-plastic fracture analysis and fracture criteria. Special topics include fracture by cleavage, void growth, rate sensitivity, crack deflection and toughening mechanisms, as well as fracture of nontraditional materials. Fatigue crack growth and life prediction techniques will also be discussed. In addition, \"dynamic\" stress wave dominated, failure initiation growth and arrest phenomena will be covered. This will include traditional dynamic fracture considerations as well as discussions of failure by adiabatic shear localization.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#mechanics-and-materials-aspects-of-fracture",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 abc (concurrently) or equivalent and instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "aeamceme-214": {
        "id": "aeamceme-214",
        "course_id": "Ae/AM/CE/ME 214",
        "name": "Computational Solid Mechanics",
        "units": "9 units (3-5-1)",
        "terms": "second term",
        "description": "This course focuses on the analysis of elastic thin shell structures in the large deformation regime. Problems of interest include softening behavior, bifurcations, loss of stability and localization. Introduction to the use of numerical methods in the solution of solid mechanics and multiscale mechanics problems. Variational principles. Finite element and isogeometric formulations for thin shells. Time integration, initial boundary value problems. Error estimation. Accuracy, stability and convergence. Iterative solution methods. Adaptive strategies.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#computational-solid-mechanics",
        "prereq_text": "Prerequisites: ACM 100 ab or equivalent; CE/AM/Ae 108 ab or equivalent or instructor's permission; Ae/AM/CE/ME 102 abc or instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "aeamme-215": {
        "id": "aeamme-215",
        "course_id": "Ae/AM/ME 215",
        "name": "Dynamic Behavior of Materials",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Fundamentals of theory of wave propagation; plane waves, wave guides, dispersion relations; dynamic plasticity, adiabatic shear banding; dynamic fracture; shock waves, equation of state.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#dynamic-behavior-of-materials",
        "prereq_text": "Prerequisites: ACM 100 abc or AM 125 abc; Ae/AM/CE/ME 102 abc.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "aemeaph-218": {
        "id": "aemeaph-218",
        "course_id": "Ae/ME/APh 218",
        "name": "Statistical Mechanics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Overview of probability and statistics, and the Maxwell-Boltzmann distribution. Overview and elements of Quantum Mechanics, degenerate energy states, particles in a box, and energy-state phase space. Statistics of indistinguishable elementary particles, Fermi-Dirac and Bose-Einstein statistics, partition functions, connections with classical thermodynamics, and the Law of Equipartition. Examples from equilibrium in fluids, solid-state physics, and others.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#statistical-mechanics",
        "prereq_text": "Prerequisites: Ae/ME 118, or equivalent.",
        "prereqs": [
            "aeme-118"
        ]
    },
    "memsam-221": {
        "id": "memsam-221",
        "course_id": "ME/MS/AM 221",
        "name": "Effective properties of heterogenous and meta-materials",
        "units": "",
        "terms": "third term",
        "description": "Heterogenous materials. Notion of effective properties. Homogenization theory and applications to linear conductivity, elasticity and viscoelasticity. Effective properties in non-linear setting and instabilities.  Wave propagation and meta-materials. Bandgaps.",
        "offered": true,
        "instructors": "Bhattacharya",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#effective-properties-of-heterogenous-and-meta-materials",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 or equivalent.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "aeamme-223": {
        "id": "aeamme-223",
        "course_id": "Ae/AM/ME 223",
        "name": "Plasticity",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Theory of dislocations in crystalline media. Characteristics of dislocations and their influence on the mechanical behavior in various crystal structures. Application of dislocation theory to single and polycrystal plasticity. Theory of the inelastic behavior of materials with negligible time effects. Experimental background for metals and fundamental postulates for plastic stress-strain relations. Variational principles for incremental elastic-plastic problems, uniqueness. Upper and lower bound theorems of limit analysis and shakedown. Slip line theory and applications. Additional topics may include soils, creep and rate-sensitive effects in metals, the thermodynamics of plastic deformation, and experimental methods in plasticity.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#plasticity",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 abc or instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "memsaeam-224": {
        "id": "memsaeam-224",
        "course_id": "ME/MS/Ae/AM 224",
        "name": "Multifunctional Materials",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Multiscale view of materials and different approaches of introducing functionality; Electronic aspects and multiferroic materials; Symmetry breaking phase transformations, microstructure: shape-memory alloys, ferroelectrics, liquid crystal elastomers; Composite materials and metamaterials: multifunctional structures.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#multifunctional-materials",
        "prereq_text": "Prerequisites: MS 115 or equivalent, Ae/AM/CE/ME 102 abc or APh 105 abc (may be waived with instructor's permission).",
        "prereqs": [
            "ph-105",
            "aeamceme-102-abc"
        ]
    },
    "aeammege-225": {
        "id": "aeammege-225",
        "course_id": "Ae/AM/ME/Ge 225",
        "name": "Special Topics in Solid Mechanics",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Subject matter changes depending on staff and student interest.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#special-topics-in-solid-mechanics",
        "prereq_text": "",
        "prereqs": []
    },
    "aeacmme-232-ab": {
        "id": "aeacmme-232-ab",
        "course_id": "Ae/ACM/ME 232 ab",
        "name": "Computational Fluid Dynamics",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "Development and analysis of algorithms used in the solution of fluid mechanics problems. Numerical analysis of discretization schemes for partial differential equations including interpolation, integration, spatial discretization, systems of ordinary differential equations; stability, accuracy, aliasing, Gibbs and Runge phenomena, numerical dissipation and dispersion; boundary conditions. Survey of finite difference, finite element, finite volume and spectral approximations for the numerical solution of the incompressible and compressible Euler and Navier-Stokes equations, including shock-capturing methods.",
        "offered": true,
        "instructors": "Bae, Meiron",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#computational-fluid-dynamics",
        "prereq_text": "Prerequisites: Ae/APh/CE/ME 101 abc or equivalent; ACM 100 ab or equivalent; ACM 104.",
        "prereqs": [
            "aeaphceme-101-abc"
        ]
    },
    "mecdsee-234-ab": {
        "id": "mecdsee-234-ab",
        "course_id": "ME/CDS/EE 234 ab",
        "name": "Advanced Robotics: Planning",
        "units": "9 units (3-3-3)",
        "terms": "second, third terms",
        "description": "Advanced topics in robotic motion planning and navigation, including inertial navigation, simultaneous localization and mapping, Markov Decision Processes, Stochastic Receding Horizon Control, Risk-Aware planning, robotic coverage planning, and multi-robot coordination. Course work will consist of homework, programming projects, and labs. Given in alternate years.",
        "offered": true,
        "instructors": "Burdick",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#advanced-robotics:-planning",
        "prereq_text": "Prerequisites: ME/CS/EE 133 b, or equivalent. ME/CS/EE 133 a preferred.",
        "prereqs": [
            "mecsee-133-ab"
        ]
    },
    "mecds-235-ab": {
        "id": "mecds-235-ab",
        "course_id": "ME/CDS 235 ab",
        "name": "Advanced Robotics: Kinematics",
        "units": "9 units (3-3-3)",
        "terms": "second, third terms",
        "description": "Advanced topics in robot kinematics and robotic mechanisms. Topics include a Lie Algebraic viewpoint on kinematics and robot dynamics, a review of robotic mechanisms, and a detailed development of robotic grasping and manipulation. Given in alternate years.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#advanced-robotics:-kinematics",
        "prereq_text": "Prerequisites: ME/CS/EE 133 a, or equivalent.",
        "prereqs": [
            "mecsee-133-ab"
        ]
    },
    "aecdsme-251-ab": {
        "id": "aecdsme-251-ab",
        "course_id": "Ae/CDS/ME 251 ab",
        "name": "Closed Loop Flow Control",
        "units": "9 units (3-0-6 a, 1-6-1 b)",
        "terms": "second, third term",
        "description": "This course seeks to introduce students to recent developments in theoretical and practical aspects of applying control to flow phenomena and fluid systems. Lecture topics in the second term drawn from: the objectives of flow control; a review of relevant concepts from classical and modern control theory; high-fidelity and reduced-order modeling; principles and design of actuators and sensors. Third term: laboratory work in open- and closed-loop control of boundary layers, turbulence, aerodynamic forces, bluff body drag, combustion oscillations and flow-acoustic oscillations.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#closed-loop-flow-control",
        "prereq_text": "Prerequisites: ACM 100 abc, Ae/APh/CE/ME 101 abc or equivalent.",
        "prereqs": [
            "aeaphceme-101-abc"
        ]
    },
    "amceme-252": {
        "id": "amceme-252",
        "course_id": "AM/CE/ME 252",
        "name": "Linear and Nonlinear Waves in Structured Media",
        "units": "9 units (2-1-6)",
        "terms": "third term",
        "description": "The course will cover the basic principles of wave propagation in solid media. It will discuss the fundamental principles used to describe linear and nonlinear wave propagation in continuum and discrete media. Selected recent scientific advancements in the dynamics of periodic media will also be discussed. Students learn the basic principles governing the propagation of waves in discrete and continuum solid media. These methods can be used to engineer materials with predefined properties and to design dynamical systems for a variety of engineering applications (e.g., vibration mitigation, impact absorption and sound insulation). The course will include an experimental component, to test wave phenomena in structured media.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#linear-and-nonlinear-waves-in-structured-media",
        "prereq_text": "",
        "prereqs": []
    },
    "aeamcemege-265-ab": {
        "id": "aeamcemege-265-ab",
        "course_id": "Ae/AM/CE/ME/Ge 265 ab",
        "name": "Static and Dynamic Failure of Brittle Solids and Interfaces, from the Micro to the Mega",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Linear elastic fracture mechanics of homogeneous brittle solids (e.g. geo-materials, ceramics, metallic glasses); small scale yielding concepts; experimental methods in fracture, fracture of bi-material interfaces with applications to composites as well as bonded and layered engineering and geological structures; thin-film and micro-electronic components and systems; dynamic fracture mechanics of homogeneous engineering materials; dynamic shear dominated failure of coherent and incoherent interfaces at all length scales; dynamic rupture of frictional interfaces with application to earthquake source mechanics; allowable rupture speeds regimes and connections to earthquake seismology and the generation of Tsunamis.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#static-and-dynamic-failure-of-brittle-solids-and-interfaces,-from-the-micro-to-the-mega",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 abc (concurrently) or equivalent and/or instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc"
        ]
    },
    "megeae-266-ab": {
        "id": "megeae-266-ab",
        "course_id": "ME/Ge/Ae 266 ab",
        "name": "Fracture and Frictional Faulting",
        "units": "9 units (3-0-6)",
        "terms": "second",
        "description": "Introduction to elastodynamics and waves in solids. Fracture theory, energy concepts, cohesive zone models. Friction laws, nucleation of frictional instabilities, rupture of frictional interfaces. Radiation from moving cracks. Thermal effects during dynamic fracture and faulting. Interaction of faulting with fluids. Applications to engineering phenomena a physics and mechanics of earthquakes.",
        "offered": true,
        "instructors": "Lapusta",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#fracture-and-frictional-faulting",
        "prereq_text": "Prerequisites: Ae/AM/CE/ME 102 a or Ae/Ge/ME 160 a or instructor's permission.",
        "prereqs": [
            "aeamceme-102-abc",
            "aegeme-160-ab"
        ]
    },
    "me-300": {
        "id": "me-300",
        "course_id": "ME 300",
        "name": "Research in Mechanical Engineering",
        "units": "Hours and units by arrangement",
        "terms": "",
        "description": "Research in the field of mechanical engineering. By arrangement with members of the faculty, properly qualified graduate students are directed in research.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/me/#research-in-mechanical-engineering",
        "prereq_text": "",
        "prereqs": []
    }
}