{
    "mu-52": {
        "id": "mu-52",
        "course_id": "Mu 52",
        "name": "Fundamentals of Western Music Theory",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Intended for students with no or limited musical training, this course is an introduction to the elements of Western music. We will practice reading, notating, and analyzing music through the study of rhythm and meter, scales, intervals, chords, and basic harmonic progressions; musical examples will be drawn from a variety historical periods and styles, including classical, pop, jazz, film, and musical theater. The final project will be a short musical composition. This can be a stand-alone course for students who want to understand how music is put together, or it can serve as preparation for those who might benefit from a review of the fundamentals before taking further courses in music theory.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/mu/#fundamentals-of-western-music-theory",
        "prereq_text": "",
        "prereqs": []
    },
    "mu-53": {
        "id": "mu-53",
        "course_id": "Mu 53",
        "name": "Listening to Music",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Most of the music we encounter can be thought of as the organization of a very limited set of tones into distinct patterns of repetition, and it has been this way for hundreds, if not thousands, of years. And yet, music has come to mean infinitely more than its sonic surface: we study great works of music like we do great works of literature and art; we use our musical preferences to convey our social and political identities; we expect - and technology has enabled - our public and private spaces to be saturated in music; and certain musical works possess such power that they are sometimes altered, if not banned outright. But how has music acquired all of these meanings? How does it communicate? What is it that we are listening to when we are listening to music? In addition to serving as an introduction to the academic study of music, this course aims to deepen our musical appreciation and understanding by critically examining listening habits of the past and present. Knowledge of Western music notation and harmony is helpful but not required; the basics will be reviewed as needed.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/mu/#listening-to-music",
        "prereq_text": "",
        "prereqs": []
    },
    "mu-55": {
        "id": "mu-55",
        "course_id": "Mu 55",
        "name": "The Great Orchestras: Their History, Conductors and Repertoire",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This survey course will trace the symphony orchestra from its origins in the mid eighteenth century to the present day. Special emphasis will be given to the great civic orchestras of the nineteenth and twentieth centuries, their conductors, and core orchestral repertoire. Making use of historic audio and video recordings from the twentieth century, along with more recent documentary recordings, students will be exposed to the cultural history of modern Europe and America through the medium of classical music.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/mu/#the-great-orchestras:-their-history,-conductors-and-repertoire",
        "prereq_text": "",
        "prereqs": []
    },
    "mu-56": {
        "id": "mu-56",
        "course_id": "Mu 56",
        "name": "Jazz History",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will examine the history of jazz in America from its roots in the unique confluence of racial and ethnic groups in New Orleans around 1900 to the present. The lives and music of major figures such as Robert Johnson, Jelly Roll Morton, Louis Armstrong, Benny Goodman, Duke Ellington, Count Basie, Charlie Parker, Dizzy Gillespie, Thelonius Monk, Miles Davis and others will be explored.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/mu/#jazz-history",
        "prereq_text": "",
        "prereqs": []
    },
    "mu-57": {
        "id": "mu-57",
        "course_id": "Mu 57",
        "name": "Fundamentals of Music Theory and Elementary Ear Training",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Basic vocabulary and concepts of music theory (rhythm and pitch notation, intervals, scales, function of key signatures, etc.); development of aural perception via elementary rhythmic and melodic dictation, and sight-singing exercises.",
        "offered": true,
        "instructors": "Ballance",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/mu/#fundamentals-of-music-theory-and-elementary-ear-training",
        "prereq_text": "",
        "prereqs": []
    },
    "mu-58": {
        "id": "mu-58",
        "course_id": "Mu 58",
        "name": "Harmony I",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Study of tonal harmony and intermediate music theory; techniques of chord progression, modulation, and melody writing according to common practice; ear training, continued.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/mu/#harmony-i",
        "prereq_text": "Prerequisites: Mu 57 or entrance exam.",
        "prereqs": []
    },
    "mu-59": {
        "id": "mu-59",
        "course_id": "Mu 59",
        "name": "Harmony II",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "More advanced concepts of music theory, including chromatic harmony, and 20th-century procedures relating to selected popular music styles; ear training, continued.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/mu/#harmony-ii",
        "prereq_text": "Prerequisites: Mu 58 or entrance exam.",
        "prereqs": []
    },
    "mu-137": {
        "id": "mu-137",
        "course_id": "Mu 137",
        "name": "Themes in Western Music History and Historiography: Pre-1600",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course surveys the music and musical institutions of Ancient Greece, the Middle Ages, and the Renaissance. Nearly two millennia of musical developments, needless to say, cannot be adequately covered in ten weeks; the course thus aims to build literacy in music from these periods by contextualizing musical works and their creators against broader themes, including music and the church, music and politics, music and gender, the evolution of musical notation, and the rise of secular music. At the same time, we will interrogate the central historical narratives of Western music that we have inherited and grapple with how historiography - the writing of history - shapes the way we understand the musical past and present.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/mu/#themes-in-western-music-history-and-historiography:-pre-1600",
        "prereq_text": "",
        "prereqs": []
    },
    "mu-138": {
        "id": "mu-138",
        "course_id": "Mu 138",
        "name": "Themes in Western Music History and Historiography: 1600-1800",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course surveys the music and musical institutions of Europe during the Baroque and Enlightenment eras. Two hundred years of musical developments, needless to say, cannot be adequately covered in ten weeks; the course thus aims to build literacy in music from these periods by contextualizing musical works and their creators against broader themes, including music in the European courts, music and religion, words and music, music and gender, music and Enlightenment ideals, and the rise of instrumental music. At the same time, we will interrogate the central historical narratives of Western music that we have inherited and grapple with how historiography - the writing of history - shapes the way we understand the musical past and present.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/mu/#themes-in-western-music-history-and-historiography:-1600-1800",
        "prereq_text": "",
        "prereqs": []
    },
    "mu-139": {
        "id": "mu-139",
        "course_id": "Mu 139",
        "name": "Themes in Western Music History and Historiography: 1800-Present",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course surveys the music and musical institutions of the so-called \"Western art music\" tradition from the Romantic era until the present. Over two hundred years of musical developments, needless to say, cannot be adequately covered in ten weeks; the course thus aims to build literacy in music of this period by contextualizing musical works and their creators against broader themes, including music and the nation, music as art and philosophy, music and appropriation, music and genre, and the musical canon. At the same time, we will interrogate the central historical narratives of Western music that we have inherited and grapple with how historiography - the writing of history - shapes the way we understand the musical past and present.",
        "offered": true,
        "instructors": "Ballance",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/mu/#themes-in-western-music-history-and-historiography:-1800-present",
        "prereq_text": "",
        "prereqs": []
    },
    "mu-150": {
        "id": "mu-150",
        "course_id": "Mu 150",
        "name": "Special Topics in Music",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "An advanced humanities course on a special topic in music. Topics may include specific genres of music, the music of particular eras or geographical regions, or the relationship between music and other aspects of culture. The course may be re-taken for credit except as noted in the course announcement. See registrar's announcement for details.",
        "offered": true,
        "instructors": "Lu",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/mu/#special-topics-in-music",
        "prereq_text": "",
        "prereqs": []
    }
}