{
    "sec-10": {
        "id": "sec-10",
        "course_id": "SEC 10",
        "name": "Technical Seminar Presentations",
        "units": "3 units (3-0-0)",
        "terms": "first, second, third terms",
        "description": "(Seniors required to take this course are given priority in registration.) The purpose of this course is to equip students with the skills, knowledge, and experience necessary to give effective oral presentations. The course will include a mix of formal instruction, group discussions, practice presentations, and individual feedback. Limited enrollment. May not be repeated for credit.",
        "offered": true,
        "instructors": "Gold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#technical-seminar-presentations",
        "prereq_text": "",
        "prereqs": []
    },
    "sec-11": {
        "id": "sec-11",
        "course_id": "SEC 11",
        "name": "Written Academic Communication in Engineering and Applied Science",
        "units": "3 units (1-0-2)",
        "terms": "terms to be arranged",
        "description": "This class provides the opportunity for students to gain experience in academic technical writing in engineering and applied science. Students will choose a technical topic of interest, possibly based on a previous research or course project, and write a paper in an academic genre on that topic. Appropriate genres include the engineering report, review paper, or a peer-reviewed journal paper. Students will receive instruction in academic discourse in engineering and applied sciences as well as substantial feedback on their work-in-progress. This course is recommended for students who plan to attend graduate school or who wish to work toward a senior thesis or academic publication. Fulfills the Institute scientific writing requirement. For Winter and Spring terms, seniors will be given priority; however this class is open to all students in EAS and GPS, and to students in other divisions as space allows.",
        "offered": true,
        "instructors": "Burkett, Meyer, George",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#written-academic-communication-in-engineering-and-applied-science",
        "prereq_text": "",
        "prereqs": []
    },
    "sec-12": {
        "id": "sec-12",
        "course_id": "SEC 12",
        "name": "Written Professional Communication in Engineering and Applied Science",
        "units": "3 units (1-0-2)",
        "terms": "Terms to be arranged",
        "description": "This class introduces students to common workplace genres of writing in professional (non-academic) fields in engineering and the applied sciences. Students will study and practice effective writing strategies within these genres and consider the varied audiences and goals of communicating in engineering and applied science industries. Genres covered may include job applications; performance reviews and recommendation letters; clean code and code documentation; technical reports; progress reports; proposals; or recommendation reports. This course is recommended for students who plan to seek jobs in industry. Fulfills the Institute scientific writing requirement. For Winter and Spring terms, seniors will be given priority; however this class is open to all students in EAS and GPS, and to students in other divisions as space allows.",
        "offered": true,
        "instructors": "Meyer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#written-professional-communication-in-engineering-and-applied-science",
        "prereq_text": "",
        "prereqs": []
    },
    "sec-13": {
        "id": "sec-13",
        "course_id": "SEC 13",
        "name": "Written Communication about Engineering and Applied Science to Non-Specialists",
        "units": "3 units (1-0-2)",
        "terms": "Terms to be arranged",
        "description": "Engineers and applied scientists often work on highly technical, specialized projects. However, their work is often of interest to readers with varied areas and levels of technical expertise, including investors, community stakeholders, government regulators, consumers, voters, students, and enthusiasts. This course introduces students to diverse types of writing about technical engineering and applied science topics intended for these \"non-specialist\" readers who lack some or all of the technical knowledge the author has. Students will compose multiple texts written for different purposes and to different types of audiences outside of their area of expertise. This course is recommended for students who may plan entrepreneurial, non-profit, or government careers, where communication to non-specialists is crucial to success. It may also interest students who enjoy public advocacy or creative writing about technical topics. Fulfills the Institute scientific writing requirement. For Winter and Spring terms, seniors will be given priority; however this class is open to all students in EAS and GPS, and to students in other divisions as space allows.",
        "offered": true,
        "instructors": "Burkett",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#written-communication-about-engineering-and-applied-science-to-non-specialists",
        "prereq_text": "",
        "prereqs": []
    },
    "sec-100": {
        "id": "sec-100",
        "course_id": "SEC 100",
        "name": "Special Topics in Scientific and Engineering Communication",
        "units": "",
        "terms": "terms to be arranged in consultation with the instructor",
        "description": "Content may vary from year to year, at a level suitable for advanced undergraduate or graduate students. Topics will be chosen to meet the emerging needs of students.",
        "offered": true,
        "instructors": "Gold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#special-topics-in-scientific-and-engineering-communication",
        "prereq_text": "",
        "prereqs": []
    },
    "esec-102": {
        "id": "esec-102",
        "course_id": "E/SEC 102",
        "name": "Scientific and Technology Entrepreneurship",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course introduces students to the conceptual frameworks, the analytical approaches, the personal understanding and skills, and the actions required to launch a successful technology-based company. Specifically, it addresses the challenges of evaluating new technologies and original business ideas for commercialization, determining how best to implement those ideas in a startup venture, attracting the resources needed for a new venture (e.g., key people, corporate partners, and funding), organizing and operating a new enterprise, structuring and negotiating important business relationships, and leading early stage companies toward \"launch velocity\".",
        "offered": true,
        "instructors": "Low",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#scientific-and-technology-entrepreneurship",
        "prereq_text": "",
        "prereqs": []
    },
    "esec-103": {
        "id": "esec-103",
        "course_id": "E/SEC 103",
        "name": "Management of Technology",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "A course intended for students interested in learning how rapidly evolving technologies are harnessed to produce useful products or fertile new area for research. Students will work through Harvard Business School case studies, supplemented by lectures to elucidate the key issues. There will be a term project where students predict the future evolution of an exciting technology. The course is team-based and designed for students considering choosing an exciting research area, working in companies (any size, including start-ups) or eventually going to business school. Topics include technology as a growth agent, financial fundamentals, integration into other business processes, product development pipeline and portfolio management, learning curves, risk assessment, technology trend methodologies (scenarios, projections), motivation, rewards and recognition. Industries considered will include electronics (hardware and software), aerospace, medical, biotech, etc. Students will perform both primary and secondary research and through analysis present defensible projections. E/SEC 102 and E/ME/MedE 105 are useful but not required precursors.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#management-of-technology",
        "prereq_text": "",
        "prereqs": []
    },
    "chechbisec-107": {
        "id": "chechbisec-107",
        "course_id": "ChE/Ch/Bi/SEC 107",
        "name": "Social Media for Scientists",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An introduction to the use of social media for scientific communication. Social media platforms are discussed in the context of their use to professionally engage scientific communities and general audiences. Topics will include ethics, privacy, reputation management, ownership and the law, and will focus on the use and impact of social media for personal and professional career development. Lectures will include presentations by invited experts in various specialties, a number of whom will have worldwide recognition.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#social-media-for-scientists",
        "prereq_text": "",
        "prereqs": []
    },
    "sec-110": {
        "id": "sec-110",
        "course_id": "SEC 110",
        "name": "Technical Seminar Presentations",
        "units": "3 units (3-0-0)",
        "terms": "terms to be arranged",
        "description": "The purpose of this graduate-level course is to equip students with the skills, knowledge, and experience necessary to give effective oral presentations. The course will include a mix of formal instruction, group discussions, practice presentations, and individual feedback.",
        "offered": true,
        "instructors": "Gold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#technical-seminar-presentations",
        "prereq_text": "",
        "prereqs": []
    },
    "sec-111": {
        "id": "sec-111",
        "course_id": "SEC 111",
        "name": "Effective Communication Strategies for Engineers and Scientists",
        "units": "6 units (3-0-3)",
        "terms": "third term",
        "description": "This graduate course is designed to increase students' effectiveness in communicating complex technical information to diverse audiences and to deepen their understanding of key tools and techniques. Students will explore scientific storytelling through multiple genres, including oral presentations, written articles, and visual narratives. In-class workshops will provide students with the opportunity to revise their work and consider feedback from others. Each student will complete the class with a portfolio of projects highlighting various aspects of their communication skills. (Registration by application only, and EAS graduate students are given priority.)",
        "offered": true,
        "instructors": "Gold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#effective-communication-strategies-for-engineers-and-scientists",
        "prereq_text": "",
        "prereqs": []
    },
    "sec-120": {
        "id": "sec-120",
        "course_id": "SEC 120",
        "name": "Data Visualization Projects",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "This course will provide students with a forum for discussing and working through challenges of visualizing students' data using techniques and principles from graphic design, user experience design, and visual practices in science and engineering. Working together, we will help create and edit students' graphics and other visual forms of data to improve understanding. We will consider the strengths and weaknesses of communicating information visually in drawing, design and diagramming forms such as flow charts, brainstorming maps, graphs, illustrations, movies, animation, as well as public presentation materials, depending on the needs of students' projects. Our approach will be derived from design principles outlined by Edward Tufte and others. The course is targeted towards students across disciplines using visual display and exploration in research. There is no pre-requisite, but students should be competent in acquiring and processing data.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#data-visualization-projects",
        "prereq_text": "",
        "prereqs": []
    },
    "sec-130": {
        "id": "sec-130",
        "course_id": "SEC 130",
        "name": "Science Activation: Bringing Science to Society",
        "units": "6 units (3-0-3)",
        "terms": "second term",
        "description": "Working with policy makers is more than science communication. It requires a bilateral approach to exploring complex problems and solutions that encompass societal objectives as well as physical requirements. An intellectual understanding of the differences communication norms in the research and policy realms can help scientists make better decisions about how to communicate about their work and engage with policy makers to get it used. This course combines analysis of the differences in communication norms with practical experience in communicating and developing relationships with elected officials and their staffs.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#science-activation:-bringing-science-to-society",
        "prereq_text": "",
        "prereqs": []
    },
    "sec-201": {
        "id": "sec-201",
        "course_id": "SEC 201",
        "name": "Advancing Inclusion in College Teaching",
        "units": "1 unit (1-0-0)",
        "terms": "second term",
        "description": "In this weekly, discussion-based course, participants will explore concrete practices to advance inclusion and anti-racism as college-level STEM instructors, and discuss how they might implement these steps in their own teaching practice both at Caltech and beyond. Topics for discussion include establishing an inclusive learning environment, designing equity into syllabi and student assessments, and building anti-racist curricular materials, with additional topics to be guided by participant interests. This course aims to bring together an active community of teaching and learning practitioners for ongoing work and dialogue. There is a cap of 12 students for this course.",
        "offered": true,
        "instructors": "Imamura",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/sec/#advancing-inclusion-in-college-teaching",
        "prereq_text": "",
        "prereqs": []
    }
}