{
    "wr-2": {
        "id": "wr-2",
        "course_id": "Wr 2",
        "name": "Introduction to Academic Writing",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course offers a focused introduction to the practices of reading, thinking, and writing that characterize academic writing. More specifically, the course teaches students how to articulate a position, situate writing within specific contexts, engage with the work of others, locate and provide convincing evidence, and understand the expectations of different types of academic readers. Students will take several writing projects through multiple stages of revision, improving their work with feedback from seminar discussions, workshops, and frequent one-to-one conferences with the instructor. Students are placed in Wr 2 based on a writing assessment that is required of all incoming students; successful completion of the course is required before taking first-year humanities courses. Enrolled students may be required to take Wr 3, 4, and/or 50 in subsequent quarters.",
        "offered": true,
        "instructors": "Hall, Schneiderman, Sherazi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/wr/#introduction-to-academic-writing",
        "prereq_text": "",
        "prereqs": []
    },
    "wr-3": {
        "id": "wr-3",
        "course_id": "Wr 3",
        "name": "Reading and Composing Academic Writing",
        "units": "9 units (1-0-8)",
        "terms": "second term",
        "description": "This course builds on Wr 1 or 2 for students who need additional instruction in both the core concepts and practices of academic writing before beginning their first-year humanities coursework. The course will focus on developing critical reading skills and composing successful academic essays. By taking several writing projects through multiple stages of revision, students will develop a deeper sense of their strengths and limitations as writers, and seminar discussions, workshops, and frequent one-to-one conferences with the instructor will equip students to address those limitations. Not available for credit toward the humanities-social science requirement. Enrolled students may be required to take Wr 4 and/or 50 in subsequent quarters.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/wr/#reading-and-composing-academic-writing",
        "prereq_text": "",
        "prereqs": []
    },
    "wr-4": {
        "id": "wr-4",
        "course_id": "Wr 4",
        "name": "Principles and Practices of Academic Writing",
        "units": "3 units (1-0-2)",
        "terms": "second term",
        "description": "This course follows Writing 2 and offers an opportunity for more focused study and discussion of core concepts in academic writing, such as audience, genre, argument, working with sources, and process. Weekly readings offer concrete guidance on these topics, and class discussions expand on that guidance, providing insights into common challenges college writers encounter. Not available for credit toward the humanities-social science requirement.",
        "offered": true,
        "instructors": "Hall",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/wr/#principles-and-practices-of-academic-writing",
        "prereq_text": "",
        "prereqs": []
    },
    "wr-50": {
        "id": "wr-50",
        "course_id": "Wr 50",
        "name": "Tutorial in Writing",
        "units": "1 unit",
        "terms": "first, second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Hall",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/wr/#tutorial-in-writing",
        "prereq_text": "",
        "prereqs": []
    },
    "enwr-83": {
        "id": "enwr-83",
        "course_id": "En/Wr 83",
        "name": "Personal Narrative and STEM Research",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Hall",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/wr/#personal-narrative-and-stem-research",
        "prereq_text": "",
        "prereqs": []
    },
    "enwr-84": {
        "id": "enwr-84",
        "course_id": "En/Wr 84",
        "name": "Communicating Science to Non-Experts",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course offers instruction in writing and speaking about science and technology for non-expert audiences. Instruction focuses on how to convey complex technical information in clear, engaging prose and speech in a variety of contexts. Readings in different genres (e.g., the newspaper discovery story, the op-ed, the personal narrative, the explainer talk) raise issues for discussion and serve as models for assignments in these genres. The workshop-style nature of this course relies on drafting and revision in response to peer and instructor feedback. Satisfies the Institute scientific writing requirement and the option oral communications requirement for humanities majors.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Hall",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/wr/#communicating-science-to-non-experts",
        "prereq_text": "",
        "prereqs": []
    },
    "eslwr-107": {
        "id": "eslwr-107",
        "course_id": "ESL/Wr 107",
        "name": "Fundamentals of Scientific Writing",
        "units": "6 units (3-0-3)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/wr/#fundamentals-of-scientific-writing",
        "prereq_text": "",
        "prereqs": []
    },
    "wr-109": {
        "id": "wr-109",
        "course_id": "Wr 109",
        "name": "Writing and Publishing Research Articles in STEM Fields",
        "units": "6 units (3-0-3)",
        "terms": "summer term",
        "description": "This course focuses on strategies for composing an academic journal article in a STEM field. The rhetorical purpose and form of each section of the journal article will be considered in depth. The course is intended for graduate students who are prepared to be a lead author on a manuscript. While the course will cover strategies for collaborative writing, students will be asked to draft sections of an original journal article based upon their own research. The course will also provide guidance for preparing a manuscript for submission and responding to feedback from peer reviewers. Clarity in scientific writing and creating effective figures will also be discussed. Course enrollment is limited to 15 students.",
        "offered": true,
        "instructors": "Burkett",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/wr/#writing-and-publishing-research-articles-in-stem-fields",
        "prereq_text": "",
        "prereqs": []
    }
}