{
    "bi-1": {
        "id": "bi-1",
        "course_id": "Bi 1",
        "name": "The Great Ideas of Biology",
        "units": "9 units (4-0-5)",
        "terms": "third term",
        "description": "Biological processes take place at length scales ranging from that of individual protein molecules all the way to the algal blooms or rainforests that can be seen from space and over a dizzying nearly 30 orders of magnitude in time scales.  This course will start by examining the biology of processes such as how plants and animals colonize oceanic islands and the physics of how animals such as wildebeest form giant herds during their year-long migration.  With these wonders of the living world revealed, we will then seek to understand biological phenomena by thinking about genes and cells. May be taken pass/fail if taken in a first-year student's first year.",
        "offered": true,
        "instructors": "Phillips",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/the-great-ideas-of-biology",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-1-b": {
        "id": "bi-1-b",
        "course_id": "Bi 1 b",
        "name": "The Biomechanics of Organismal Design",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Have you ever wondered how a penguin swims or why a maple seed spins to the ground? Can a flea jump as high as a kangaroo? Is spider silk really stronger than steel? This class will offer answers to these and other questions related to the mechanical design of plants and animals. The course will provide a basic introduction to how engineering principles from the fields of solid and fluid mechanics may be applied to the study of biological systems. The course emphasizes the organismal level of complexity, although topics will also connect phenomenology at the molecular, cellular, and tissue-level scales. Topics include the physical properties of biological materials, viscoelasticity, biological pumps, muscle mechanics, neural control, and animal locomotion. May be taken pass/fail if taken in the first-year student's first year. Limited enrollment.",
        "offered": true,
        "instructors": "Dickinson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/the-biomechanics-of-organismal-design",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-1-c": {
        "id": "bi-1-c",
        "course_id": "Bi 1 c",
        "name": "Biology Through the Algorithmic Lens",
        "units": "",
        "terms": "second term",
        "description": "Do biological systems compute? Can we compute with biological systems? Is computer code a meaningful metaphor for genetic code? Do neural networks in biology have much to do with neural networks in computer science? In this class we will investigate these and other questions with a view towards learning about deep connections between biology and computer science that shed light on fundamental questions in biology. May be taken pass/fail if taken in a first-year student's first year.",
        "offered": true,
        "instructors": "Pachter",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/biology-through-the-algorithmic-lens",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-1-e": {
        "id": "bi-1-e",
        "course_id": "Bi 1 e",
        "name": "Evolution of the Biosphere",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Parker, J",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/evolution-of-the-biosphere",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-1-g": {
        "id": "bi-1-g",
        "course_id": "Bi 1 g",
        "name": "Information Flow in Biology",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The storage, readout, and modification of information is core to biological systems. The properties of an organism are primarily encoded in its genome, and how this information (genotype) maps to the morphology, physiology and development of an organism (phenotype) is a major problem of modern biology with practical consequences for personalized medicine and biotechnology as well as conceptual consequences for understanding all of biology from development to evolution. Other core principles of biology will be presented in the context of understanding information flow. May be taken pass/fail if taken in a first-year student's first year. Limited enrollment.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Sternberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/information-flow-in-biology",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-1-i": {
        "id": "bi-1-i",
        "course_id": "Bi 1 i",
        "name": "Construction and Guidance of Biological Defense",
        "units": "9 units (4-0-5)",
        "terms": "second term",
        "description": "We are bombarded by biological threats from the outside, ranging from toxic particulates to epidemic viruses, and also by threats from within, like cancer. How do our bodies manage to be victorious against these threats for so many years, in most cases? Many people have some familiarity with aspects of the answers now, due to COVID-19. But how can these defense mechanisms actually work, and how can they coordinate their actions to be effective and safe? Why do they fail? This course will zoom between scales to introduce the cells that the body uses for immune defense and how they execute their roles, both system-wide and at the molecular level. A central theme will be how the system is controlled by cellular \"software\" reading the genetic code, by ultra-rapid evolutionary mechanisms, and by elegant cell-cell communication networks. Lectures and student presentations will be included. May be taken pass/fail if taken in a first-year student's first year. Limited enrollment.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Rothenberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/construction-and-guidance-of-biological-defense",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-1-m": {
        "id": "bi-1-m",
        "course_id": "Bi 1 m",
        "name": "Unifying Biology by Revealing the Foundational Principals of Life Systems",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Due to the development of new technologies in the 21st century, experimental and computational tools, such as the sequencing of nucleic acids, have become faster and more inexpensive. These new tools have allowed the biological sciences to use genetics and genomics to reveal the functional relationships of life forms across the biosphere as never before. The largest conceptual shift enabled by this new capacity is the discovery of the unexpected complexity of the invisible world of microbes. We have learned that their diversity dwarfs that of animals and plants, and that they underlie the health of all corners of the biosphere and its inhabitants. In addition, genomic analyses of microbes have revealed that they 'invented' almost every fundamental feature of biological systems, and that macroorganisms have primarily added nuances as they build upon these essential foundations. This course aims to provide students with a comprehensive view of the structure and function of the biosphere, from its evolutionary history to its molecular underpinnings and emergent ecological patterns. The integration of micro- and macrobiology in an introductory biology course will allow students to both focus on the fundamental principles driving life and to build a comprehensive conceptual framework for understanding biology, much as chemistry and physics did in the 20th century as they developed a long-lasting framework for their introductory courses.",
        "offered": true,
        "instructors": "McFall-Ngai, Ruby",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/unifying-biology-by-revealing-the-foundational-principals-of-life-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-1-x": {
        "id": "bi-1-x",
        "course_id": "Bi 1 x",
        "name": "The Great Ideas of Biology: Exploration through Experimentation",
        "units": "9 units (0-6-3)",
        "terms": "first, third terms",
        "description": "",
        "offered": true,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/the-great-ideas-of-biology:-exploration-through-experimentation",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-2": {
        "id": "bi-2",
        "course_id": "Bi 2",
        "name": "Current Research in Biology",
        "units": "1 unit (1-0-0)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Elowitz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/current-research-in-biology",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-8": {
        "id": "bi-8",
        "course_id": "Bi 8",
        "name": "Foundational Principles of Molecular Biology",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course and its sequel, Bi 9, cover biology at the molecular and cellular levels. Bi 8 emphasizes genomic structure and the mechanisms responsible for the transmission and expression of genetic information. The focus is on the ways that the information content of the genome is translated into distinctive, cell-type specific patterns of gene expression and protein function. Assignments will include critical dissections of papers from classical and current research literature and problem sets.",
        "offered": true,
        "instructors": "Guttman, Hong",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/foundational-principles-of-molecular-biology",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-9": {
        "id": "bi-9",
        "course_id": "Bi 9",
        "name": "Cell Biology",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Continues coverage of biology at the cellular level, begun in Bi 8. Topics: cytoplasmic structure, membrane structure and function, cell motility, and cell-cell recognition. Emphasis on both the ultrastructural and biochemical approaches to these topics.",
        "offered": true,
        "instructors": "Prober, Varshavsky",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/cell-biology",
        "prereq_text": "Prerequisites: Bi 8.",
        "prereqs": []
    },
    "bi-10": {
        "id": "bi-10",
        "course_id": "Bi 10",
        "name": "Introductory Biology Laboratory",
        "units": "6 units (1-3-2)",
        "terms": "third term",
        "description": "An introduction to molecular, cellular, and biochemical techniques that are commonly used in studies of biological systems at the molecular level.",
        "offered": true,
        "instructors": "Goentoro",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/introductory-biology-laboratory",
        "prereq_text": "Prerequisites: Bi 8; designed to be taken concurrently with Bi 9.",
        "prereqs": []
    },
    "bi-21": {
        "id": "bi-21",
        "course_id": "Bi 21",
        "name": "Undergraduate Research with Presentation",
        "units": "Minimum 12 units per term (0-11-1)",
        "terms": "first, second, third terms",
        "description": "Special problems involving laboratory research in biology; to be arranged with instructors before registration. Must give a public presentation reporting results of work. May be counted as advanced lab credit. May be repeated for credit.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/undergraduate-research-with-presentation",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-22": {
        "id": "bi-22",
        "course_id": "Bi 22",
        "name": "Undergraduate Research",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Special problems involving laboratory research in biology; to be arranged with instructors before registration. Graded pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/undergraduate-research",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-23": {
        "id": "bi-23",
        "course_id": "Bi 23",
        "name": "Biology Tutorials",
        "units": "3 or 6 units",
        "terms": "second term",
        "description": "Small group study and discussion in depth of special areas or problems in biology or biological engineering, involving regular tutorial sections with instructors drawn from the divisional postdoctoral staff and others. Usually given winter term. To be arranged with instructors before registration. Graded pass/fail.",
        "offered": true,
        "instructors": "Prober",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/biology-tutorials",
        "prereq_text": "",
        "prereqs": []
    },
    "bibe-24": {
        "id": "bibe-24",
        "course_id": "Bi/BE 24",
        "name": "Scientific Communication for Biological Scientists and Engineers",
        "units": "6 units (3-0-3)",
        "terms": "second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Hoy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/scientific-communication-for-biological-scientists-and-engineers",
        "prereq_text": "",
        "prereqs": []
    },
    "bebi-25": {
        "id": "bebi-25",
        "course_id": "BE/Bi 25",
        "name": "Biophysical Chemistry",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course develops principles of solution thermodynamics, chemical kinetics, and transport processes applied to living systems.",
        "offered": true,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/biophysical-chemistry",
        "prereq_text": "Prerequisites: Ch 1 ab, Ma 2.",
        "prereqs": [
            "ma-2102"
        ]
    },
    "bi-90-abc": {
        "id": "bi-90-abc",
        "course_id": "Bi 90 abc",
        "name": "Undergraduate Thesis",
        "units": "12 or more units per term",
        "terms": "first, second, third terms",
        "description": "Intended to extend opportunities for research provided by Bi 22 into a coherent individual research project, carried out under the supervision of a member of the biology faculty. Normally involves three or more consecutive terms of work in the junior and senior years. The student will formulate a research problem based in part on work already carried out, evaluate previously published work in the field, and present new results in a thesis format. First two terms graded pass/fail; final term graded by letter on the basis of the completed thesis.",
        "offered": true,
        "instructors": "Kennedy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/undergraduate-thesis",
        "prereq_text": "Prerequisites: 18 units of Bi 22 (or equivalent research experience) in the research area proposed for the thesis, and instructor's permission.",
        "prereqs": []
    },
    "cnspsybi-102-a": {
        "id": "cnspsybi-102-a",
        "course_id": "CNS/Psy/Bi 102 a",
        "name": "Social and Decision Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Introduction to the computations made by the brain during economic and social decision making and their neural substrates. Part a: Introduction to social and decision neuroscience. Neural substrates of reward and reinforcement learning. Unconscious and conscious processing. The neural basis of emotion. Goal-directed and habit learning. The neural substrates of facial processing.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/social-and-decision-neuroscience",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 and CNS/Bi/Ph/CS/NB 187, or instructor's permission.",
        "prereqs": []
    },
    "cnspsybi-102-b": {
        "id": "cnspsybi-102-b",
        "course_id": "CNS/Psy/Bi 102 b",
        "name": "Social and Decision Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Introduction to the computations made by the brain during economic and social decision making and their neural substrates. Part b: History and mechanisms of reinforcement. Memory and valuation. Neural repurposing. Mentalizing and strategic thinking. Neural bases of prosociality, risky choice and delay discounting. Mathematical economic-style theories of neural circuits.",
        "offered": true,
        "instructors": "Camerer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/social-and-decision-neuroscience",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 and CNS/Bi/Ph/CS/NB 187, or instructor's permission.",
        "prereqs": []
    },
    "bebi-103-a": {
        "id": "bebi-103-a",
        "course_id": "BE/Bi 103 a",
        "name": "Introduction to Data Analysis in the Biological Sciences",
        "units": "9 units (1-3-5)",
        "terms": "first term",
        "description": "This course covers tools needed to analyze quantitative data in biological systems. Students learn basic programming topics, data organization and wrangling, data display and presentation, parameter estimation, and resampling-based statistical inference. Students analyze real data in class and in homework.",
        "offered": true,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/introduction-to-data-analysis-in-the-biological-sciences",
        "prereq_text": "Prerequisites: Bi 1 or equivalent; CS 1, BE/Bi/NB 203, or equivalent; or instructor's permission.",
        "prereqs": [
            "cs-1-x",
            "cs-1"
        ]
    },
    "bebi-103-b": {
        "id": "bebi-103-b",
        "course_id": "BE/Bi 103 b",
        "name": "Statistical Inference in the Biological Sciences",
        "units": "9 units (1-3-5)",
        "terms": "second term",
        "description": "This course introduces students to statistical modeling and inference, primarily taking a Bayesian approach. Topics include generative modeling, parameter estimation, model comparison, hierarchical modeling, Markov chain Monte Carlo, graphical display of inference results, and principled workflows. Other topics may also be included. All techniques are applied to real biological data sets in class and in homework.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/statistical-inference-in-the-biological-sciences",
        "prereq_text": "Prerequisites: BE/Bi 103 a or equivalent; Ma 1 abc and Ma 3, or Bi/CNS/NB 195, or equivalent; or instructor's permission.",
        "prereqs": [
            "ma-1-d",
            "ma-1-abc",
            "ma-3103"
        ]
    },
    "bigeese-105": {
        "id": "bigeese-105",
        "course_id": "Bi/Ge/ESE 105",
        "name": "Evolution",
        "units": "12 units (3-4-5)",
        "terms": "second term",
        "description": "The theory of evolution is arguably biology’s greatest idea and serves as the overarching framework for thinking about the diversity and relationships between organisms. This course will present a broad picture of evolution starting with discussions of the insights of the great naturalists, the study of the genetic basis of variation, and an introduction to the key driving forces of evolution. Following these foundations, we will then focus on a number of case studies including the following: evolution of oxygenic photosynthesis, origin of eukaryotes, multicellularity, influence of symbiosis, the emergence of life from the water (i.e. fins to limbs), the return of life to the water (i.e. limbs to fins), diversity following major extinction events, the discovery of Archaea, insights into evolution that have emerged from sequence analysis, and finally human evolution and the impact of humans on evolution (including examples such as antibiotic resistance). A specific focus for considering these issues will be the island biogeography of the Galapagos.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Phillips, Orphan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/evolution",
        "prereq_text": "Prerequisites: Completion of Core Curriculum Courses. Maximum enrollment: 15, by application only.",
        "prereqs": []
    },
    "chechbisec-107": {
        "id": "chechbisec-107",
        "course_id": "ChE/Ch/Bi/SEC 107",
        "name": "Social Media for Scientists",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An introduction to the use of social media for scientific communication. Social media platforms are discussed in the context of their use to professionally engage scientific communities and general audiences. Topics will include ethics, privacy, reputation management, ownership and the law, and will focus on the use and impact of social media for personal and professional career development. Lectures will include presentations by invited experts in various specialties, a number of whom will have worldwide recognition.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/social-media-for-scientists",
        "prereq_text": "",
        "prereqs": []
    },
    "chbi-110-ab": {
        "id": "chbi-110-ab",
        "course_id": "Ch/Bi 110 ab",
        "name": "Introduction to Biochemistry",
        "units": "12 units (4-0-8)",
        "terms": "first, second terms",
        "description": "Lectures and recitation introducing the molecular basis of life processes. In the first term, topics will include the structure and chemical properties of biological macromolecules, molecular biology methods, and biological catalysis. The second term will cover an overview of metabolism and the biochemistry behind the transmission of genetic information.",
        "offered": true,
        "instructors": "Virgil (a), Rees (b)",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/introduction-to-biochemistry",
        "prereq_text": "Prerequisites: Ch 41 abc or instructor's permission.",
        "prereqs": []
    },
    "chbi-111": {
        "id": "chbi-111",
        "course_id": "Ch/Bi 111",
        "name": "Biochemistry of Gene Expression",
        "units": "12 units (4-0-8)",
        "terms": "first term",
        "description": "Lectures and recitation on the molecular basis of biological structure and function. Emphasizes the storage, transmission, and expression of genetic information in cells. Specific topics include DNA replication, recombination, repair and mutagenesis, transcription, RNA processing, and chromatin structure.",
        "offered": true,
        "instructors": "Parker, Semlow",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/biochemistry-of-gene-expression",
        "prereq_text": "Prerequisites: Ch/Bi 110 ab; Bi 8 and Bi 122 recommended.",
        "prereqs": []
    },
    "bi-114": {
        "id": "bi-114",
        "course_id": "Bi 114",
        "name": "Immunology",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The course will cover the molecular and cellular mechanisms that mediate recognition and response in the mammalian immune system. Topics include cellular and humoral immunity, the structural basis of immune recognition, antigen presentation and processing, gene rearrangement of lymphocyte receptors, cytokines and the regulation of cellular responses, T and B cell development, and mechanisms of tolerance. The course will present an integrated view of how the immune system interacts with viral and bacterial pathogens and commensal bacteria.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Bjorkman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/immunology",
        "prereq_text": "Prerequisites: Bi 8, Bi 9, Bi 122 or equivalent, and Ch/Bi 110 recommended.",
        "prereqs": []
    },
    "bibebmb-115": {
        "id": "bibebmb-115",
        "course_id": "Bi/BE/BMB 115",
        "name": "Viruses and Applications to Biological Systems",
        "units": "9 units (3-2-4)",
        "terms": "third term",
        "description": "Learn about viruses as fascinating biological machines, focusing on naturally-occurring and evolved variants, in silico viral vector engineering, and computational methods that include structure visualization and machine learning. This course will introduce the fundamentals in the chemistry and biology of viruses, emphasizing their engineerable properties for use in basic research and translational applications. Topics include: viruses by the numbers, mammalian and non-mammalian (plant, bacteria) viruses, enveloped vs. non-enveloped viruses, host-virus interactions, viral life cycles (replication vs. dormancy), immune responses to viruses, zoonosis, diverse mechanisms of entry and replication, the application of viruses as gene-delivery vehicles (with a focus on adeno-associated viruses or AAVs, lentiviruses, and rabies), and how to engineer viral properties for applications in basic research and gene therapy. The lectures will be complemented by short lab exercises in AAV preparation, bioinformatics and machine learning, and structure visualization.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Bjorkman, Gradinaru, Van Valen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/viruses-and-applications-to-biological-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-116": {
        "id": "bi-116",
        "course_id": "Bi 116",
        "name": "Microbial Genetics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A course on microbial genetics, emphasizing the history of the discipline as well as modern approaches. Students will be exposed to different ways of manipulating microbial genomes (primarily bacterial, but we will also cover archaea and microbial eukaryotes). The power of microbial genetics to shed light on diverse process will be discussed in a variety of contexts, ranging from environmental science to the mammalian microbiome.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Mazmanian, Newman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/microbial-genetics",
        "prereq_text": "Prerequisites: Bi 1, 8, 9 (or equivalent), and ESE/Bi 166.",
        "prereqs": []
    },
    "bi-117": {
        "id": "bi-117",
        "course_id": "Bi 117",
        "name": "Developmental Biology",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A survey of the development of multicellular organisms. Topics will include the beginning of a new organism (fertilization), the creation of multicellularity (cellularization, cleavage), reorganization into germ layers (gastrulation), induction of the nervous system (neurulation), and creation of specific organs (organogenesis). Emphasis will be placed on the molecular mechanisms underlying morphogenetic movements, differentiation, and interactions during development, covering both classical and modern approaches to studying these processes.",
        "offered": true,
        "instructors": "Bronner, Zernicka-Goetz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/developmental-biology",
        "prereq_text": "Prerequisites: Bi 8 and Bi 9.",
        "prereqs": []
    },
    "bibe-119": {
        "id": "bibe-119",
        "course_id": "Bi/BE 119",
        "name": "Morphogenesis of Developmental Systems",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Stathopoulos",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/morphogenesis-of-developmental-systems",
        "prereq_text": "Prerequisites: Bi 8 and Bi 9, or instructor's permission.",
        "prereqs": []
    },
    "bi-122": {
        "id": "bi-122",
        "course_id": "Bi 122",
        "name": "Genetics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Lecture and discussion course covering basic principles of genetics. Not open to first-year undergraduate students.",
        "offered": true,
        "instructors": "Hay",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/genetics",
        "prereq_text": "Prerequisites: Bi 8 or Bi 9, or instructor's permission.",
        "prereqs": []
    },
    "bibe-129": {
        "id": "bibe-129",
        "course_id": "Bi/BE 129",
        "name": "The Biology and Treatment of Cancer",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Zinn, Campbell",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/the-biology-and-treatment-of-cancer",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-145-a": {
        "id": "bi-145-a",
        "course_id": "Bi 145 a",
        "name": "Tissue and Organ Physiology",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Reviews of anatomy and histology, as well as in-depth discussion of cellular physiology. Building from cell function to tissues, the course explores human physiology in an organ-based fashion. First term topics include endocrine physiology, the autonomic nervous system, urinary physiology, and the cardiovascular system. Particular emphasis is placed on health issues and pharmaceutical therapy from both a research and a medical perspective.",
        "offered": true,
        "instructors": "Tydell",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/tissue-and-organ-physiology",
        "prereq_text": "Prerequisites: Bi 8, 9, Ch/Bi 110. Ch/Bi 110 may be taken concurrently.",
        "prereqs": []
    },
    "bi-145-b": {
        "id": "bi-145-b",
        "course_id": "Bi 145 b",
        "name": "Tissue and Organ Physiology",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Building on the foundations of Bi 145 a, Bi 145 b will continue the exploration of human physiology incorporating anatomy and cellular physiology. Topics include muscle physiology, the skeletal system, digestive and hepatic physiology, nutrition, the respiratory system and reproductive physiology. Particular emphasis is placed on health issues and pharmaceutical therapy from both a research and a medical perspective.",
        "offered": true,
        "instructors": "Tydell",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/tissue-and-organ-physiology",
        "prereq_text": "Prerequisites: Bi 145 a.",
        "prereqs": []
    },
    "gebibecnsese-147": {
        "id": "gebibecnsese-147",
        "course_id": "Ge/Bi/BE/CNS/ESE 147",
        "name": "Challenges and Opportunities in Quantitative Ecology",
        "units": "6 units (6-0-0)",
        "terms": "third term",
        "description": "Ecosystems are defined by dynamical interactions between groups of organisms, the communities they constitute, and the physical and chemical conditions and processes occurring in the environment. These dynamics are complex and multiscale across both length and time. This course will explore quantitative approaches that observe, measure, model, and monitor ecosystems and the services that they provide society-and the emerging opportunities that could employ these approaches to improve and strengthen global sustainability when it comes to our own ecology. This course will feature lectures each week from different members of the Caltech faculty working on ecological problems from different angles in order to illustrate how fresh insights can emerge by drawing on diverse ways-of-knowing.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Fischer, Tejada",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/challenges-and-opportunities-in-quantitative-ecology",
        "prereq_text": "",
        "prereqs": []
    },
    "nbbicns-150": {
        "id": "nbbicns-150",
        "course_id": "NB/Bi/CNS 150",
        "name": "Introduction to Neuroscience",
        "units": "10 units (4-0-6)",
        "terms": "third term",
        "description": "General principles of the function and organization of nervous systems, providing both an overview of the subject and a foundation for advanced courses. Topics include the physical and chemical bases for action potentials, synaptic transmission, and sensory transduction; anatomy; development; sensory and motor pathways; memory and learning at the molecular, cellular, and systems level; and the neuroscience of brain diseases. Letter grades only.",
        "offered": true,
        "instructors": "Lester, Lois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/introduction-to-neuroscience",
        "prereq_text": "Prerequisites: Bi 8, 9, or instructor's permission.",
        "prereqs": []
    },
    "nbbicns-152": {
        "id": "nbbicns-152",
        "course_id": "NB/Bi/CNS 152",
        "name": "Neural Circuits and Physiology of Homeostatic Regulation",
        "units": "6 units (2-0-4)",
        "terms": "Second Term",
        "description": "An advanced course of lectures, readings, and student presentations focusing on neural basis of innate body functions such as appetite, sleep, temperature, and osmolality regulation. This course will also cover the gut-to-brain interactions focusing on homeostatic functions. These include genetics, neural manipulation, and viral tracing tools with particular emphasis on data interpretation and limitation of available neuroscience tools.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Oka",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/neural-circuits-and-physiology-of-homeostatic-regulation",
        "prereq_text": "Prerequisites: Graduate standing or NB/Bi/CNS 150, or equivalent.",
        "prereqs": []
    },
    "nbbicns-154": {
        "id": "nbbicns-154",
        "course_id": "NB/Bi/CNS 154",
        "name": "Principles of Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "Third term",
        "description": "This course aims to distill the fundamental tenets of brain science, unlike the voluminous textbook with a similar title. What are the essential facts and ways of understanding in this discipline? How does neuroscience connect to other parts of life science, physics, and mathematics? Lectures and guided reading will touch on a broad range of phenomena from evolution, development, biophysics, computation, behavior, and psychology. Students will benefit from prior exposure to at least some of these domains.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Meister",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/principles-of-neuroscience",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or equivalent.",
        "prereqs": []
    },
    "nbbibe-155": {
        "id": "nbbibe-155",
        "course_id": "NB/Bi/BE 155",
        "name": "Neuropharmacology",
        "units": "6 units (3-0-3)",
        "terms": "Second term",
        "description": "The neuroscience of drugs for therapy, for prevention, and for recreation. Students learn the prospects for new generations of medications in neurology, psychiatry, aging, and treatment of substance abuse. Topics: Types of drug molecules, Drug receptors, Electrophysiology, Drugs activate ion channels, Drugs block ion channels, Drugs activate and block G protein pathways, Drugs block neurotransmitter transporters, Pharmacokinetics, Recreational drugs, Nicotine Addiction, Opiate Addiction, Drugs for neurodegenerative diseases: Alzheimer's disease, Parkinson's disease, Drugs for epilepsy and migraine, and Psychiatric diseases: Nosology and drugs. The course is taught at the research level.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Lester",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/neuropharmacology",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150.",
        "prereqs": []
    },
    "nbbicns-157": {
        "id": "nbbicns-157",
        "course_id": "NB/Bi/CNS 157",
        "name": "Comparative Nervous Systems",
        "units": "9 units (2-3-4)",
        "terms": "third term",
        "description": "An introduction to the comparative study of the gross and microscopic structure of nervous systems. Emphasis on the vertebrate nervous system; also, the highly developed central nervous systems found in arthropods and cephalopods. Variation in nervous system structure with function and with behavioral and ecological specializations and the evolution of the vertebrate brain. Letter grades only.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Allman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/comparative-nervous-systems",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "bicns-158": {
        "id": "bicns-158",
        "course_id": "Bi/CNS 158",
        "name": "Vertebrate Evolution",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "An integrative approach to the study of vertebrate evolution combining comparative anatomical, behavioral, embryological, genetic, paleontological, and physiological findings. Special emphasis will be given to: (1) the modification of developmental programs in evolution; (2) homeostatic systems for temperature regulation; (3) changes in the life cycle governing longevity and death; (4) the evolution of brain and behavior. Letter grades only.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Allman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/vertebrate-evolution",
        "prereq_text": "Prerequisites: Bi 1, Bi 8, or instructor's permission.",
        "prereqs": []
    },
    "bi-160": {
        "id": "bi-160",
        "course_id": "Bi 160",
        "name": "Molecular Basis of Animal Evolution",
        "units": "9 units (3-3-3)",
        "terms": "third term",
        "description": "We share the planet with well over 1.5 million other animal species. This course covers how the staggering diversity of the animal kingdom came about through underlying molecular evolutionary phenomena, including gene and protein sequence evolution, gene family and genome evolution, the evolution of developmental processes, neural circuit evolution and behavior, and molecular mechanisms that physiologically adapt animals to their environment. Molecular processes involved in speciation will be explained, together with an analysis of constraints and catalysts on the production of selectable variation that have shaped the evolution of animal life. Participants will undertake a laboratory project on evolutionary genomics, involving fieldwork, genome sequencing and comparative genome analysis. The course focuses on the >99.9% of animals that lack backbones.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Parker",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/molecular-basis-of-animal-evolution",
        "prereq_text": "Prerequisites: Bi 8 and/or Bi 9 recommended.",
        "prereqs": []
    },
    "bebiaph-161": {
        "id": "bebiaph-161",
        "course_id": "BE/Bi/APh 161",
        "name": "Physical Biology of the Cell",
        "units": "12 units (3-0-9)",
        "terms": "second term",
        "description": "Physical models applied to the analysis of biological structures ranging from individual proteins and DNA to entire cells. Typical topics include the force response of proteins and DNA, models of molecular motors, DNA packing in viruses and eukaryotes, mechanics of membranes, and membrane proteins and cell motility.",
        "offered": true,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/physical-biology-of-the-cell",
        "prereq_text": "Prerequisites: Ph 2 ab and ACM 95/100 ab,or background in differential equations and statistical and quantum mechanics, or instructor's written permission..",
        "prereqs": [
            "ph-2-abc",
            "acm-95100-ab"
        ]
    },
    "nbbicns-162": {
        "id": "nbbicns-162",
        "course_id": "NB/Bi/CNS 162",
        "name": "Cellular and Systems Neuroscience Laboratory",
        "units": "12 units (2-4-6)",
        "terms": "First Term",
        "description": "A laboratory-based introduction to experimental methods used for electrophysiological studies of the central nervous system. Through the term, students investigate the physiological response properties of neurons in vertebrate and invertebrate brains, using extra- and intracellular recording techniques. Students are instructed in all aspects of experimental procedures, including proper surgical techniques, electrode fabrication, and data analysis. The class also includes a brain dissection and independent student projects that utilize modern digital neuroscience resources.",
        "offered": true,
        "instructors": "Oka, Wagenaar",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/cellular-and-systems-neuroscience-laboratory",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or instructor's permission.",
        "prereqs": []
    },
    "nbbicns-163": {
        "id": "nbbicns-163",
        "course_id": "NB/Bi/CNS 163",
        "name": "The Biological Basis of Neural Disorders",
        "units": "6 units (3-0-3)",
        "terms": "second term",
        "description": "The neuroscience of psychiatric, neurological, and neurodegenerative disorders and of substance abuse, in humans and in animal models. Students master the biological principles including genetics, cell biology, biochemistry, physiology, and circuits. Topics are taught at the research level and include classical and emerging therapeutic approaches and diagnostic strategies.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Lester, Lois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/the-biological-basis-of-neural-disorders",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or instructor's permission.",
        "prereqs": []
    },
    "nbbicns-164": {
        "id": "nbbicns-164",
        "course_id": "NB/Bi/CNS 164",
        "name": "Tools of Neurobiology",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Offers a broad survey of methods and approaches to understanding in modern neurobiology. The focus is on understanding the tools of the discipline, and their use will be illustrated with current research results. Topics include: molecular genetics, disease models, transgenic and knock-in technology, virus tools, tracing methods, gene profiling, light and electron microscopy, optogenetics, optical and electrical recording, neural coding, quantitative behavior, modeling and theory.",
        "offered": true,
        "instructors": "Meister",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/tools-of-neurobiology",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or equivalent.",
        "prereqs": []
    },
    "esebi-166": {
        "id": "esebi-166",
        "course_id": "ESE/Bi 166",
        "name": "Microbial Physiology",
        "units": "9 units (3-1-5)",
        "terms": "first term",
        "description": "A course on growth and functions in the prokaryotic cell. Topics covered: growth, transport of small molecules, protein excretion, membrane bioenergetics, energy metabolism, motility, chemotaxis, global regulators, and metabolic integration.",
        "offered": true,
        "instructors": "Leadbetter",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/microbial-physiology",
        "prereq_text": "Prerequisites: one year of general biology recommended.",
        "prereqs": []
    },
    "plcnsnbbipsy-167": {
        "id": "plcnsnbbipsy-167",
        "course_id": "Pl/CNS/NB/Bi/Psy 167",
        "name": "Consciousness",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "One of the last great challenges to our understanding of the world concerns conscious experience. What exactly is it? How is it caused or constituted? And how does it connect with the rest of our science? This course will cover philosophy of mind, cognitive psychology, and cognitive neuroscience in a mixture of lectures and in-class discussion. There are no formal pre-requisites, but background in philosophy (equivalent to Pl 41, Pl 110) and in neuroscience (equivalent to NB/Bi/CNS 150) is strongly recommended and students with such background will be preferentially considered. Limited to 20.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/consciousness",
        "prereq_text": "Prerequisites: None, but strongly suggest prior background in philosophy of mind and basic neurobiology (such as Bi 150).",
        "prereqs": []
    },
    "esebi-168": {
        "id": "esebi-168",
        "course_id": "ESE/Bi 168",
        "name": "Microbial Metabolic Diversity",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A course on the metabolic diversity of microorganisms. Basic thermodynamic principles governing energy conservation will be discussed, with emphasis placed on photosynthesis and respiration. Students will be exposed to genetic, genomic, and biochemical techniques that can be used to elucidate the mechanisms of cellular electron transfer underlying these metabolisms.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Newman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/microbial-metabolic-diversity",
        "prereq_text": "Prerequisites: ESE 142, ESE/Bi 166.",
        "prereqs": []
    },
    "bmbbich-170": {
        "id": "bmbbich-170",
        "course_id": "BMB/Bi/Ch 170",
        "name": "Biochemistry and Biophysics of Macromolecules and Molecular Assemblies",
        "units": "9 units (3- 0-6)",
        "terms": "",
        "description": "Detailed analysis of the structures of the four classes of biological molecules and the forces that shape them. Introduction to molecular biological and visualization techniques.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/biochemistry-and-biophysics-of-macromolecules-and-molecular-assemblies",
        "prereq_text": "Prerequisites: Ch/Bi 110.",
        "prereqs": []
    },
    "bmbbich-173": {
        "id": "bmbbich-173",
        "course_id": "BMB/Bi/Ch 173",
        "name": "Biophysical/Structural Methods",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Chen, Chong",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/biophysical/structural-methods",
        "prereq_text": "",
        "prereqs": []
    },
    "bmbbich-174": {
        "id": "bmbbich-174",
        "course_id": "BMB/Bi/Ch 174",
        "name": "Advanced Topics in Biochemistry and Molecular Biophysics",
        "units": "6 units (3-0-3)",
        "terms": "",
        "description": "Discussion of research fields in biochemistry and molecular biophysics at Caltech. Development of skills in literature analysis and information synthesis.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/advanced-topics-in-biochemistry-and-molecular-biophysics",
        "prereq_text": "Prerequisites: Ch/Bi 110 or equivalent.",
        "prereqs": []
    },
    "cnsbipsynb-176": {
        "id": "cnsbipsynb-176",
        "course_id": "CNS/Bi/Psy/NB 176",
        "name": "Cognition",
        "units": "9 units (4-0-5)",
        "terms": "Third term",
        "description": "The cornerstone of current progress in understanding the mind, the brain, and the relationship between the two is the study of human and animal cognition. This course will provide an in-depth survey and analysis of behavioral observations, theoretical accounts, computational models, patient data, electrophysiological studies, and brain-imaging results on mental capacities such as attention, memory, emotion, object representation, language, and cognitive development.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Shimojo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/cognition",
        "prereq_text": "",
        "prereqs": []
    },
    "bibe-177": {
        "id": "bibe-177",
        "course_id": "Bi/BE 177",
        "name": "Principles of Modern Microscopy",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Lectures and discussions on the underlying principles behind digital, video, differential interference contrast, phase contrast, confocal, and two-photon microscopy. The course will begin with basic geometric optics and characteristics of lenses and microscopes. Specific attention will be given to how different imaging elements such as filters, detectors, and objective lenses contribute to the final image. Course work will include critical evaluation of published images and design strategies for simple optical systems and the analysis and presentation of two- and three-dimensional images. The role of light microscopy in the history of science will be an underlying theme. No prior knowledge of microscopy will be assumed.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Collazo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/principles-of-modern-microscopy",
        "prereq_text": "",
        "prereqs": []
    },
    "geesebi-178": {
        "id": "geesebi-178",
        "course_id": "Ge/ESE/Bi 178",
        "name": "Microbial Ecology",
        "units": "9 units (3-2-4)",
        "terms": "second term",
        "description": "Structural, phylogenetic, and metabolic diversity of microorganisms in nature. The course explores microbial interactions, relationships between diversity and physiology in modern and ancient environments, and influence of microbial community structure on biogeochemical cycles. Introduction to ecological principles and molecular approaches used in microbial ecology and geobiological investigations.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Orphan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/microbial-ecology",
        "prereq_text": "Prerequisites: either ESE/Bi 166 or ESE/Bi 168 recommended.",
        "prereqs": []
    },
    "bi-180": {
        "id": "bi-180",
        "course_id": "Bi 180",
        "name": "Plant and Soil Science",
        "units": "9 units (2-2-5)",
        "terms": "first term",
        "description": "Plants comprise most of the mass of living things on land, serve as the ultimate source of almost all human food and energy, and are a dominating force in the carbon and oxygen cycles. This lecture, reading and lab course will introduce topics in plant systematics, evolution, genetics, genomics, development, and ecology, with emphasis on plant interactions with soil and the bacteria, fungi, and animals that inhabit it. Students from all options are welcome.",
        "offered": true,
        "instructors": "Meyerowitz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/plant-and-soil-science",
        "prereq_text": "",
        "prereqs": []
    },
    "bibecs-183": {
        "id": "bibecs-183",
        "course_id": "Bi/BE/CS 183",
        "name": "Introduction to Computational Biology and Bioinformatics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Biology is becoming an increasingly data-intensive science. Many of the data challenges in the biological sciences are distinct from other scientific disciplines because of the complexity involved. This course will introduce key computational, probabilistic, and statistical methods that are common in computational biology and bioinformatics. We will integrate these theoretical aspects to discuss solutions to common challenges that reoccur throughout bioinformatics including algorithms and heuristics for tackling DNA sequence alignments, phylogenetic reconstructions, evolutionary analysis, and population and human genetics. We will discuss these topics in conjunction with common applications including the analysis of high throughput DNA sequencing data sets and analysis of gene expression from RNA-Seq data sets.",
        "offered": true,
        "instructors": "Guttman, Thomson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/introduction-to-computational-biology-and-bioinformatics",
        "prereq_text": "Prerequisites: Bi 8, CS 2, Ma 3; or BE/Bi 103 a; or instructor's permission.",
        "prereqs": [
            "cs-2",
            "ma-3103"
        ]
    },
    "esegebiche-184": {
        "id": "esegebiche-184",
        "course_id": "ESE/Ge/Bi/ChE 184",
        "name": "Computational Tools for Decoding Microbial Ecosystems",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Karthikeyan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/computational-tools-for-decoding-microbial-ecosystems",
        "prereq_text": "Prerequisites: Prior knowledge in Microbiology/Microbial Ecology is required (or instructor's approval). Proficiency in python, bash, slurm, while encouraged, is not required.",
        "prereqs": []
    },
    "cnsbieecsnb-186": {
        "id": "cnsbieecsnb-186",
        "course_id": "CNS/Bi/EE/CS/NB 186",
        "name": "Vision: From Computational Theory to Neuronal Mechanisms",
        "units": "12 units (4-4-4)",
        "terms": "Second term",
        "description": "Lecture, laboratory, and project course aimed at understanding visual information processing, in both machines and the mammalian visual system. The course will emphasize an interdisciplinary approach aimed at understanding vision at several levels: computational theory, algorithms, psychophysics, and hardware (i.e., neuroanatomy and neurophysiology of the mammalian visual system). The course will focus on early vision processes, in particular motion analysis, binocular stereo, brightness, color and texture analysis, visual attention and boundary detection. Students will be required to hand in approximately three homework assignments as well as complete one project integrating aspects of mathematical analysis, modeling, physiology, psychophysics, and engineering.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Meister, Perona, Shimojo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/vision:-from-computational-theory-to-neuronal-mechanisms",
        "prereq_text": "",
        "prereqs": []
    },
    "cnsbiphcsnb-187": {
        "id": "cnsbiphcsnb-187",
        "course_id": "CNS/Bi/Ph/CS/NB 187",
        "name": "Neural Computation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course aims at a quantitative understanding of how the nervous system computes. The goal is to link phenomena across scales from membrane proteins to cells, circuits, brain systems, and behavior. We will learn how to formulate these connections in terms of mathematical models, how to test these models experimentally, and how to interpret experimental data quantitatively. The concepts will be developed with motivation from some of the fascinating phenomena of animal behavior, such as: aerobatic control of insect flight, precise localization of sounds, sensing of single photons, reliable navigation and homing, rapid decision-making during escape, one-shot learning, and large-capacity recognition memory.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Meister",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/neural-computation",
        "prereq_text": "Prerequisites: introductory neuroscience (Bi 150 or equivalent); mathematical methods (Bi 195 or equivalent); scientific programming.",
        "prereqs": []
    },
    "bi-188": {
        "id": "bi-188",
        "course_id": "Bi 188",
        "name": "Human Genetics and Genomics",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "Introduction to the genetics of humans. Subjects covered include human genome structure, genetic diseases and predispositions, the human genome project, forensic use of human genetic markers, human variability, and human evolution.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Wold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/human-genetics-and-genomics",
        "prereq_text": "Prerequisites: Bi 122; or graduate standing and instructor's permission.",
        "prereqs": []
    },
    "bibmb-189": {
        "id": "bibmb-189",
        "course_id": "Bi/BMB 189",
        "name": "The Cell Cycle and Genomic Stability",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "The course covers the mechanisms by which eukaryotic cells control their duplication in a properly regulated manner. A large emphasis will be placed on the controls that cells employ to replicate and segregate their chromosomes with the necessary precision. In addition, the course will examine the mechanisms by which cells detect and rectify damaged DNA throughout the cell cycle. These various processes, collectively known as checkpoint-regulatory mechanisms, lie at the heart of how organisms maintain genomic integrity throughout their lifetimes. These pathways are essential for the prevention of cancer, birth defects, and other maladies. As part of the course, students will give presentations on key publications in the field, including both classic papers and newer papers that employ cutting-edge technologies.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dunphy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/the-cell-cycle-and-genomic-stability",
        "prereq_text": "Prerequisites: Bi 8 and Bi 9.",
        "prereqs": []
    },
    "bi-190": {
        "id": "bi-190",
        "course_id": "Bi 190",
        "name": "Systems Genetics",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "Lectures covering how genetic and genomic analyses are used to understand biological systems. Emphasis is on genetic and genome-scale approaches used in model organisms such as yeast, flies, worms, and mice to elucidate the function of genes, genetic pathways and genetic networks.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Sternberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/systems-genetics",
        "prereq_text": "Prerequisites: Bi 122.",
        "prereqs": []
    },
    "becscnsbi-191-ab": {
        "id": "becscnsbi-191-ab",
        "course_id": "BE/CS/CNS/Bi 191 ab",
        "name": "Biomolecular Computation",
        "units": "9 units (3-0-6) a; (2-4-3) b",
        "terms": "second, third terms",
        "description": "This course investigates computation by molecular systems, emphasizing models of computation based on the underlying physics, chemistry, and organization of biological cells. We will explore programmability, complexity, simulation of, and reasoning about abstract models of chemical reaction networks, molecular folding, molecular self-assembly, and molecular motors, with an emphasis on universal architectures for computation, control, and construction within molecular systems. If time permits, we will also discuss biological example systems such as signal transduction, genetic regulatory networks, and the cytoskeleton; physical limits of computation, reversibility, reliability, and the role of noise, DNA-based computers and DNA nanotechnology. Part a develops fundamental results; part b is a reading and research course: classic and current papers will be discussed, and students will do projects on current research topics.",
        "offered": true,
        "instructors": "Winfree",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/biomolecular-computation",
        "prereq_text": "Prerequisites: None. Recommended: BE/ChE 163, CS 21, or equivalent.",
        "prereqs": [
            "cs-21"
        ]
    },
    "bi-192": {
        "id": "bi-192",
        "course_id": "Bi 192",
        "name": "Introduction to Systems Biology",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "The course will explore what it means to analyze biology from a systems-level point of view. Given what biological systems must do and the constraints they face, what general properties must biological systems have? Students will explore design principles in biology, including plasticity, exploratory behavior, weak-linkage, constrains that deconstrain, robustness, optimality, and evolvability. The class will read the equivalent of 2-3 scientific papers every week. The format will be a seminar with active discussion from all students. Students from multiple backgrounds are welcome: non-biology or biology students interested in learning systems-level questions in biology. Limited enrollment.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Goentoro",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/introduction-to-systems-biology",
        "prereq_text": "Prerequisites: Ma 1 abc, and either Bi 8, CS 1, or ACM 95 or instructor's permission.",
        "prereqs": [
            "cs-1",
            "ma-1-d",
            "acm-95100-ab",
            "ma-1-abc",
            "cs-1-x"
        ]
    },
    "bicnsnb-195": {
        "id": "bicnsnb-195",
        "course_id": "Bi/CNS/NB 195",
        "name": "Mathematics in Biology",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course develops the mathematical methods needed for a quantitative understanding of biological phenomena, including data analysis, formulation of simple models, and the framing of quantitative questions. Topics include: probability and stochastic processes, linear algebra and transforms, dynamical systems, scientific programming.",
        "offered": true,
        "instructors": "Thomson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/mathematics-in-biology",
        "prereq_text": "Prerequisites: calculus.",
        "prereqs": []
    },
    "bebicnsnb-197": {
        "id": "bebicnsnb-197",
        "course_id": "BE/Bi/CNS/NB 197",
        "name": "Mentoring and Outreach",
        "units": "taken in any term, usually 3 units per term and not more than 6 in a single term",
        "terms": "",
        "description": "In consultation with, and with the approval of, a faculty advisor (usually the student’s academic advisor) and the Caltech Center for Teaching, Learning, and Outreach. Students may obtain credit for engaging in volunteer efforts to promote public understanding of science; to mentor and tutor young people and underserved populations; or to otherwise contribute to the diversity, equity, and inclusiveness of the scientific enterprise. Students will be required to fill out short pre- and post-outreach activity forms to describe their proposal and to report on the results. Students may petition their option representative (graduate students) or academic advisor (undergraduate students) if they seek credits beyond the 12-unit limit. Offered pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/mentoring-and-outreach",
        "prereq_text": "",
        "prereqs": []
    },
    "bebinb-203": {
        "id": "bebinb-203",
        "course_id": "BE/Bi/NB 203",
        "name": "Introduction to Programming for the Biological Sciences Bootcamp",
        "units": "6 units",
        "terms": "summer term",
        "description": "This course provides an intensive, hands-on, pragmatic introduction to computer programming aimed at biologists and bioengineers. No previous programming experience is assumed. Python is the language of instruction. Students will learn basic concepts such as data types, control structures, string processing, functions, input/output, etc., while writing code applied to biological problems. At the end of the course, students will be able to perform simple simulations, write scripts to run software packages and parse output, and analyze and plot data. This class is offered as a week-long summer \"boot camp\" the week after Commencement, in which students spend all day working on the course. Students who do not have a strong need for the condensed boot camp schedule are encouraged to take BE/Bi 103 a instead. Graded pass/fail.",
        "offered": true,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/introduction-to-programming-for-the-biological-sciences-bootcamp",
        "prereq_text": "",
        "prereqs": []
    },
    "bebi-205": {
        "id": "bebi-205",
        "course_id": "BE/Bi 205",
        "name": "Deep Learning for Biological Data",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course is a practical introduction to machine learning methods for biological data, focusing on three common data types in biology-images, sequences, and structures. This course will cover how to represent biological data in a manner amenable to machine learning approaches, survey tasks that can be solved with modern deep learning algorithms (e.g. image segmentation, object tracking, sequence classification, protein folding, etc.), explore architectures of deep learning models for each data type, and provide practical guidance for model development. Students will have the opportunity to apply these methods to their own datasets.",
        "offered": true,
        "instructors": "Van Valen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/deep-learning-for-biological-data",
        "prereq_text": "Prerequisites: BE/BI 103 a and BE/BI 103 b or equivalent; or instructor's permission. CMS/CS/CNS/EE/IDS 155 is strongly recommended but not required.",
        "prereqs": [
            "cmscscnseeids-155"
        ]
    },
    "bi-214": {
        "id": "bi-214",
        "course_id": "Bi 214",
        "name": "Stem Cells and Hematopoiesis",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An advanced course with classes based on active discussion, lectures, and seminar presentations. Development from embryos and development from stem cells are distinct paradigms for understanding and manipulating the emergence of ordered biological complexity from simplicity. This course focuses on the distinguishing features of stem-cell based systems, ranging from the natural physiological stem cells that are responsible for life-long hematopoiesis in vertebrates (hematopoietic stem cells) to the artificial stem cells, ES and iPS cells, that have now been created for experimental manipulation. Key questions will be how the stem cells encode multipotency, how they can enter long-term self-renewal by separating themselves from the developmental clock that controls development of the rest of the organism, and how the self-renewal programs of different stem cell types can be dismantled again to allow differentiation. Does \"stem-ness\" have common elements in different systems? The course will also cover the lineage relationships among diverse differentiated cell types emerging from common stem cells, the role of cytokines and cytokine receptors in shaping differentiation output, apoptosis and lineage-specific proliferation, and how differentiation works at the level of gene regulation and regulatory networks.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Rothenberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/stem-cells-and-hematopoiesis",
        "prereq_text": "Prerequisites: Graduate standing, or at least one of Bi 114, Bi 117, Bi/Be 182, plus molecular biology.",
        "prereqs": []
    },
    "nbbicns-216": {
        "id": "nbbicns-216",
        "course_id": "NB/Bi/CNS 216",
        "name": "Behavior of Mammals",
        "units": "6 units (2-0-4)",
        "terms": "First term",
        "description": "A course of lectures, readings, and discussions focused on the genetic, physiological, and ecological bases of behavior in mammals. A basic knowledge of neuroanatomy and neurophysiology is desirable.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Allman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/behavior-of-mammals",
        "prereq_text": "",
        "prereqs": []
    },
    "nbbicns-217": {
        "id": "nbbicns-217",
        "course_id": "NB/Bi/CNS 217",
        "name": "Central Mechanisms in Perception",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "Reading and discussions of behavioral and electrophysiological studies of the systems for the processing of sensory information in the brain.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Allman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/central-mechanisms-in-perception",
        "prereq_text": "",
        "prereqs": []
    },
    "nbbicns-220": {
        "id": "nbbicns-220",
        "course_id": "NB/Bi/CNS 220",
        "name": "Genetic Dissection of Neural Circuit Function",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "This advanced course will discuss the emerging science of neural \"circuit breaking\" through the application of molecular genetic tools. These include optogenetic and pharmacogenetic manipulations of neuronal activity, genetically based tracing of neuronal connectivity, and genetically based indicators of neuronal activity. Both viral and transgenic approaches will be covered, and examples will be drawn from both the invertebrate and vertebrate literature. Interested CNS or other graduate students who have little or no familiarity with molecular biology will be supplied with the necessary background information. Lectures and student presentations from the current literature.",
        "offered": true,
        "instructors": "Anderson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/genetic-dissection-of-neural-circuit-function",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or equivalent. Open to advanced (junior or senior) undergraduates only and with instructor permission.",
        "prereqs": []
    },
    "bibebmb-222": {
        "id": "bibebmb-222",
        "course_id": "Bi/BE/BMB 222",
        "name": "The Structure of the Cytosol",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "The cytosol, and fluid spaces within the nucleus, were once envisioned as a concentrated soup of proteins, RNA, and small molecules, all diffusing, mixing freely, and interacting randomly. We now know that proteins in the cytosol frequently undergo only restricted diffusion and become concentrated in specialized portions of the cytosol to carry out particular cellular functions. This course consists of lectures, reading, student presentations, and discussion about newly recognized biochemical mechanisms that confer local structure and reaction specificity within the cytosol, including protein scaffolds and \"liquid-liquid phase separations\" that form \"membraneless compartments\".\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Kennedy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/the-structure-of-the-cytosol",
        "prereq_text": "Prerequisites: Bi 9, Ch/Bi 110-111 or graduate standing in a biological discipline.",
        "prereqs": []
    },
    "bibe-227": {
        "id": "bibe-227",
        "course_id": "Bi/BE 227",
        "name": "Methods in Modern Microscopy",
        "units": "12 units (2-6-4)",
        "terms": "second term",
        "description": "Discussion and laboratory-based course covering the practical use of the confocal microscope, with special attention to the dynamic analysis of living cells and embryos. Course topics include: basic optics, microscope design, Kohler illumination, confocal microscopy, light sheet microscopy, spectral unmixing and fluorescence correlation spectroscopy, three-dimensional reconstruction of fixed cells and tissues. Students will construct a light sheet microscope based on the openSPIM design, and perform time-lapse confocal analysis of living cells and embryos. Enrollment is limited.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Collazo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/methods-in-modern-microscopy",
        "prereq_text": "Prerequisites: Bi/BE 177 or a course in microscopy.",
        "prereqs": []
    },
    "bicnsbenb-230": {
        "id": "bicnsbenb-230",
        "course_id": "Bi/CNS/BE/NB 230",
        "name": "Optogenetic and CLARITY Methods in Experimental Neuroscience",
        "units": "9 units (3-2-4)",
        "terms": "third term",
        "description": "The class covers the theoretical and practical aspects of using (1) optogenetic sensors and actuators to visualize and modulate the activity of neuronal ensembles; and (2) CLARITY approaches for anatomical mapping and phenotyping using tissue-hydrogel hybrids. The class offers weekly hands-on LAB exposure for opsin viral production and delivery to neurons, recording of light-modulated activity, and tissue clearing, imaging, and 3D reconstruction of fluorescent samples. Lecture topics include: opsin design (including natural and artificial sources), delivery (genetic targeting, viral transduction), light activation requirements (power requirements, wavelength, fiberoptics), compatible readout modalities (electrophysiology, imaging); design and use of methods for tissue clearing (tissue stabilization by polymers/hydrogels and selective extractions, such as of lipids for increased tissue transparency and macromolecule access). Class will discuss applications of these methods to neuronal circuits (case studies based on recent literature).\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Gradinaru",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/optogenetic-and-clarity-methods-in-experimental-neuroscience",
        "prereq_text": "Prerequisites: Graduate standing or NB/Bi/CNS 150 or equivalent or instructor's permission.",
        "prereqs": []
    },
    "bibecnsnb-241": {
        "id": "bibecnsnb-241",
        "course_id": "Bi/BE/CNS/NB 241",
        "name": "Spatial Genomics",
        "units": "9 units (1-8-0)",
        "terms": "third term",
        "description": "Maximum enrollment: 12. Applications of spatial genomics technology to various biological samples. Projects will be selected to represent problems in neurobiology, developmental biology and translational medicine. Emphasis will be placed on generating experimental data and analysis of data with machine learning algorithms for segmentation and clustering cells with single cell genomics tools, and preparation for publication.",
        "offered": true,
        "instructors": "Cai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/spatial-genomics",
        "prereq_text": "Prerequisites: Instructor's permission.",
        "prereqs": []
    },
    "gebi-244": {
        "id": "gebi-244",
        "course_id": "Ge/Bi 244",
        "name": "Paleobiology Seminar",
        "units": "6 units (3-0-3)",
        "terms": "third term",
        "description": "Critical reviews and discussion of classic investigations and current research in paleoecology, evolution, and biogeochemistry.",
        "offered": true,
        "instructors": "Kirschvink",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/paleobiology-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "gebiese-246": {
        "id": "gebiese-246",
        "course_id": "Ge/Bi/ESE 246",
        "name": "Molecular Geobiology Seminar",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "Critical reviews and discussion of classic papers and current research in microbiology and geomicrobiology. As the topics will vary from year to year, it may be taken multiple times.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Orphan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/molecular-geobiology-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "cnsbinb-247": {
        "id": "cnsbinb-247",
        "course_id": "CNS/Bi/NB 247",
        "name": "Cerebral Cortex",
        "units": "6 units (2-0-4)",
        "terms": "second term",
        "description": "A general survey of the structure and function of the cerebral cortex. Topics include cortical anatomy, functional localization, and newer computational approaches to understanding cortical processing operations. Motor cortex, sensory cortex (visual, auditory, and somatosensory cortex), association cortex, and limbic cortex. Emphasis is on using animal models to understand human cortical function and includes correlations between animal studies and human neuropsychological and functional imaging literature.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Andersen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/cerebral-cortex",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or equivalent.",
        "prereqs": []
    },
    "geesebi-248": {
        "id": "geesebi-248",
        "course_id": "Ge/ESE/Bi 248",
        "name": "Environmental Justice",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "This seminar course will explore and discuss the unique intersection of environmental racism, environmental justice, and academia. Course material will primarily feature readings and videos on a case study-like basis and focus on bringing conversations typically had in humanities, social sciences and activism to the bio and geosciences. Topics will center around two primary approaches: an \"outward-facing\" component that looks at environmental racism through the lens of various activisms, and an \"inward-facing\" component addressing the biases/malpractices broadly employed in the biological and geosciences, as well as the apparent moral dilemmas of decisions involving multiple stakeholders. Out of class work will largely be based on assigned readings, some multimedia presentations, and occasional writings and thought exercises. This course is taught concurrently with Hum 61 and can only be taken once, as Ge/ESE/Bi 248 or Hum 61.",
        "offered": true,
        "instructors": "Orphan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/environmental-justice",
        "prereq_text": "",
        "prereqs": []
    },
    "gebiesece-249": {
        "id": "gebiesece-249",
        "course_id": "Ge/Bi/ESE/CE 249",
        "name": "Stable Isotopes: Ecological and Environmental Applications",
        "units": "9 units (3-3-3)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Tejada",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/stable-isotopes:-ecological-and-environmental-applications",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-250-a": {
        "id": "bi-250-a",
        "course_id": "Bi 250 a",
        "name": "Topics in Molecular and Cellular Biology",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course will cover 4-5 major discoveries in modern molecular biology, with the goal of analyzing the methods, scientific concepts and logic, research strategies, and scientists that underlie these advances. Students will learn to critique papers in a wide range of fields, including molecular biology, developmental biology, genetics, and neuroscience. As an opportunity to hone their communication and teaching skills, students will develop and implement a hands-on demonstration of a molecular biology concept to local elementary students in the PUSD school system.",
        "offered": true,
        "instructors": "Voorhees",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/topics-in-molecular-and-cellular-biology",
        "prereq_text": "Prerequisites: graduate standing.",
        "prereqs": []
    },
    "bi-250-b": {
        "id": "bi-250-b",
        "course_id": "Bi 250 b",
        "name": "Topics in Systems Biology",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Quantitative studies of cellular and developmental systems in biology, including the architecture of specific circuits controlling microbial behaviors and multicellular development in model organisms. Specific topics include chemotaxis, multistability and differentiation, biological oscillations, stochastic effects in circuit operation, as well as higher-level circuit properties, such as robustness. The course will also consider the organization of transcriptional and protein-protein interaction networks at the genomic scale. Topics are approached from experimental, theoretical, and computational perspectives.",
        "offered": true,
        "instructors": "Elowitz, Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/topics-in-systems-biology",
        "prereq_text": "Prerequisites: Bi 1, Bi 8, or equivalent; Ma 2, Bi/CNS/NB 195, or equivalent; or instructor's permission.",
        "prereqs": [
            "ma-2102"
        ]
    },
    "nbbicns-250-c": {
        "id": "nbbicns-250-c",
        "course_id": "NB/Bi/CNS 250 c",
        "name": "Topics in Systems Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The class focuses on quantitative studies of problems in systems neuroscience. Students will study classical work such as Hodgkin and Huxley's landmark papers on the ionic basis of the action potential, and will move from the study of interacting currents within neurons to the study of systems of interacting neurons. Topics will include lateral inhibition, mechanisms of motion tuning, local learning rules and their consequences for network structure and dynamics, oscillatory dynamics and synchronization across brain circuits, and formation and computational properties of topographic neural maps. The course will combine lectures and discussions, in which students and faculty will examine papers on systems neuroscience, usually combining experimental and theoretical/modeling components.",
        "offered": true,
        "instructors": "Siapas",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/topics-in-systems-neuroscience",
        "prereq_text": "Prerequisites: graduate standing.",
        "prereqs": []
    },
    "bi-250-d": {
        "id": "bi-250-d",
        "course_id": "Bi 250 d",
        "name": "Topics in Developmental, Stem Cell and Evolutionary Biology",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Lectures and literature-based discussions on the principles and experimental frontiers of embryonic axis organization, pattern formation, genomic mechanisms of cell type specification, stem cell biology, and evolutionary change.",
        "offered": true,
        "instructors": "Bronner, Rothenberg, Zernicka-Goetz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/topics-in-developmental,-stem-cell-and-evolutionary-biology",
        "prereq_text": "Prerequisites: graduate standing.",
        "prereqs": []
    },
    "bibmb-251-abc": {
        "id": "bibmb-251-abc",
        "course_id": "Bi/BMB 251 abc",
        "name": "Current Research in Biology and Biological Engineering",
        "units": "1 unit",
        "terms": "first, second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Hay, Sternberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/current-research-in-biology-and-biological-engineering",
        "prereq_text": "Prerequisites: graduate standing.",
        "prereqs": []
    },
    "bi-252": {
        "id": "bi-252",
        "course_id": "Bi 252",
        "name": "Responsible Conduct of Research",
        "units": "4 units (2-0-2)",
        "terms": "first term",
        "description": "This lecture and discussion course covers relevant aspects of the responsible conduct of biomedical and biological research. Topics include guidelines and regulations, ethical and moral issues, research misconduct, data management and analysis, research with animal or human subjects, publication, conflicts of interest, mentoring, and professional advancement. Undergraduate students with junior and senior standing may enroll. Graded pass/fail.",
        "offered": true,
        "instructors": "Meyerowitz, Sternberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/responsible-conduct-of-research",
        "prereq_text": "",
        "prereqs": []
    },
    "chbi-253": {
        "id": "chbi-253",
        "course_id": "Ch/Bi 253",
        "name": "Advanced Topics in Biochemistry",
        "units": "6 units (2-0-4)",
        "terms": "",
        "description": "Hours and units to be arranged. Content will vary from year to year; topics are chosen according to the interests of students and staff.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/advanced-topics-in-biochemistry",
        "prereq_text": "",
        "prereqs": []
    },
    "psybicns-255": {
        "id": "psybicns-255",
        "course_id": "Psy/Bi/CNS 255",
        "name": "Topics in Emotion and Social Cognition",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Emotions are at the forefront of most human endeavors. Emotions aid us in decision-making (gut feelings), help us remember, torment us, yet have ultimately helped us to survive. Over the past few decades, we have begun to characterize the neural systems that extend from primitive affective response such as fight or flight to the complex emotions experienced by humans including guilt, envy, empathy and social pain. This course will begin with an in-depth examination of the neurobiological systems that underlie negative and positive emotions and move onto weekly discussions, based on assigned journal articles that highlight both rudimentary and complex emotions. The final weeks will be devoted to exploring how the neurobiological systems are disrupted in affective disorders including anxiety, aggression and psychopathy. In addition to these discussions and readings, each student will be required to write a review paper or produce a short movie on a topic related to one of the emotions discussed in these seminars and its underlying neural mechanisms.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/topics-in-emotion-and-social-cognition",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or instructor's permission.",
        "prereqs": []
    },
    "cnsbinb-256": {
        "id": "cnsbinb-256",
        "course_id": "CNS/Bi/NB 256",
        "name": "Brain-machine interfaces",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "A brain-machine interface (BMI) records neural activity, decodes the intent of the participant, and generates control signals to operate assistive devices. Bi-directional BMIs can write signals back into the brain though electrical stimulation based on the recorded neural activity. These neurotechnologies have been advancing rapidly with therapeutic potential for several neurological diseases and disorders. Through lectures and reviews of the literature, the course will cover motor BMIs for robotics and communication, cognitive neural prosthetics, stimulation to restore sensation, and different invasive and non-invasive recording and stimulation technologies.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Andersen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/brain-machine-interfaces",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-265": {
        "id": "bi-265",
        "course_id": "Bi 265",
        "name": "Biological Research: Fellowship Application and Science Communication",
        "units": "6 units (2-3-1)",
        "terms": "summer term",
        "description": "This course focuses on clear communication of scientific research in grant writing, networking, and research presentation. Practice is obtained through the following facilitated activities: 1) drafting the required statements for an NSF-GRFP proposal, 2) developing a networking pitch for use with non-scientists and scientists, and 3) presenting research to a scientific audience. First and second year graduate students, senior undergrads, and rising senior undergrads can enroll.",
        "offered": true,
        "instructors": "Hoy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/biological-research:-fellowship-application-and-science-communication",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-270-abc": {
        "id": "bi-270-abc",
        "course_id": "Bi 270 abc",
        "name": "Special Topics in Biology",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Students may register with permission of the responsible faculty member.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/special-topics-in-biology",
        "prereq_text": "",
        "prereqs": []
    },
    "cnsbi-286-abc": {
        "id": "cnsbi-286-abc",
        "course_id": "CNS/Bi 286 abc",
        "name": "Special Topics in Computation and Neural Systems",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Students may register with permission of the responsible faculty member.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/special-topics-in-computation-and-neural-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "bi-299": {
        "id": "bi-299",
        "course_id": "Bi 299",
        "name": "Graduate Research",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Students may register for research units after consultation with their adviser.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/bi/graduate-research",
        "prereq_text": "",
        "prereqs": []
    }
}