{
    "cds-90-abc": {
        "id": "cds-90-abc",
        "course_id": "CDS 90 abc",
        "name": "Senior Thesis in Control and Dynamical Systems",
        "units": "9 units (0-0-9)",
        "terms": "first, second, third terms",
        "description": "Research in control and dynamical systems, supervised by a Caltech faculty member. The topic selection is determined by the adviser and the student and is subject to approval by the CDS faculty. First and second terms: midterm progress report and oral presentation during finals week. Third term: completion of thesis and final presentation. Not offered on a pass/fail basis.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/senior-thesis-in-control-and-dynamical-systems",
        "prereq_text": "Prerequisites: CDS 110 or CDS 112 (may be taken concurrently).",
        "prereqs": []
    },
    "cds-110": {
        "id": "cds-110",
        "course_id": "CDS 110",
        "name": "Analysis and Design of Feedback Control Systems",
        "units": "9 units (3-3-3)",
        "terms": "first term",
        "description": "An introduction to analysis and design of feedback control systems in the time and frequency domain, with an emphasis on state space methods, robustness, and design tradeoffs. Linear input/output systems, including input/output response via convolution, reachability, and observability. State feedback methods, including eigenvalue placement, linear quadratic regulators, and model predictive control. Output feedback including estimators and two-degree of freedom design. Input/output modeling via transfer functions and frequency domain analysis of performance and robustness, including the use of Bode and Nyquist plots. Robustness, tradeoffs and fundamental limits, including the effects of external disturbances and unmodeled dynamics, sensitivity functions, and the Bode integral formula.",
        "offered": true,
        "instructors": "Mazumdar",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/analysis-and-design-of-feedback-control-systems",
        "prereq_text": "Prerequisites: Ma 1 abc and Ma 2/102 or equivalents.",
        "prereqs": [
            "ma-1-d",
            "ma-2102",
            "ma-1-abc"
        ]
    },
    "cds-131": {
        "id": "cds-131",
        "course_id": "CDS 131",
        "name": "Linear Systems Theory",
        "units": "12 units (3-0-9)",
        "terms": "second term",
        "description": "Basic system concepts; state-space and I/O representation. Properties of linear systems, including stability, performance, robustness. Reachability, observability, minimality, state and output-feedback. Brief introduction to optimal control and control of networked and nonlinear systems. Motivating case studies from tech, biology, neuroscience, and medical systems.",
        "offered": true,
        "instructors": "Doyle",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/linear-systems-theory",
        "prereq_text": "Prerequisites: Ma 1 b, Ma 2, ACM/IDS 104 or equivalent (may be taken concurrently).",
        "prereqs": [
            "acmids-104",
            "ma-1-d",
            "ma-2102",
            "ma-1-abc"
        ]
    },
    "cds-190": {
        "id": "cds-190",
        "course_id": "CDS 190",
        "name": "Independent Work in Control and Dynamical Systems",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Research project in control and dynamical systems, supervised by a CDS faculty member.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/independent-work-in-control-and-dynamical-systems",
        "prereq_text": "Prerequisites: CDS 110.",
        "prereqs": []
    },
    "cds-212": {
        "id": "cds-212",
        "course_id": "CDS 212",
        "name": "Optimal Control and Estimation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Advanced topics in optimization-based design of control, optimal control, and estimation/filtering. Optimal control theory using calculus of variations, Hamilton-Jacobi-Bellman equation, Pontryagin's maximum principle, and optimal control applications including reinforcement learning and model predictive control. Kalman filtering, Bayesian filtering, and nonlinear filtering methods for autonomous systems.",
        "offered": true,
        "instructors": "Chung",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/optimal-control-and-estimation",
        "prereq_text": "Prerequisites: CDS 110 (or equivalent) and CDS 131.",
        "prereqs": []
    },
    "cds-231": {
        "id": "cds-231",
        "course_id": "CDS 231",
        "name": "Robust Control Theory",
        "units": "9 units (3-2-4)",
        "terms": "third term",
        "description": "Scalable analysis and synthesis of robust control systems. Motivation throughout from case studies in tech, neuro, bio, med, and socioeconomic networks. Co-design of sparse and limited (delayed, localized, quantized, saturating, noisy) sensing, communications, computing, and actuation using System Level Synthesis (SLS). Layering, localization, and distributed control. Computational scalability exploiting sparsity and structure. Uncertainty, including noise, disturbances, parametric uncertainty, unmodeled dynamics, and structured uncertainty (LTI/LTV). Tradeoffs, robustness versus efficiency, conservation laws and hard limits in time and frequency domain. Advanced topics, depending on class interest, can include interplay between automation, optimization, control, modeling and system identification, and machine learning, and nonlinear dynamics and sum of squares, global stability, regions of attraction.",
        "offered": true,
        "instructors": "Doyle",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/robust-control-theory",
        "prereq_text": "Prerequisites: CMS/ACM/IDS 107, CMS/ACM/EE 122, and CDS 131 (or equivalents).",
        "prereqs": [
            "cmsacmee-122",
            "cmsacmids-107-ab"
        ]
    },
    "cds-232": {
        "id": "cds-232",
        "course_id": "CDS 232",
        "name": "Nonlinear Dynamics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course studies nonlinear dynamical systems beginning from first principles. Topics include: existence and uniqueness properties of solutions to nonlinear ODEs, stability of nonlinear systems from the perspective of Lyapunov, and behavior unique to nonlinear systems; for example: stability of periodic orbits, Poincaré maps and stability/invariance of sets. The dynamics of robotic systems will be used as a motivating example.",
        "offered": true,
        "instructors": "Ames",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/nonlinear-dynamics",
        "prereq_text": "Prerequisites: CMS/ACM/IDS 107 and CDS 231.",
        "prereqs": [
            "cmsacmids-107-ab"
        ]
    },
    "cds-233": {
        "id": "cds-233",
        "course_id": "CDS 233",
        "name": "Nonlinear Control",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course studies nonlinear control systems from Lyapunov perspective. Beginning with feedback linearization and the stabilization of feedback linearizable system, these concepts are related to control Lyapunov functions, and corresponding stabilization results in the context of optimization based controllers. Advanced topics that build upon these core results will be discussed including: stability of periodic orbits, controller synthesis through virtual constraints, safety-critical controllers, and the role of physical constraints and actuator limits. The control of robotic systems will be used as a motivating example.",
        "offered": true,
        "instructors": "Ames",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/nonlinear-control",
        "prereq_text": "Prerequisites: CDS 231 and CDS 232.",
        "prereqs": []
    },
    "mecdsee-234-ab": {
        "id": "mecdsee-234-ab",
        "course_id": "ME/CDS/EE 234 ab",
        "name": "Advanced Robotics: Planning",
        "units": "9 units (3-3-3)",
        "terms": "second, third terms",
        "description": "Advanced topics in robotic motion planning and navigation, including inertial navigation, simultaneous localization and mapping, Markov Decision Processes, Stochastic Receding Horizon Control, Risk-Aware planning, robotic coverage planning, and multi-robot coordination. Course work will consist of homework, programming projects, and labs. Given in alternate years.",
        "offered": true,
        "instructors": "Burdick",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/advanced-robotics:-planning",
        "prereq_text": "Prerequisites: ME/CS/EE 133 b, or equivalent. ME/CS/EE 133 a preferred.",
        "prereqs": [
            "mecsee-133-ab"
        ]
    },
    "mecds-235-ab": {
        "id": "mecds-235-ab",
        "course_id": "ME/CDS 235 ab",
        "name": "Advanced Robotics: Kinematics",
        "units": "9 units (3-3-3)",
        "terms": "second, third terms",
        "description": "Advanced topics in robot kinematics and robotic mechanisms. Topics include a Lie Algebraic viewpoint on kinematics and robot dynamics, a review of robotic mechanisms, and a detailed development of robotic grasping and manipulation. Given in alternate years.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/advanced-robotics:-kinematics",
        "prereq_text": "Prerequisites: ME/CS/EE 133 a, or equivalent.",
        "prereqs": [
            "mecsee-133-ab"
        ]
    },
    "cds-242": {
        "id": "cds-242",
        "course_id": "CDS 242",
        "name": "Hybrid Systems: Dynamics and Control",
        "units": "9 units (3-2-4)",
        "terms": "third term",
        "description": "This class studies hybrid dynamical systems: systems that display both discrete and continuous dynamics. This includes topics on dynamic properties unique to hybrid system: stability types, hybrid periodic orbits, Zeno equilibria and behavior. Additionally, the nonlinear control of these systems will be considered in the context of feedback linearization and control Lyapunov functions. Applications to mechanical systems undergoing impacts will be considered, with a special emphasis on bipedal robotic walking.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/hybrid-systems:-dynamics-and-control",
        "prereq_text": "Prerequisites: CDS 231 and CDS 232.",
        "prereqs": []
    },
    "cds-243": {
        "id": "cds-243",
        "course_id": "CDS 243",
        "name": "Adaptive Control",
        "units": "4 units (2-0-2)",
        "terms": "third term",
        "description": "Specification and design of control systems that operate in the presence of uncertainties and unforeseen events. Robust and optimal linear control methods, including LQR, LQG and LTR control. Design and analysis of model reference adaptive control (MRAC) for nonlinear uncertain dynamical systems with extensions to output feedback. Given in alternate years.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/adaptive-control",
        "prereq_text": "Prerequisites: CDS 231 and CDS 232.",
        "prereqs": []
    },
    "cds-244": {
        "id": "cds-244",
        "course_id": "CDS 244",
        "name": "System Identification",
        "units": "4 units (2-0-2)",
        "terms": "third term",
        "description": "Mathematical treatment of system identification methods for dynamical systems, with applications. Nonlinear dynamics and models for parameter identification. Gradient and least-squares estimators and variants. System identification with adaptive predictors and state observers. Parameter estimation in the presence of non-parametric uncertainties. Introduction to adaptive control.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/system-identification",
        "prereq_text": "Prerequisites: CDS 231 and CDS 232.",
        "prereqs": []
    },
    "cds-245": {
        "id": "cds-245",
        "course_id": "CDS 245",
        "name": "Data-driven Control",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Mathematical treatment of data-driven machine learning methods for controlling robotic and dynamical systems with various uncertainties. Gradient and least-squares estimators and variants for dynamical systems for system identification and residual learning. Adaptive control methods for online adaptation and combination with deep learning. Learning-based control certificates such as neural Lyapunov functions and neural contraction metrics.",
        "offered": true,
        "instructors": "Chung",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/data-driven-control",
        "prereq_text": "Prerequisites: CDS 131 and CDS 232.",
        "prereqs": []
    },
    "aecdsme-251-ab": {
        "id": "aecdsme-251-ab",
        "course_id": "Ae/CDS/ME 251 ab",
        "name": "Closed Loop Flow Control",
        "units": "9 units (3-0-6 a, 1-6-1 b)",
        "terms": "second, third term",
        "description": "This course seeks to introduce students to recent developments in theoretical and practical aspects of applying control to flow phenomena and fluid systems. Lecture topics in the second term drawn from: the objectives of flow control; a review of relevant concepts from classical and modern control theory; high-fidelity and reduced-order modeling; principles and design of actuators and sensors. Third term: laboratory work in open- and closed-loop control of boundary layers, turbulence, aerodynamic forces, bluff body drag, combustion oscillations and flow-acoustic oscillations.\n Not offered 2024-25",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/closed-loop-flow-control",
        "prereq_text": "Prerequisites: ACM 100 abc, Ae/APh/CE/ME 101 abc or equivalent.",
        "prereqs": [
            "aeaphceme-101-abc"
        ]
    },
    "cds-270": {
        "id": "cds-270",
        "course_id": "CDS 270",
        "name": "Advanced Topics in Systems and Control",
        "units": "Hours and units by arrangement; third term",
        "terms": "",
        "description": "Topics dependent on class interests and instructor. May be repeated for credit.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/advanced-topics-in-systems-and-control",
        "prereq_text": "",
        "prereqs": []
    },
    "cds-300-abc": {
        "id": "cds-300-abc",
        "course_id": "CDS 300 abc",
        "name": "Research in Control and Dynamical Systems",
        "units": "Hours and units by arrangement",
        "terms": "",
        "description": "Research in the field of control and dynamical systems. By arrangement with members of the staff, properly qualified graduate students are directed in research.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cds/research-in-control-and-dynamical-systems",
        "prereq_text": "",
        "prereqs": []
    }
}