{
    "cns-99-abc": {
        "id": "cns-99-abc",
        "course_id": "CNS 99 abc",
        "name": "Senior Thesis",
        "units": "9 or more units per term with a total of at least 27 units",
        "terms": "first, second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/senior-thesis",
        "prereq_text": "Prerequisites: Senior standing and instructor's permission.",
        "prereqs": []
    },
    "cns-100": {
        "id": "cns-100",
        "course_id": "CNS 100",
        "name": "Introduction to Computation and Neural Systems",
        "units": "1 unit",
        "terms": "first term",
        "description": "This course is designed to introduce undergraduate and first-year CNS graduate students to the wide variety of research being undertaken by CNS faculty. Topics from all the CNS research labs are discussed and span the range from biology to engineering. Graded pass/fail.",
        "offered": true,
        "instructors": "Siapas",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/introduction-to-computation-and-neural-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "cnspsybi-102-a": {
        "id": "cnspsybi-102-a",
        "course_id": "CNS/Psy/Bi 102 a",
        "name": "Social and Decision Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Introduction to the computations made by the brain during economic and social decision making and their neural substrates. Part a: Introduction to social and decision neuroscience. Neural substrates of reward and reinforcement learning. Unconscious and conscious processing. The neural basis of emotion. Goal-directed and habit learning. The neural substrates of facial processing.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/social-and-decision-neuroscience",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 and CNS/Bi/Ph/CS/NB 187, or instructor's permission.",
        "prereqs": []
    },
    "cnspsybi-102-b": {
        "id": "cnspsybi-102-b",
        "course_id": "CNS/Psy/Bi 102 b",
        "name": "Social and Decision Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Introduction to the computations made by the brain during economic and social decision making and their neural substrates. Part b: History and mechanisms of reinforcement. Memory and valuation. Neural repurposing. Mentalizing and strategic thinking. Neural bases of prosociality, risky choice and delay discounting. Mathematical economic-style theories of neural circuits.",
        "offered": true,
        "instructors": "Camerer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/social-and-decision-neuroscience",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 and CNS/Bi/Ph/CS/NB 187, or instructor's permission.",
        "prereqs": []
    },
    "psycns-105-ab": {
        "id": "psycns-105-ab",
        "course_id": "Psy/CNS 105 ab",
        "name": "Frontiers in Neuroeconomics",
        "units": "5 units (1.5-0-3.5)",
        "terms": "first and second terms",
        "description": "The new discipline of Neuroeconomics seeks to understand the mechanisms underlying human choice behavior, born out of a confluence of approaches derived from Psychology, Neuroscience and Economics. This seminar will consider a variety of emerging themes in this new field. Some of the topics we will address include the neural bases of reward and motivation, the neural representation of utility and risk, neural systems for inter-temporal choice, goals vs habits, and strategic interactions. We will also spend time evaluating various forms of computational and theoretical models that underpin the field such as reinforcement-learning, Bayesian models and race to barrier models. Each week we will focus on key papers and/or book chapters illustrating the relevant concepts.",
        "offered": true,
        "instructors": "O'Doherty",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/frontiers-in-neuroeconomics",
        "prereq_text": "",
        "prereqs": []
    },
    "psycns-130": {
        "id": "psycns-130",
        "course_id": "Psy/CNS 130",
        "name": "Introduction to Human Memory",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The course offers an overview of experimental findings and theoretical issues in the study of human memory. Topics include iconic and echoic memory, working memory, spatial memory, implicit learning and memory; forgetting: facts vs. skills, memory for faces; retrieval: recall vs. recognition, context-dependent memory, semantic memory, spreading activation models and connectionist networks, memory and emotion, infantile amnesia, memory development, and amnesia.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/introduction-to-human-memory",
        "prereq_text": "",
        "prereqs": []
    },
    "psycns-132": {
        "id": "psycns-132",
        "course_id": "Psy/CNS 132",
        "name": "Computational Reinforcement-learning in Biological and Non-biological Systems",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Reinforcement-learning concerns the computational principles by which animals and artificial agents can learn to select actions in their environment in order to maximize their future rewards. Over the past 50 years there has been a rich interplay between the development and application of reinforcement-learning models in artificial intelligence, and the investigation of reinforcement-learning in biological systems, including humans. This course will review this rich literature, covering the psychology of animal-learning, the neurobiology of reward and reinforcement, and the theoretical basis and application of reinforcement-learning models to biological and non-biological systems.",
        "offered": true,
        "instructors": "O'Doherty",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/computational-reinforcement-learning-in-biological-and-non-biological-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "gebibecnsese-147": {
        "id": "gebibecnsese-147",
        "course_id": "Ge/Bi/BE/CNS/ESE 147",
        "name": "Challenges and Opportunities in Quantitative Ecology",
        "units": "6 units (6-0-0)",
        "terms": "third term",
        "description": "Ecosystems are defined by dynamical interactions between groups of organisms, the communities they constitute, and the physical and chemical conditions and processes occurring in the environment. These dynamics are complex and multiscale across both length and time. This course will explore quantitative approaches that observe, measure, model, and monitor ecosystems and the services that they provide society-and the emerging opportunities that could employ these approaches to improve and strengthen global sustainability when it comes to our own ecology. This course will feature lectures each week from different members of the Caltech faculty working on ecological problems from different angles in order to illustrate how fresh insights can emerge by drawing on diverse ways-of-knowing.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Fischer, Tejada",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/challenges-and-opportunities-in-quantitative-ecology",
        "prereq_text": "",
        "prereqs": []
    },
    "eecnscs-148": {
        "id": "eecnscs-148",
        "course_id": "EE/CNS/CS 148",
        "name": "Advanced Topics in Vision: Large Language and Vision Models",
        "units": "12 units (3-0-9)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Perona, Gkioxari",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/advanced-topics-in-vision:-large-language-and-vision-models",
        "prereq_text": "Prerequisites: CMS/CS/CNS/EE/IDS 155, undergraduate calculus, linear algebra, statistics, computer programming, machine learning. Experience programming in Python, Numpy and PyTorch.",
        "prereqs": [
            "cmscscnseeids-155"
        ]
    },
    "nbbicns-150": {
        "id": "nbbicns-150",
        "course_id": "NB/Bi/CNS 150",
        "name": "Introduction to Neuroscience",
        "units": "10 units (4-0-6)",
        "terms": "third term",
        "description": "General principles of the function and organization of nervous systems, providing both an overview of the subject and a foundation for advanced courses. Topics include the physical and chemical bases for action potentials, synaptic transmission, and sensory transduction; anatomy; development; sensory and motor pathways; memory and learning at the molecular, cellular, and systems level; and the neuroscience of brain diseases. Letter grades only.",
        "offered": true,
        "instructors": "Lester, Lois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/introduction-to-neuroscience",
        "prereq_text": "Prerequisites: Bi 8, 9, or instructor's permission.",
        "prereqs": []
    },
    "nbbicns-152": {
        "id": "nbbicns-152",
        "course_id": "NB/Bi/CNS 152",
        "name": "Neural Circuits and Physiology of Homeostatic Regulation",
        "units": "6 units (2-0-4)",
        "terms": "Second Term",
        "description": "An advanced course of lectures, readings, and student presentations focusing on neural basis of innate body functions such as appetite, sleep, temperature, and osmolality regulation. This course will also cover the gut-to-brain interactions focusing on homeostatic functions. These include genetics, neural manipulation, and viral tracing tools with particular emphasis on data interpretation and limitation of available neuroscience tools.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Oka",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/neural-circuits-and-physiology-of-homeostatic-regulation",
        "prereq_text": "Prerequisites: Graduate standing or NB/Bi/CNS 150, or equivalent.",
        "prereqs": []
    },
    "nbbicns-154": {
        "id": "nbbicns-154",
        "course_id": "NB/Bi/CNS 154",
        "name": "Principles of Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "Third term",
        "description": "This course aims to distill the fundamental tenets of brain science, unlike the voluminous textbook with a similar title. What are the essential facts and ways of understanding in this discipline? How does neuroscience connect to other parts of life science, physics, and mathematics? Lectures and guided reading will touch on a broad range of phenomena from evolution, development, biophysics, computation, behavior, and psychology. Students will benefit from prior exposure to at least some of these domains.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Meister",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/principles-of-neuroscience",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or equivalent.",
        "prereqs": []
    },
    "cmscscnseeids-155": {
        "id": "cmscscnseeids-155",
        "course_id": "CMS/CS/CNS/EE/IDS 155",
        "name": "Machine Learning & Data Mining",
        "units": "12 units (3-3-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Yue",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/machine-learning-&-data-mining",
        "prereq_text": "Prerequisites: CS/CNS/EE 156 a. Having a sufficient background in algorithms, linear algebra, calculus, probability, and statistics, is highly recommended.",
        "prereqs": [
            "cscnsee-156-ab"
        ]
    },
    "cscnsee-156-ab": {
        "id": "cscnsee-156-ab",
        "course_id": "CS/CNS/EE 156 ab",
        "name": "Learning Systems",
        "units": "9 units (3-1-5)",
        "terms": "first, third terms",
        "description": "Introduction to the theory, algorithms, and applications of automated learning. How much information is needed to learn a task, how much computation is involved, and how it can be accomplished. Special emphasis will be given to unifying the different approaches to the subject coming from statistics, function approximation, optimization, pattern recognition, and neural networks.",
        "offered": true,
        "instructors": "Abu-Mostafa",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/learning-systems",
        "prereq_text": "Prerequisites: Ma 2 and CS 2, or equivalent.",
        "prereqs": [
            "cs-2",
            "ma-2102"
        ]
    },
    "nbbicns-157": {
        "id": "nbbicns-157",
        "course_id": "NB/Bi/CNS 157",
        "name": "Comparative Nervous Systems",
        "units": "9 units (2-3-4)",
        "terms": "third term",
        "description": "An introduction to the comparative study of the gross and microscopic structure of nervous systems. Emphasis on the vertebrate nervous system; also, the highly developed central nervous systems found in arthropods and cephalopods. Variation in nervous system structure with function and with behavioral and ecological specializations and the evolution of the vertebrate brain. Letter grades only.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Allman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/comparative-nervous-systems",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "bicns-158": {
        "id": "bicns-158",
        "course_id": "Bi/CNS 158",
        "name": "Vertebrate Evolution",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "An integrative approach to the study of vertebrate evolution combining comparative anatomical, behavioral, embryological, genetic, paleontological, and physiological findings. Special emphasis will be given to: (1) the modification of developmental programs in evolution; (2) homeostatic systems for temperature regulation; (3) changes in the life cycle governing longevity and death; (4) the evolution of brain and behavior. Letter grades only.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Allman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/vertebrate-evolution",
        "prereq_text": "Prerequisites: Bi 1, Bi 8, or instructor's permission.",
        "prereqs": []
    },
    "cscnseeids-159": {
        "id": "cscnseeids-159",
        "course_id": "CS/CNS/EE/IDS 159",
        "name": "Advanced Topics in Machine Learning",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course focuses on current topics in machine learning research. This is a paper reading course, and students are expected to understand material directly from research articles. Students are also expected to present in class, and to do a final project.",
        "offered": true,
        "instructors": "Yue",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/advanced-topics-in-machine-learning",
        "prereq_text": "Prerequisites: CS 155; strong background in statistics, probability theory, algorithms, and linear algebra; background in optimization is a plus as well.",
        "prereqs": []
    },
    "nbbicns-162": {
        "id": "nbbicns-162",
        "course_id": "NB/Bi/CNS 162",
        "name": "Cellular and Systems Neuroscience Laboratory",
        "units": "12 units (2-4-6)",
        "terms": "First Term",
        "description": "A laboratory-based introduction to experimental methods used for electrophysiological studies of the central nervous system. Through the term, students investigate the physiological response properties of neurons in vertebrate and invertebrate brains, using extra- and intracellular recording techniques. Students are instructed in all aspects of experimental procedures, including proper surgical techniques, electrode fabrication, and data analysis. The class also includes a brain dissection and independent student projects that utilize modern digital neuroscience resources.",
        "offered": true,
        "instructors": "Oka, Wagenaar",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/cellular-and-systems-neuroscience-laboratory",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or instructor's permission.",
        "prereqs": []
    },
    "nbbicns-163": {
        "id": "nbbicns-163",
        "course_id": "NB/Bi/CNS 163",
        "name": "The Biological Basis of Neural Disorders",
        "units": "6 units (3-0-3)",
        "terms": "second term",
        "description": "The neuroscience of psychiatric, neurological, and neurodegenerative disorders and of substance abuse, in humans and in animal models. Students master the biological principles including genetics, cell biology, biochemistry, physiology, and circuits. Topics are taught at the research level and include classical and emerging therapeutic approaches and diagnostic strategies.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Lester, Lois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/the-biological-basis-of-neural-disorders",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or instructor's permission.",
        "prereqs": []
    },
    "nbbicns-164": {
        "id": "nbbicns-164",
        "course_id": "NB/Bi/CNS 164",
        "name": "Tools of Neurobiology",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Offers a broad survey of methods and approaches to understanding in modern neurobiology. The focus is on understanding the tools of the discipline, and their use will be illustrated with current research results. Topics include: molecular genetics, disease models, transgenic and knock-in technology, virus tools, tracing methods, gene profiling, light and electron microscopy, optogenetics, optical and electrical recording, neural coding, quantitative behavior, modeling and theory.",
        "offered": true,
        "instructors": "Meister",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/tools-of-neurobiology",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or equivalent.",
        "prereqs": []
    },
    "cscnseeids-165": {
        "id": "cscnseeids-165",
        "course_id": "CS/CNS/EE/IDS 165",
        "name": "Foundations of Machine Learning and Statistical Inference",
        "units": "12 units (3-3-6)",
        "terms": "second term",
        "description": "The course assumes students are comfortable with analysis, probability, statistics, and basic programming. This course will cover core concepts in machine learning and statistical inference. The ML concepts covered are spectral methods (matrices and tensors), non-convex optimization, probabilistic models, neural networks, representation theory, and generalization. In statistical inference, the topics covered are detection and estimation, sufficient statistics, Cramer-Rao bounds, Rao-Blackwell theory, variational inference, and multiple testing. In addition to covering the core concepts, the course encourages students to ask critical questions such as: How relevant is theory in the age of deep learning? What are the outstanding open problems? Assignments will include exploring failure modes of popular algorithms, in addition to traditional problem-solving type questions.",
        "offered": true,
        "instructors": "Anandkumar",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/foundations-of-machine-learning-and-statistical-inference",
        "prereq_text": "Prerequisites: CMS/ACM/EE 122, ACM/EE/IDS 116, CS 156 a, ACM/CS/IDS 157 or instructor's permission.",
        "prereqs": [
            "cmsacmee-122",
            "acmeeids-116"
        ]
    },
    "plcnsnbbipsy-167": {
        "id": "plcnsnbbipsy-167",
        "course_id": "Pl/CNS/NB/Bi/Psy 167",
        "name": "Consciousness",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "One of the last great challenges to our understanding of the world concerns conscious experience. What exactly is it? How is it caused or constituted? And how does it connect with the rest of our science? This course will cover philosophy of mind, cognitive psychology, and cognitive neuroscience in a mixture of lectures and in-class discussion. There are no formal pre-requisites, but background in philosophy (equivalent to Pl 41, Pl 110) and in neuroscience (equivalent to NB/Bi/CNS 150) is strongly recommended and students with such background will be preferentially considered. Limited to 20.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/consciousness",
        "prereq_text": "Prerequisites: None, but strongly suggest prior background in philosophy of mind and basic neurobiology (such as Bi 150).",
        "prereqs": []
    },
    "cscns-171": {
        "id": "cscns-171",
        "course_id": "CS/CNS 171",
        "name": "Computer Graphics Laboratory",
        "units": "12 units (3-6-3)",
        "terms": "first term",
        "description": "This is a challenging course that introduces the basic ideas behind computer graphics and some of its fundamental algorithms. Topics include graphics input and output, the graphics pipeline, sampling and image manipulation, three-dimensional transformations and interactive modeling, basics of physically based modeling and animation, simple shading models and their hardware implementation, and some of the fundamental algorithms of scientific visualization. Students will be required to perform significant implementations.",
        "offered": true,
        "instructors": "Barr",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/computer-graphics-laboratory",
        "prereq_text": "Prerequisites: Extensive programming experience and proficiency in linear algebra, starting with CS 2 and Ma 1 b.",
        "prereqs": [
            "ma-1-d",
            "cs-2",
            "ma-1-abc"
        ]
    },
    "cscns-174": {
        "id": "cscns-174",
        "course_id": "CS/CNS 174",
        "name": "Computer Graphics Projects",
        "units": "12 units (3-6-3)",
        "terms": "third term",
        "description": "This laboratory class offers students an opportunity for independent work including recent computer graphics research. In coordination with the instructor, students select a computer graphics modeling, rendering, interaction, or related algorithm and implement it. Students are required to present their work in class and discuss the results of their implementation and possible improvements to the basic methods. May be repeated for credit with instructor's permission.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Barr",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/computer-graphics-projects",
        "prereq_text": "Prerequisites: Extensive programming experience, CS/CNS 171 or instructor's permission.",
        "prereqs": []
    },
    "cnsbipsynb-176": {
        "id": "cnsbipsynb-176",
        "course_id": "CNS/Bi/Psy/NB 176",
        "name": "Cognition",
        "units": "9 units (4-0-5)",
        "terms": "Third term",
        "description": "The cornerstone of current progress in understanding the mind, the brain, and the relationship between the two is the study of human and animal cognition. This course will provide an in-depth survey and analysis of behavioral observations, theoretical accounts, computational models, patient data, electrophysiological studies, and brain-imaging results on mental capacities such as attention, memory, emotion, object representation, language, and cognitive development.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Shimojo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/cognition",
        "prereq_text": "",
        "prereqs": []
    },
    "cns-180": {
        "id": "cns-180",
        "course_id": "CNS 180",
        "name": "Research in Computation and Neural Systems",
        "units": "",
        "terms": "",
        "description": "Offered to precandidacy students.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/research-in-computation-and-neural-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "cnsbieecsnb-186": {
        "id": "cnsbieecsnb-186",
        "course_id": "CNS/Bi/EE/CS/NB 186",
        "name": "Vision: From Computational Theory to Neuronal Mechanisms",
        "units": "12 units (4-4-4)",
        "terms": "Second term",
        "description": "Lecture, laboratory, and project course aimed at understanding visual information processing, in both machines and the mammalian visual system. The course will emphasize an interdisciplinary approach aimed at understanding vision at several levels: computational theory, algorithms, psychophysics, and hardware (i.e., neuroanatomy and neurophysiology of the mammalian visual system). The course will focus on early vision processes, in particular motion analysis, binocular stereo, brightness, color and texture analysis, visual attention and boundary detection. Students will be required to hand in approximately three homework assignments as well as complete one project integrating aspects of mathematical analysis, modeling, physiology, psychophysics, and engineering.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Meister, Perona, Shimojo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/vision:-from-computational-theory-to-neuronal-mechanisms",
        "prereq_text": "",
        "prereqs": []
    },
    "cnsbiphcsnb-187": {
        "id": "cnsbiphcsnb-187",
        "course_id": "CNS/Bi/Ph/CS/NB 187",
        "name": "Neural Computation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course aims at a quantitative understanding of how the nervous system computes. The goal is to link phenomena across scales from membrane proteins to cells, circuits, brain systems, and behavior. We will learn how to formulate these connections in terms of mathematical models, how to test these models experimentally, and how to interpret experimental data quantitatively. The concepts will be developed with motivation from some of the fascinating phenomena of animal behavior, such as: aerobatic control of insect flight, precise localization of sounds, sensing of single photons, reliable navigation and homing, rapid decision-making during escape, one-shot learning, and large-capacity recognition memory.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Meister",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/neural-computation",
        "prereq_text": "Prerequisites: introductory neuroscience (Bi 150 or equivalent); mathematical methods (Bi 195 or equivalent); scientific programming.",
        "prereqs": []
    },
    "becscnsbi-191-ab": {
        "id": "becscnsbi-191-ab",
        "course_id": "BE/CS/CNS/Bi 191 ab",
        "name": "Biomolecular Computation",
        "units": "9 units (3-0-6) a; (2-4-3) b",
        "terms": "second, third terms",
        "description": "This course investigates computation by molecular systems, emphasizing models of computation based on the underlying physics, chemistry, and organization of biological cells. We will explore programmability, complexity, simulation of, and reasoning about abstract models of chemical reaction networks, molecular folding, molecular self-assembly, and molecular motors, with an emphasis on universal architectures for computation, control, and construction within molecular systems. If time permits, we will also discuss biological example systems such as signal transduction, genetic regulatory networks, and the cytoskeleton; physical limits of computation, reversibility, reliability, and the role of noise, DNA-based computers and DNA nanotechnology. Part a develops fundamental results; part b is a reading and research course: classic and current papers will be discussed, and students will do projects on current research topics.",
        "offered": true,
        "instructors": "Winfree",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/biomolecular-computation",
        "prereq_text": "Prerequisites: None. Recommended: BE/ChE 163, CS 21, or equivalent.",
        "prereqs": [
            "cs-21"
        ]
    },
    "bicnsnb-195": {
        "id": "bicnsnb-195",
        "course_id": "Bi/CNS/NB 195",
        "name": "Mathematics in Biology",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course develops the mathematical methods needed for a quantitative understanding of biological phenomena, including data analysis, formulation of simple models, and the framing of quantitative questions. Topics include: probability and stochastic processes, linear algebra and transforms, dynamical systems, scientific programming.",
        "offered": true,
        "instructors": "Thomson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/mathematics-in-biology",
        "prereq_text": "Prerequisites: calculus.",
        "prereqs": []
    },
    "bebicnsnb-197": {
        "id": "bebicnsnb-197",
        "course_id": "BE/Bi/CNS/NB 197",
        "name": "Mentoring and Outreach",
        "units": "taken in any term, usually 3 units per term and not more than 6 in a single term",
        "terms": "",
        "description": "In consultation with, and with the approval of, a faculty advisor (usually the student’s academic advisor) and the Caltech Center for Teaching, Learning, and Outreach. Students may obtain credit for engaging in volunteer efforts to promote public understanding of science; to mentor and tutor young people and underserved populations; or to otherwise contribute to the diversity, equity, and inclusiveness of the scientific enterprise. Students will be required to fill out short pre- and post-outreach activity forms to describe their proposal and to report on the results. Students may petition their option representative (graduate students) or academic advisor (undergraduate students) if they seek credits beyond the 12-unit limit. Offered pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/mentoring-and-outreach",
        "prereq_text": "",
        "prereqs": []
    },
    "nbbicns-216": {
        "id": "nbbicns-216",
        "course_id": "NB/Bi/CNS 216",
        "name": "Behavior of Mammals",
        "units": "6 units (2-0-4)",
        "terms": "First term",
        "description": "A course of lectures, readings, and discussions focused on the genetic, physiological, and ecological bases of behavior in mammals. A basic knowledge of neuroanatomy and neurophysiology is desirable.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Allman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/behavior-of-mammals",
        "prereq_text": "",
        "prereqs": []
    },
    "nbbicns-217": {
        "id": "nbbicns-217",
        "course_id": "NB/Bi/CNS 217",
        "name": "Central Mechanisms in Perception",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "Reading and discussions of behavioral and electrophysiological studies of the systems for the processing of sensory information in the brain.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Allman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/central-mechanisms-in-perception",
        "prereq_text": "",
        "prereqs": []
    },
    "nbbicns-220": {
        "id": "nbbicns-220",
        "course_id": "NB/Bi/CNS 220",
        "name": "Genetic Dissection of Neural Circuit Function",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "This advanced course will discuss the emerging science of neural \"circuit breaking\" through the application of molecular genetic tools. These include optogenetic and pharmacogenetic manipulations of neuronal activity, genetically based tracing of neuronal connectivity, and genetically based indicators of neuronal activity. Both viral and transgenic approaches will be covered, and examples will be drawn from both the invertebrate and vertebrate literature. Interested CNS or other graduate students who have little or no familiarity with molecular biology will be supplied with the necessary background information. Lectures and student presentations from the current literature.",
        "offered": true,
        "instructors": "Anderson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/genetic-dissection-of-neural-circuit-function",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or equivalent. Open to advanced (junior or senior) undergraduates only and with instructor permission.",
        "prereqs": []
    },
    "bicnsbenb-230": {
        "id": "bicnsbenb-230",
        "course_id": "Bi/CNS/BE/NB 230",
        "name": "Optogenetic and CLARITY Methods in Experimental Neuroscience",
        "units": "9 units (3-2-4)",
        "terms": "third term",
        "description": "The class covers the theoretical and practical aspects of using (1) optogenetic sensors and actuators to visualize and modulate the activity of neuronal ensembles; and (2) CLARITY approaches for anatomical mapping and phenotyping using tissue-hydrogel hybrids. The class offers weekly hands-on LAB exposure for opsin viral production and delivery to neurons, recording of light-modulated activity, and tissue clearing, imaging, and 3D reconstruction of fluorescent samples. Lecture topics include: opsin design (including natural and artificial sources), delivery (genetic targeting, viral transduction), light activation requirements (power requirements, wavelength, fiberoptics), compatible readout modalities (electrophysiology, imaging); design and use of methods for tissue clearing (tissue stabilization by polymers/hydrogels and selective extractions, such as of lipids for increased tissue transparency and macromolecule access). Class will discuss applications of these methods to neuronal circuits (case studies based on recent literature).\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Gradinaru",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/optogenetic-and-clarity-methods-in-experimental-neuroscience",
        "prereq_text": "Prerequisites: Graduate standing or NB/Bi/CNS 150 or equivalent or instructor's permission.",
        "prereqs": []
    },
    "bibecnsnb-241": {
        "id": "bibecnsnb-241",
        "course_id": "Bi/BE/CNS/NB 241",
        "name": "Spatial Genomics",
        "units": "9 units (1-8-0)",
        "terms": "third term",
        "description": "Maximum enrollment: 12. Applications of spatial genomics technology to various biological samples. Projects will be selected to represent problems in neurobiology, developmental biology and translational medicine. Emphasis will be placed on generating experimental data and analysis of data with machine learning algorithms for segmentation and clustering cells with single cell genomics tools, and preparation for publication.",
        "offered": true,
        "instructors": "Cai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/spatial-genomics",
        "prereq_text": "Prerequisites: Instructor's permission.",
        "prereqs": []
    },
    "cnsbinb-247": {
        "id": "cnsbinb-247",
        "course_id": "CNS/Bi/NB 247",
        "name": "Cerebral Cortex",
        "units": "6 units (2-0-4)",
        "terms": "second term",
        "description": "A general survey of the structure and function of the cerebral cortex. Topics include cortical anatomy, functional localization, and newer computational approaches to understanding cortical processing operations. Motor cortex, sensory cortex (visual, auditory, and somatosensory cortex), association cortex, and limbic cortex. Emphasis is on using animal models to understand human cortical function and includes correlations between animal studies and human neuropsychological and functional imaging literature.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Andersen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/cerebral-cortex",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or equivalent.",
        "prereqs": []
    },
    "nbbicns-250-c": {
        "id": "nbbicns-250-c",
        "course_id": "NB/Bi/CNS 250 c",
        "name": "Topics in Systems Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The class focuses on quantitative studies of problems in systems neuroscience. Students will study classical work such as Hodgkin and Huxley's landmark papers on the ionic basis of the action potential, and will move from the study of interacting currents within neurons to the study of systems of interacting neurons. Topics will include lateral inhibition, mechanisms of motion tuning, local learning rules and their consequences for network structure and dynamics, oscillatory dynamics and synchronization across brain circuits, and formation and computational properties of topographic neural maps. The course will combine lectures and discussions, in which students and faculty will examine papers on systems neuroscience, usually combining experimental and theoretical/modeling components.",
        "offered": true,
        "instructors": "Siapas",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/topics-in-systems-neuroscience",
        "prereq_text": "Prerequisites: graduate standing.",
        "prereqs": []
    },
    "cns-251": {
        "id": "cns-251",
        "course_id": "CNS 251",
        "name": "Human Brain Mapping: Theory and Practice",
        "units": "9 units (2-1-6)",
        "terms": "second term",
        "description": "A course in functional brain imaging. An overview of contemporary brain imaging techniques, usefulness of brain imaging compared to other techniques available to the modern neuroscientist. Review of what is known about the physical and biological bases of the signals being measured. Design and implementation of a brain imaging experiment and analysis of data (with a particular emphasis on fMRI).\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/human-brain-mapping:-theory-and-practice",
        "prereq_text": "",
        "prereqs": []
    },
    "psybicns-255": {
        "id": "psybicns-255",
        "course_id": "Psy/Bi/CNS 255",
        "name": "Topics in Emotion and Social Cognition",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Emotions are at the forefront of most human endeavors. Emotions aid us in decision-making (gut feelings), help us remember, torment us, yet have ultimately helped us to survive. Over the past few decades, we have begun to characterize the neural systems that extend from primitive affective response such as fight or flight to the complex emotions experienced by humans including guilt, envy, empathy and social pain. This course will begin with an in-depth examination of the neurobiological systems that underlie negative and positive emotions and move onto weekly discussions, based on assigned journal articles that highlight both rudimentary and complex emotions. The final weeks will be devoted to exploring how the neurobiological systems are disrupted in affective disorders including anxiety, aggression and psychopathy. In addition to these discussions and readings, each student will be required to write a review paper or produce a short movie on a topic related to one of the emotions discussed in these seminars and its underlying neural mechanisms.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/topics-in-emotion-and-social-cognition",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or instructor's permission.",
        "prereqs": []
    },
    "cnsbinb-256": {
        "id": "cnsbinb-256",
        "course_id": "CNS/Bi/NB 256",
        "name": "Brain-machine interfaces",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "A brain-machine interface (BMI) records neural activity, decodes the intent of the participant, and generates control signals to operate assistive devices. Bi-directional BMIs can write signals back into the brain though electrical stimulation based on the recorded neural activity. These neurotechnologies have been advancing rapidly with therapeutic potential for several neurological diseases and disorders. Through lectures and reviews of the literature, the course will cover motor BMIs for robotics and communication, cognitive neural prosthetics, stimulation to restore sensation, and different invasive and non-invasive recording and stimulation technologies.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Andersen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/brain-machine-interfaces",
        "prereq_text": "",
        "prereqs": []
    },
    "cns-280": {
        "id": "cns-280",
        "course_id": "CNS 280",
        "name": "Research in Computation and Neural Systems",
        "units": "Hours and units by arrangement",
        "terms": "",
        "description": "For graduate students admitted to candidacy in computation and neural systems.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/research-in-computation-and-neural-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "sspsycns-285": {
        "id": "sspsycns-285",
        "course_id": "SS/Psy/CNS 285",
        "name": "Topics in Social, Cognitive, and Decision Sciences",
        "units": "3 units (1.5-0-1.5)",
        "terms": "second term",
        "description": "The goal of this course is to introduce graduate students to current research questions in cognitive sciences, political science, and economics. Select faculty will present their research background, methods, and a sampling of current studies. Background readings and pdf of presentation will be provided.",
        "offered": true,
        "instructors": "Pomatto",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/topics-in-social,-cognitive,-and-decision-sciences",
        "prereq_text": "",
        "prereqs": []
    },
    "cnsbi-286-abc": {
        "id": "cnsbi-286-abc",
        "course_id": "CNS/Bi 286 abc",
        "name": "Special Topics in Computation and Neural Systems",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Students may register with permission of the responsible faculty member.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/cns/special-topics-in-computation-and-neural-systems",
        "prereq_text": "",
        "prereqs": []
    }
}