{
    "ec-11": {
        "id": "ec-11",
        "course_id": "Ec 11",
        "name": "Introduction to Economics",
        "units": "9 units (3-2-4)",
        "terms": "first, second terms",
        "description": "An introduction to economic methodology, models, and institutions. Includes both basic microeconomics and an introduction to modern approaches to macroeconomic issues. Students are required to participate in economics experiments.",
        "offered": true,
        "instructors": "Jimenez, Rangel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/introduction-to-economics",
        "prereq_text": "",
        "prereqs": []
    },
    "ec-97": {
        "id": "ec-97",
        "course_id": "Ec 97",
        "name": "Undergraduate Research",
        "units": "",
        "terms": "any term",
        "description": "This course offers advanced undergraduates the opportunity to pursue research in Economics individually or in a small group. Graded pass/fail.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/undergraduate-research",
        "prereq_text": "Prerequisites: Advanced economics and instructor's permission.",
        "prereqs": []
    },
    "ec-98-abc": {
        "id": "ec-98-abc",
        "course_id": "Ec 98 abc",
        "name": "Senior Research and Thesis",
        "units": "",
        "terms": "",
        "description": "Senior economics majors wishing to undertake research may elect a variable number of units, not to exceed 12 in any one term, for such work under the direction of a member of the economics faculty.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/senior-research-and-thesis",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "ec-101": {
        "id": "ec-101",
        "course_id": "Ec 101",
        "name": "Selected Topics in Economics",
        "units": "",
        "terms": "offered by announcement",
        "description": "Topics to be determined by instructor.",
        "offered": true,
        "instructors": "Staff, visiting lecturers",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/selected-topics-in-economics",
        "prereq_text": "",
        "prereqs": []
    },
    "ec-105": {
        "id": "ec-105",
        "course_id": "Ec 105",
        "name": "Firms, Competition, and Industrial Organization",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "A study of how technology affects issues of market structure and how market structure affects observable economic outcomes, such as prices, profits, advertising, and research and development expenditures. Emphasis will be on how the analytic tools developed in the course can be used to examine particular industries-especially those related to internet commerce-in detail. Each student is expected to write one substantial paper.",
        "offered": true,
        "instructors": "Xin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/firms,-competition,-and-industrial-organization",
        "prereq_text": "Prerequisites: Ec 11 or equivalent.",
        "prereqs": []
    },
    "ecpsy-106": {
        "id": "ecpsy-106",
        "course_id": "Ec/Psy 106",
        "name": "Behavioral Game Theory",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "In this course we will examine game theories that are explicitly meant to describe behavior of humans and other species. Prominent models are those with level-k hierarchies, quantal response equilibrium (QRE) and cursed equilibrium. Most of the data is experimental evidence from a wide variety of games. We will also learn about field evidence, mostly about mixed strategies and application of level-k hierarchies to firms' decisions. Data include biological measures such as response times, eye-tracking, fMRI and evidence from psychiatric disorders. Students are expected to replicate an existing experiment (individual students) or work in small teams to create and run a new experiment.",
        "offered": true,
        "instructors": "Camerer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/behavioral-game-theory",
        "prereq_text": "Prerequisites: PS/Ec 172.",
        "prereqs": []
    },
    "ecpsy-108": {
        "id": "ecpsy-108",
        "course_id": "Ec/Psy 108",
        "name": "Foundations of Behavioral Economics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Sprenger",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/foundations-of-behavioral-economics",
        "prereq_text": "",
        "prereqs": []
    },
    "ecpsy-109": {
        "id": "ecpsy-109",
        "course_id": "Ec/Psy 109",
        "name": "Frontiers in Behavioral Economics",
        "units": "9 units (3-0-6)",
        "terms": "",
        "description": "This course will study topics in behavioral economics demonstrating departures from the classic economics assumptions of rationality and pure self-interest. We will study evidence of these departures, models that have been designed to capture these preferences, and applications of these models to important economic questions. Topics will include biases and heuristics, risk preferences, self-control, strategic uncertainty, and social preferences, among others. The course will be based in readings from both classic and modern research. Methodologically, the course will combine both theoretical and empirical evidence of the mentioned above topics.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/frontiers-in-behavioral-economics",
        "prereq_text": "Prerequisites: Ec 11.",
        "prereqs": []
    },
    "ec-110": {
        "id": "ec-110",
        "course_id": "Ec 110",
        "name": "Public Economics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "The role of the government is multifold, from providing public goods to intervening in market failures. Additionally, some policies are motivated by paternalistic concerns of citizens not acting in their own best interest. Through a mix of theory, experiments, and empirical analysis, we will cover methods of assessing individual and societal welfare, the identification and measurement of consumer biases, and theories of when and how the government should intervene in the economy. We will cover topics such as taxation, education, savings, and insurance, and the policies and nudges designed to implement these goals.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/public-economics",
        "prereq_text": "Prerequisites: Ec 11.",
        "prereqs": []
    },
    "ecacmcs-112": {
        "id": "ecacmcs-112",
        "course_id": "Ec/ACM/CS 112",
        "name": "Bayesian Statistics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course provides an introduction to Bayesian Statistics and its applications to data analysis in various fields. Topics include: discrete models, regression models, hierarchical models, model comparison, and MCMC methods. The course combines an introduction to basic theory with a hands-on emphasis on learning how to use these methods in practice so that students can apply them in their own work. Previous familiarity with frequentist statistics is useful but not required.",
        "offered": true,
        "instructors": "Rangel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/bayesian-statistics",
        "prereq_text": "Prerequisites: Ma 3, ACM/EE/IDS 116 or equivalent.",
        "prereqs": [
            "acmeeids-116",
            "ma-3103"
        ]
    },
    "ec-117": {
        "id": "ec-117",
        "course_id": "Ec 117",
        "name": "Matching Markets",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "We will tackle the fundamental question of how to allocate resources and organize exchange in the absence of prices. Examples includes finding a partner, allocating students to schools, and matching donors to patients in the context of organ transplantations. While the main focus will be on formal models, we will also reason about the practical implications of the theory.",
        "offered": true,
        "instructors": "Caradonna",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/matching-markets",
        "prereq_text": "",
        "prereqs": []
    },
    "bemecese-119": {
        "id": "bemecese-119",
        "course_id": "BEM/Ec/ESE 119",
        "name": "Environmental Economics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course provides a survey from the perspective of economics of public policy issues regarding the management of natural resources and the protection of environmental quality. The course covers both conceptual topics and recent and current applications. Included are principles of environmental and resource economics, management of nonrenewable and renewable resources, and environmental policy with the focus on air pollution problems, both local problems (smog) and global problems (climate change).",
        "offered": true,
        "instructors": "Druckenmiller",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/environmental-economics",
        "prereq_text": "Prerequisites: Ec 11 or equivalent.",
        "prereqs": []
    },
    "bemec-120": {
        "id": "bemec-120",
        "course_id": "BEM/Ec 120",
        "name": "Introduction to Sports Science",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The use of large data sets and innovative statistical methods has revolutionized professional and intercollegiate sports. This course introduces students to the academic and professional world of contemporary sports science. The course will meet biweekly with instructor lectures on sports science and with guest speakers from collegiate and professional sports. Students will be introduced to the primary data sources for sports science, to methods used to collect sports performance and outcomes data, and to the statistical tools used for sports analytics (for example, logistic regression, regression trees and random forest, network models, time series, and natural language processing). Students will be responsible for weekly writing or homework assignments based on readings and speaker presentations, as well as a quarter-long sports analytics research project. Students should have some background in econometrics, statistics and probability, data science, or machine learning.",
        "offered": true,
        "instructors": "Alvarez and Eslinger",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/introduction-to-sports-science",
        "prereq_text": "",
        "prereqs": []
    },
    "ec-121-a": {
        "id": "ec-121-a",
        "course_id": "Ec 121 a",
        "name": "Theory of Value",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Saito",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/theory-of-value",
        "prereq_text": "Prerequisites: Ec 11 and Ma 1b (may be taken concurrently).",
        "prereqs": [
            "ma-1-d",
            "ma-1-abc"
        ]
    },
    "ec-121-b": {
        "id": "ec-121-b",
        "course_id": "Ec 121 b",
        "name": "Theory of Value",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Saito",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/theory-of-value",
        "prereq_text": "Prerequisites: Ec 11 and Ma 1b (may be taken concurrently). Ec 121a is highly recommended as background, but is not a prerequisite.",
        "prereqs": [
            "ma-1-d",
            "ma-1-abc"
        ]
    },
    "ec-122": {
        "id": "ec-122",
        "course_id": "Ec 122",
        "name": "Econometrics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "The application of statistical techniques to the analysis of economic data.",
        "offered": true,
        "instructors": "Sherman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/econometrics",
        "prereq_text": "Prerequisites: Ma 3.",
        "prereqs": [
            "ma-3103"
        ]
    },
    "ec-123": {
        "id": "ec-123",
        "course_id": "Ec 123",
        "name": "Analysis of Consumer Choices",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course uses econometric tools to analyze choices made by people among a finite set of alternatives. Discrete choice models have been used to understand consumer behavior in many domains - shopping between brands (Toyota vs. BMW), where to go to college (Caltech or MIT), choosing between modes of transportation (car, metro, Uber, or bicycle), etc. Models studied include logit, nested logit, probit, and mixed logit, etc. Simulation techniques that allow estimation of otherwise intractable models will also be discussed.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/analysis-of-consumer-choices",
        "prereq_text": "Prerequisites: Ec 122 is recommended but is not a prerequisite.",
        "prereqs": []
    },
    "ecps-124": {
        "id": "ecps-124",
        "course_id": "Ec/PS 124",
        "name": "Identification Problems in the Social Sciences",
        "units": "9 units (3- 0-6)",
        "terms": "second term",
        "description": "Statistical inference in the social sciences is a difficult enterprise whereby we combine data and assumptions to draw conclusions about the world we live in. We then make decisions, for better or for worse, based on these conclusions. A simultaneously intoxicating and sobering thought! Strong assumptions about the data generating process can lead to strong but often less than credible (perhaps incredible?) conclusions about our world. Weaker assumptions can lead to weaker but more credible conclusions. This course explores the range of inferences that are possible when we entertain a range of assumptions about how data is generated. We explore these ideas in the context of a number of applications of interest to social scientists.",
        "offered": true,
        "instructors": "Sherman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/identification-problems-in-the-social-sciences",
        "prereq_text": "Prerequisites: Ec 122.",
        "prereqs": []
    },
    "ec-125": {
        "id": "ec-125",
        "course_id": "Ec 125",
        "name": "Understanding Behavioral Heterogeneity",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will review existing data in several areas of controlled economic decision-making with a focus on individual and group differences. Theoretical and empirical approaches for understanding and decomposing heterogeneity into preference and stochastic components will be presented. Students will gain exposure to prominent experimental techniques, estimation of models of heterogeneity and heterogeneous treatment effects, and out-of-sample prediction exercises.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/understanding-behavioral-heterogeneity",
        "prereq_text": "Prerequisites: permission of instructor.",
        "prereqs": []
    },
    "idsecps-126": {
        "id": "idsecps-126",
        "course_id": "IDS/Ec/PS 126",
        "name": "Applied Data Analysis",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Fundamentally, this course is about making arguments with numbers and data. Data analysis for its own sake is often quite boring, but becomes crucial when it supports claims about the world. A convincing data analysis starts with the collection and cleaning of data, a thoughtful and reproducible statistical analysis of it, and the graphical presentation of the results. This course will provide students with the necessary practical skills, chiefly revolving around statistical computing, to conduct their own data analysis. This course is not an introduction to statistics or computer science. I assume that students are familiar with at least basic probability and statistical concepts up to and including regression.",
        "offered": true,
        "instructors": "Katz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/applied-data-analysis",
        "prereq_text": "Prerequisites: Ma 3/103 or ACM/EE/IDS 116, Ec 122 or IDS/ACM/CS 157 or Ma 112 a.",
        "prereqs": [
            "acmeeids-116",
            "idsacmcs-157",
            "ma-112-ab",
            "ma-3103"
        ]
    },
    "psec-128": {
        "id": "psec-128",
        "course_id": "PS/Ec 128",
        "name": "Introduction to Public Health Economics and Policy",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will cover the basic concepts and principles of health economics and challenges in health policy implementation. By studying this course, students will establish economic thinking and be able to flexibly use economic methods to analyze practical problems in the field of health care. Students will also learn about the application of machine learning in public health. This course combines theory and methodology. The teaching goal focuses on students' ability to analyze and solve practical problems. Interactive teaching is done through group discussions and topic debates around case studies. Each chapter consists of a theory and case analysis. The case discussion will focus on basic theories and methods and highlight the hot issues in the current medical and health system. The exam will be an open-book exam, with class discussions accounting for 40%, and the final exam accounting for 60%.",
        "offered": true,
        "instructors": "Cao",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/introduction-to-public-health-economics-and-policy",
        "prereq_text": "",
        "prereqs": []
    },
    "ec-129": {
        "id": "ec-129",
        "course_id": "Ec 129",
        "name": "Economic History of the United States",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An examination of certain analytical and quantitative tools and their application to American economic development. Each student is expected to write two substantial papers-drafts will be read by instructor and revised by students.",
        "offered": true,
        "instructors": "Janas",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/economic-history-of-the-united-states",
        "prereq_text": "Prerequisites: Ec 11.",
        "prereqs": []
    },
    "ec-130": {
        "id": "ec-130",
        "course_id": "Ec 130",
        "name": "Economic History of Europe from the Middle Ages to the Twentieth Century",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Employs the theoretical and quantitative techniques of economics to help explore and explain the development of the European cultural area between 1000 and 1980. Topics include the rise of commerce, the demographic transition, the Industrial Revolution, and changes in inequality, international trade, social spending, property rights, and capital markets. Each student is expected to write nine weekly essays and a term paper.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/economic-history-of-europe-from-the-middle-ages-to-the-twentieth-century",
        "prereq_text": "Prerequisites: Ec 11.",
        "prereqs": []
    },
    "ec-135": {
        "id": "ec-135",
        "course_id": "Ec 135",
        "name": "Economics of Uncertainty and Information",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "An analysis of the effects of uncertainty and information on economic decisions. Included among the topics are individual and group decision making under uncertainty, expected utility maximization, insurance, financial markets and speculation, product quality and advertisement, and the value of information.",
        "offered": true,
        "instructors": "Agranov",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/economics-of-uncertainty-and-information",
        "prereq_text": "Prerequisites: Ec 11.",
        "prereqs": []
    },
    "ec-136": {
        "id": "ec-136",
        "course_id": "Ec 136",
        "name": "Behavioral Decision Theory",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course is a course in decision theory that emphasizes axiomatic methods and mathematical analysis. It navigates not only through the traditional normative approach but also through more recent behavioral (i.e., descriptive) approaches to decision-making, incorporating psychological insights. We explore essential topics in decision theory such as dynamic choice, stochastic choice, ambiguity aversion, expected utility, and revealed preferences. This in-depth study provides students with a sophisticated understanding of the frameworks governing decision making, emphasizing the role of rigorous analysis and mentioning empirical evidence found in experimental economics and psychology. This course offers valuable insights into understanding individual behaviors across both economic and financial contexts as well as in broader scenarios, providing students with the mathematical proficiency required to analyze decision-making processes rigorously.",
        "offered": true,
        "instructors": "Saito",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/behavioral-decision-theory",
        "prereq_text": "Prerequisites: Ma 3.",
        "prereqs": [
            "ma-3103"
        ]
    },
    "ec-140": {
        "id": "ec-140",
        "course_id": "Ec 140",
        "name": "Economic Progress",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course examines the contemporary literature on economic growth and development from both a theoretical and historical/empirical perspective. Topics include a historical overview of economic progress and the lack thereof; simple capital accumulation models; equilibrium/ planning models of accumulation; endogenous growth models; empirical tests of convergence; the measurement and role of technological advancement; and the role of trade, institutions, property rights, human capital, and culture.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/economic-progress",
        "prereq_text": "Prerequisites: Ec 11; Ec 122 recommended.",
        "prereqs": []
    },
    "cmscsecee-144": {
        "id": "cmscsecee-144",
        "course_id": "CMS/CS/Ec/EE 144",
        "name": "Networks: Structure & Economics",
        "units": "12 units (3-4-5)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Mazumdar",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/networks:-structure-&-economics",
        "prereq_text": "Prerequisites: Ma 2, Ma 3, Ma/CS 6 a, and CS 38, or instructor permission.",
        "prereqs": [
            "macs-6106-abc",
            "ma-2102",
            "cs-38",
            "ma-3103"
        ]
    },
    "csec-149": {
        "id": "csec-149",
        "course_id": "CS/Ec 149",
        "name": "Algorithmic Economics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will equip students to engage with active research at the intersection of social and information sciences, including: algorithmic game theory and mechanism design; auctions; matching markets; and learning in games.",
        "offered": true,
        "instructors": "Niemeyer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/algorithmic-economics",
        "prereq_text": "",
        "prereqs": []
    },
    "psec-172": {
        "id": "psec-172",
        "course_id": "PS/Ec 172",
        "name": "Game Theory",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course is an introduction to non-cooperative game theory, with applications to political science and economics. It covers the theories of normal-form games and extensive-form games, and introduces solutions concepts that are relevant for situations of complete and incomplete information. The basic theory of repeated games is introduced. Applications are to auction theory and asymmetric information in trading models, cheap talk and voting rules in congress, among many others.",
        "offered": true,
        "instructors": "Pomatto",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/game-theory",
        "prereq_text": "Prerequisites: Ec 11 or PS 12 and one from the following list: ACM 116, ACM 117, Ma 3, or Ma/ACM/IDS 140 ab.",
        "prereqs": [
            "maacmids-140-abc",
            "ma-3103",
            "cmsacm-117"
        ]
    },
    "esemeesteccheee-179": {
        "id": "esemeesteccheee-179",
        "course_id": "ESE/ME/EST/Ec/ChE/EE 179",
        "name": "Climate Change Impacts, Mitigation and Adaptation",
        "units": "3 units (3-0-0)",
        "terms": "second term",
        "description": "Climate change has already begun to impact life on the planet, and will continue in the coming decades. This class will explore particular causes and impacts of climate change, technologies to mitigate or adapt to those impacts, and the economic and social costs associated with them - particular focus will be paid to distributional issues, environmental and racial justice and equity intersections. The course will consist of 3-4 topical modules, each focused on a specific impact or sector (e.g. the electricity or transportation sector, climate impacts of food and agriculture, increasing fires and floods). Each module will contain lectures/content on the associated climate science background, engineering/technological developments to combat the issue, and an exploration of the economics and the inequities that exacerbate the situation, followed by group discussion and synthesis of the different perspectives.",
        "offered": true,
        "instructors": "Wennberg, Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/climate-change-impacts,-mitigation-and-adaptation",
        "prereq_text": "",
        "prereqs": []
    },
    "ec-181-ab": {
        "id": "ec-181-ab",
        "course_id": "Ec 181 ab",
        "name": "Convex Analysis and Economic Theory",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Introduction to the use of convex analysis in economic theory. Includes separating hyperplane theorems, continuity and differentiability properties of convex and concave functions, support functions, subdifferentials, Fenchel conjugates, saddlepoint theorem, theorems of the alternative, polyhedra, linear programming, and duality in graphs. Introduction to discrete convex analysis and matroids. Emphasis is on the finite-dimensional case, but infinite-dimensional spaces will be discussed. Applications to core convergence, cost and production functions, mathematical finance, decision theory, incentive design, and game theory.\n Part b not offered 2024-25.",
        "offered": true,
        "instructors": "Tamuz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/convex-analysis-and-economic-theory",
        "prereq_text": "Prerequisites: Ma 1. Ec 121 a is recommended.",
        "prereqs": [
            "ma-1-d",
            "ma-1-abc"
        ]
    },
    "cmsecids-248": {
        "id": "cmsecids-248",
        "course_id": "CMS/Ec/IDS 248",
        "name": "Topics in Learning and Games",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course is an advanced topics course intended for graduate students with a background in optimization, linear systems theory, probability and statistics, and an interest in learning, game theory, and decision making more broadly. We will cover the basics of game theory including equilibrium notions and efficiency, learning algorithms for equilibrium seeking, and discuss connections to optimization, machine learning, and decision theory. While there will be some initial overview of game theory, the focus of the course will be on modern topics in learning as applied to games in both cooperative and non-cooperative settings. We will also discuss games of partial information and stochastic games as well as hierarchical decision-making problems (e.g., incentive and information design).\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ec/topics-in-learning-and-games",
        "prereq_text": "",
        "prereqs": []
    }
}