{
    "ee-1": {
        "id": "ee-1",
        "course_id": "EE 1",
        "name": "The Science of Data, Signals, and Information",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Electrical Engineering has given rise to many key developments at the interface between the physical world and the information world. Fundamental ideas in data acquisition, sampling, signal representation, and quantification of information have their origin in electrical engineering. This course introduces these ideas and discusses signal representations, the interplay between time and frequency domains, difference equations and filtering, noise and denoising, data transmission over channels with limited capacity, signal quantization, feedback and neural networks, and how humans interpret data and information. Applications in various areas of science and engineering are covered. Satisfies the menu requirement of the Caltech core curriculum.\n Not offered 2024-25",
        "offered": false,
        "instructors": "Vaidyanathan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/the-science-of-data,-signals,-and-information",
        "prereq_text": "",
        "prereqs": []
    },
    "ee-2102": {
        "id": "ee-2102",
        "course_id": "EE 2/102",
        "name": "Electrical Engineering Entrepreneurial and Research Seminar",
        "units": "1 unit",
        "terms": "second term",
        "description": "Required for EE graduates and undergraduates. Weekly seminar given by successful entrepreneurs and EE faculty, broadly describing their path to success and introducing different areas of research in electrical engineering: circuits and VLSI, communications, control, devices, images and vision, information theory, learning and pattern recognition, MEMS and micromachining, networks, electromagnetics and opto-electronics, RF and microwave circuits and antennas, robotics and signal processing, specifically, research going on at Caltech and in the industry.",
        "offered": true,
        "instructors": "Yang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/electrical-engineering-entrepreneurial-and-research-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "eeme-7": {
        "id": "eeme-7",
        "course_id": "EE/ME 7",
        "name": "Introduction to Mechatronics",
        "units": "6 units (2-3-1)",
        "terms": "first term",
        "description": "Mechatronics is the multi-disciplinary design of electro-mechanical systems. This course is intended to give the student a basic introduction to such systems. The course will focus on the implementations of sensor and actuator systems, the mechanical devices involved and the electrical circuits needed to interface with them. The class will consist of lectures and short labs where the student will be able to investigate the concepts discussed in lecture. Topics covered include motors, piezoelectric devices, light sensors, ultrasonic transducers, and navigational sensors such as accelerometers and gyroscopes. Graded pass/fail.",
        "offered": true,
        "instructors": "George",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/introduction-to-mechatronics",
        "prereq_text": "",
        "prereqs": []
    },
    "aphee-9": {
        "id": "aphee-9",
        "course_id": "APh/EE 9",
        "name": "Solid-State Electronics for Integrated Circuits",
        "units": "6 units (2-2-2)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Scherer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/solid-state-electronics-for-integrated-circuits",
        "prereq_text": "",
        "prereqs": []
    },
    "eecs-10-ab": {
        "id": "eecs-10-ab",
        "course_id": "EE/CS 10 ab",
        "name": "Introduction to Digital Logic and Embedded Systems",
        "units": "6 units (2-3-1)",
        "terms": "second, third terms",
        "description": "This course is intended to give the student a basic understanding of the major hardware and software principles involved in the specification and design of embedded systems. The course will cover basic digital logic, programmable logic devices, CPU and embedded system architecture, and embedded systems programming principles (interfacing to hardware, events, user interfaces, and multi-tasking).",
        "offered": true,
        "instructors": "George",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/introduction-to-digital-logic-and-embedded-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "ee-13": {
        "id": "ee-13",
        "course_id": "EE 13",
        "name": "Electronic System Prototyping",
        "units": "3 units (0-3-0)",
        "terms": "first term",
        "description": "This course is intended to introduce the student to the technologies and techniques used to fabricate electronic systems. The course will cover the skills needed to use standard CAD tools for circuit prototyping. This includes schematic capture and printed circuit board design. Additionally, soldering techniques will be covered for circuit fabrication as well as some basic debugging skills. Each student will construct a system from schematic to PCB to soldering the final prototype.",
        "offered": true,
        "instructors": "George",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/electronic-system-prototyping",
        "prereq_text": "",
        "prereqs": []
    },
    "aphee-23": {
        "id": "aphee-23",
        "course_id": "APh/EE 23",
        "name": "Demonstration Lectures in Classical and Quantum Photonics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course focuses on basic concepts needed for understanding classical and quantum optical phenomena and their applications to modern optical components and systems. Classical optical phenomena including interference, dispersion, birefringence, diffraction, laser oscillation, and the applications of these phenomena in optical systems employing multiple-beam interferometry, Fourier-transform image processing, holography, electro-optic modulation, optical detection and heterodyning will be covered. Quantum optical phenomena like single photon emission will be discussed. Examples and demonstrations will be selected from optical communications, lidar, adaptive optical systems, nano-photonic devices and quantum communications. Visits to research laboratories in optics are expected at the end of the course. This class is optimal for sophomores/juniors/seniors who want to get their first serious exposure to optics but also might work for well-prepared and motivated First-Year students.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/demonstration-lectures-in-classical-and-quantum-photonics",
        "prereq_text": "Prerequisites: Ph 1 abc is required; a class on waves (Ph2a or Ph12a) is strongly encouraged but not required; prior knowledge of quantum mechanics is not required..",
        "prereqs": [
            "ph-1-abc"
        ]
    },
    "aphee-24": {
        "id": "aphee-24",
        "course_id": "APh/EE 24",
        "name": "Introductory Optics and Photonics Laboratory",
        "units": "9 units (1-3-5)",
        "terms": "third term",
        "description": "Laboratory experiments to acquaint students with the basic aspects of Optics and Photonics Research and Technology. This course offers hands-on experience and teaches students how to handle major optical and electronic equipment and conduct experiments. It is useful for those who are thinking about a career utilizing both optical and electronic tools. Experiments encompass some of the topics and concepts covered in APh 23.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/introductory-optics-and-photonics-laboratory",
        "prereq_text": "Prerequisites: Ph 1 abc is required; APh 23 and a class on waves (Ph2a or Ph12a) are strongly encouraged but not required.",
        "prereqs": [
            "ph-1-abc"
        ]
    },
    "eeaph-40": {
        "id": "eeaph-40",
        "course_id": "EE/APh 40",
        "name": "Physics of Electrical Engineering",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course provides an introduction to the fundamental physics of modern device technologies in electrical engineering used for sensing, communications, computing, imaging, and displays. The course overviews topics including semiconductor physics, quantum mechanics, electromagnetics, and optics with emphasis on physical operation principles of devices. Example technologies include integrated circuits, optical and wireless communications, micromechanical systems, lasers, high-resolution displays, LED lighting, and imaging.",
        "offered": true,
        "instructors": "Marandi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/physics-of-electrical-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "ee-44": {
        "id": "ee-44",
        "course_id": "EE 44",
        "name": "Deterministic Analysis of Systems and Circuits",
        "units": "12 units (4-0-8)",
        "terms": "first term",
        "description": "Modeling of physical systems by conversion to mathematical abstractions with an emphasis on electrical systems. Introduction to deterministic methods of system analysis, including matrix representations, time-domain analysis using impulse and step responses, signal superposition and convolution, Heaviside operator solutions to systems of linear differential equations, transfer functions, Laplace and Fourier transforms. The course emphasizes examples from the electrical circuits (e.g., energy and data converters, wired and wireless communication channels, instrumentation, and sensing) , while providing some exposure to other selected applications of the deterministic analysis tool (e.g., public opinion, acoustic cancellation, financial markets, traffic, drug delivery, mechanical systems, news cycles, and heat exchange).",
        "offered": true,
        "instructors": "Hajimiri",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/deterministic-analysis-of-systems-and-circuits",
        "prereq_text": "Prerequisites: Ph 1 abc, can be taken concurrently with Ma 2 and Ph 2 a.",
        "prereqs": [
            "ph-2-abc",
            "ma-2102",
            "ph-1-abc"
        ]
    },
    "ee-45": {
        "id": "ee-45",
        "course_id": "EE 45",
        "name": "Electronics Systems and Laboratory",
        "units": "12 units (3-3-6)",
        "terms": "third term",
        "description": "Fundamentals of electronic circuits and systems. Lectures on diodes, transistors, small-signal analysis, frequency- domain analysis, application of Laplace transform, gain stages, differential signaling, operational amplifiers, introduction to radio and analog communication systems. Laboratory sessions on transient response, steady-state sinusoidal response and phasors, diodes, transistors, amplifiers.",
        "offered": true,
        "instructors": "Emami",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/electronics-systems-and-laboratory",
        "prereq_text": "Prerequisites: EE 44.",
        "prereqs": [
            "ee-44"
        ]
    },
    "ee-55": {
        "id": "ee-55",
        "course_id": "EE 55",
        "name": "Mathematics of Electrical Engineering",
        "units": "12 units (4-0-8)",
        "terms": "first term",
        "description": "Linear algebra and probability are fundamental to many areas of study in electrical engineering. This class provides the mathematical foundations of these topics with a view to their utility to electrical engineers. Topics include vector spaces, matrices and linear transformations, the singular value decomposition, elementary probability and random variables, common distributions that arise in electrical engineering, and data-fitting. Connections to signal processing, systems, communications, optimization, and machine learning are highlighted.",
        "offered": true,
        "instructors": "Chandrasekaran",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/mathematics-of-electrical-engineering",
        "prereq_text": "Prerequisites: Ma 1 abc.",
        "prereqs": [
            "ma-1-d",
            "ma-1-abc"
        ]
    },
    "cseeme-75-abc": {
        "id": "cseeme-75-abc",
        "course_id": "CS/EE/ME 75 abc",
        "name": "Multidisciplinary Systems Engineering",
        "units": "3 units (2-0-1), 6 units (2-0-4), or 9 units (2-0-7) first term; 6 units (2-3-1), 9 units (2-6-1), or 12 units (2-9-1) second and third terms",
        "terms": "first, second, third terms",
        "description": "This course presents the fundamentals of modern multidisciplinary systems engineering in the context of a substantial design project. Students from a variety of disciplines will conceive, design, implement, and operate a system involving electrical, information, and mechanical engineering components. Specific tools will be provided for setting project goals and objectives, managing interfaces between component subsystems, working in design teams, and tracking progress against tasks. Students will be expected to apply knowledge from other courses at Caltech in designing and implementing specific subsystems. During the first two terms of the course, students will attend project meetings and learn some basic tools for project design, while taking courses in CS, EE, and ME that are related to the course project. During the third term, the entire team will build, document, and demonstrate the course design project, which will differ from year to year. First-year undergraduate students must receive permission from the lead instructor to enroll.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/multidisciplinary-systems-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "ee-80-abc": {
        "id": "ee-80-abc",
        "course_id": "EE 80 abc",
        "name": "Senior Thesis",
        "units": "9 units",
        "terms": "first, second, third terms",
        "description": "Individual research project, carried out under the supervision of a member of the electrical engineering faculty. Project must include significant design effort. A written thesis must be submitted to the department. Open only to senior electrical engineering majors. Not offered on a pass/fail basis.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/senior-thesis",
        "prereq_text": "Prerequisites: instructor's permission, which should be obtained during the junior year to allow sufficient time for planning the research.",
        "prereqs": []
    },
    "ee-90": {
        "id": "ee-90",
        "course_id": "EE 90",
        "name": "Analog Electronics Project Laboratory",
        "units": "9 units (1-8-0)",
        "terms": "third term",
        "description": "A structured laboratory course that gives the student the opportunity to design and build a simple analog electronics project. The goal is to gain familiarity with circuit design and construction, component selection, CAD support, and debugging techniques.",
        "offered": true,
        "instructors": "Ohanian",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/analog-electronics-project-laboratory",
        "prereq_text": "Prerequisites: EE 45 or EE 85.",
        "prereqs": [
            "ee-45"
        ]
    },
    "ee-91-ab": {
        "id": "ee-91-ab",
        "course_id": "EE 91 ab",
        "name": "Experimental Projects in Electronic Circuits",
        "units": "9 units (1-8-0) first term; 6 units (1-5-0) second term",
        "terms": "",
        "description": "",
        "offered": true,
        "instructors": "Ohanian",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/experimental-projects-in-electronic-circuits",
        "prereq_text": "Prerequisites: EE 90; Recommended: EE/ME 007, EE/CS 10 ab, EE 13 and EE/MedE 114 ab (may be taken concurrently). Open to seniors; others only with instructor's permission.",
        "prereqs": [
            "ee-13",
            "ee-90",
            "eecs-10-ab"
        ]
    },
    "ee-99": {
        "id": "ee-99",
        "course_id": "EE 99",
        "name": "Advanced Work in Electrical Engineering",
        "units": "",
        "terms": "",
        "description": "Special problems relating to electrical engineering will be arranged. For undergraduates; students should consult with their advisers. Graded pass/fail.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/advanced-work-in-electrical-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "ee-105-ab": {
        "id": "ee-105-ab",
        "course_id": "EE 105 ab",
        "name": "Electrical Engineering Seminar",
        "units": "1 unit",
        "terms": "first, third terms",
        "description": "All candidates for the M.S. degree in electrical engineering are required to attend any graduate seminar in any division each week of each term. Graded pass/fail.",
        "offered": true,
        "instructors": "Yang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/electrical-engineering-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "acmee-106-ab": {
        "id": "acmee-106-ab",
        "course_id": "ACM/EE 106 ab",
        "name": "Introductory Methods of Computational Mathematics",
        "units": "12 units (3-0-9)",
        "terms": "first, second terms",
        "description": "The sequence covers the introductory methods in both theory and implementation of numerical linear algebra, approximation theory, ordinary differential equations, and partial differential equations. The linear algebra parts cover basic methods such as direct and iterative solution of large linear systems, including LU decomposition, splitting method (Jacobi iteration, Gauss-Seidel iteration); eigenvalue and vector computations including the power method, QR iteration and Lanczos iteration; nonlinear algebraic solvers. The approximation theory includes data fitting; interpolation using Fourier transform, orthogonal polynomials and splines; least square method, and numerical quadrature. The ODE parts include initial and boundary value problems. The PDE parts include finite difference and finite element for elliptic/parabolic/hyperbolic equations. Study of numerical PDE will include stability analysis. Programming is a significant part of the course.",
        "offered": true,
        "instructors": "Hou",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/introductory-methods-of-computational-mathematics",
        "prereq_text": "Prerequisites: For ACM/EE 106 a, Ma 1 abc, Ma 2, Ma 3, ACM 11; for ACM/EE 106 b, ACM 95/100 ab or equivalent.",
        "prereqs": [
            "acmee-106-ab",
            "acm-11",
            "ma-1-d",
            "ma-2102",
            "acm-95100-ab",
            "ma-3103",
            "ma-1-abc"
        ]
    },
    "aphee-109": {
        "id": "aphee-109",
        "course_id": "APh/EE 109",
        "name": "Introduction to the Micro/Nanofabrication Lab",
        "units": "9 units (0-6-3)",
        "terms": "first, second, third terms",
        "description": "Introduction to techniques of micro-and nanofabrication, including solid-state, optical, and microfluidic devices. Students will be trained to use fabrication and characterization equipment available in the applied physics micro- and nanofabrication lab. Topics include Schottky diodes, MOS capacitors, light-emitting diodes, microlenses, microfluidic valves and pumps, atomic force microscopy, scanning electron microscopy, and electron-beam writing.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/introduction-to-the-micro/nanofabrication-lab",
        "prereq_text": "",
        "prereqs": []
    },
    "ee-110-abc": {
        "id": "ee-110-abc",
        "course_id": "EE 110 abc",
        "name": "Embedded Systems Design Laboratory",
        "units": "9 units (3-4-2); 9 units (1-8-0)",
        "terms": "first, second, third terms",
        "description": "",
        "offered": true,
        "instructors": "George",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/embedded-systems-design-laboratory",
        "prereq_text": "",
        "prereqs": []
    },
    "ee-111": {
        "id": "ee-111",
        "course_id": "EE 111",
        "name": "Signal-Processing Systems and Transforms",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "An introduction to continuous and discrete time signals and systems with emphasis on digital signal processing systems. Study of the Fourier transform, Fourier series, z-transforms, and the fast Fourier transform as applied in electrical engineering. Sampling theorems for continuous to discrete-time conversion. Difference equations for digital signal processing systems, digital system realizations with block diagrams, analysis of transient and steady state responses, and connections to other areas in science and engineering.",
        "offered": true,
        "instructors": "Vaidyanathan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/signal-processing-systems-and-transforms",
        "prereq_text": "Prerequisites: Ma 1.",
        "prereqs": [
            "ma-1-d",
            "ma-1-abc"
        ]
    },
    "ee-112": {
        "id": "ee-112",
        "course_id": "EE 112",
        "name": "Introduction to Signal Processing from Data",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Fundamentals of digital signal processing, extracting information from data by linear filtering, recursive and non-recursive filters, structural and flow graph representations for filters, data-adaptive filtering, multirate sampling, efficient data representations with filter banks, Nyquist and sub-Nyquist sampling, sensor array signal processing, estimating direction of arrival (DOA) information from noisy data, and spectrum estimation.",
        "offered": true,
        "instructors": "Vaidyanathan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/introduction-to-signal-processing-from-data",
        "prereq_text": "Prerequisites: EE 111 or equivalent. Math 3 recommended.",
        "prereqs": [
            "ee-111"
        ]
    },
    "ee-113": {
        "id": "ee-113",
        "course_id": "EE 113",
        "name": "Feedback and Control Circuits",
        "units": "9 units (3-3-3)",
        "terms": "second term",
        "description": "This class studies the design and implementation of feedback and control circuits. The course begins with an introduction to basic feedback circuits, using both op amps and transistors. These circuits are used to study feedback principles, including circuit topologies, stability, and compensation. Following this, basic control techniques and circuits are studied, including PID (Proportional-Integrated-Derivative) control, digital control, and fuzzy control. There is a significant laboratory component to this course, in which the student will be expected to design, build, analyze, test, and measure the circuits and systems discussed in the lectures.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "George",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/feedback-and-control-circuits",
        "prereq_text": "Prerequisites: EE 45 (may be taken concurrently) or equivalent.",
        "prereqs": [
            "ee-45"
        ]
    },
    "eemede-114-ab": {
        "id": "eemede-114-ab",
        "course_id": "EE/MedE 114 ab",
        "name": "Analog Circuit Design",
        "units": "12 units (4-0-8)",
        "terms": "second, third terms",
        "description": "Analysis and design of analog circuits at the transistor level. Emphasis on design-oriented analysis, quantitative performance measures, and practical circuit limitations. Circuit performance evaluated by hand calculations and computer simulations. Recommended for juniors, seniors, and graduate students. Topics include: review of physics of bipolar and MOS transistors, low-frequency behavior of single-stage and multistage amplifiers, current sources, active loads, differential amplifiers, operational amplifiers, high-frequency circuit analysis using time- and transfer constants, high-frequency response of amplifiers, feedback in electronic circuits, stability of feedback amplifiers, and noise in electronic circuits, and supply and temperature independent biasing. A number of the following topics will be covered each year: trans-linear circuits, switched capacitor circuits, data conversion circuits (A/D and D/A), continuous-time Gm.C filters, phase locked loops, oscillators, and modulators.",
        "offered": true,
        "instructors": "Hajimiri",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/analog-circuit-design",
        "prereq_text": "Prerequisites: EE 44 or equivalent.",
        "prereqs": [
            "ee-44"
        ]
    },
    "eemede-115": {
        "id": "eemede-115",
        "course_id": "EE/MedE 115",
        "name": "Micro-/Nano-scales Electro-Optics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "The course will cover various electro-optical phenomena and devices in the micro-/nano-scales. We will discuss basic properties of light, imaging, aberrations, eyes, detectors, lasers, micro-optical components and systems, scalar diffraction theory, interference/interferometers, holography, dielectric/plasmonic waveguides, and various Raman techniques. Topics may vary.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/micro-/nano-scales-electro-optics",
        "prereq_text": "Prerequisites: Introductory electromagnetic class and consent of the instructor.",
        "prereqs": []
    },
    "acmeeids-116": {
        "id": "acmeeids-116",
        "course_id": "ACM/EE/IDS 116",
        "name": "Introduction to Probability Models",
        "units": "9 units (3-1-5)",
        "terms": "first term",
        "description": "This course introduces students to the fundamental concepts, methods, and models of applied probability and stochastic processes. The course is application oriented and focuses on the development of probabilistic thinking and intuitive feel of the subject rather than on a more traditional formal approach based on measure theory. The main goal is to equip science and engineering students with necessary probabilistic tools they can use in future studies and research. Topics covered include sample spaces, events, probabilities of events, discrete and continuous random variables, expectation, variance, correlation, joint and marginal distributions, independence, moment generating functions, law of large numbers, central limit theorem, random vectors and matrices, random graphs, Gaussian vectors, branching, Poisson, and counting processes, general discrete- and continuous-timed processes, auto- and cross-correlation functions, stationary processes, power spectral densities.",
        "offered": true,
        "instructors": "Zuev",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/introduction-to-probability-models",
        "prereq_text": "Prerequisites: Ma 3 or EE 55, some familiarity with MATLAB, e.g. ACM 11, is desired.",
        "prereqs": [
            "acm-11",
            "ma-3103",
            "ee-55"
        ]
    },
    "meeeest-117": {
        "id": "meeeest-117",
        "course_id": "ME/EE/EST 117",
        "name": "Energy Technology and Policy",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Energy technologies and the impact of government policy. Fossil fuels, nuclear power, and renewables for electricity production and transportation. Resource models and climate change policies. New and emerging technologies.",
        "offered": true,
        "instructors": "Blanquart",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/energy-technology-and-policy",
        "prereq_text": "Prerequisites: Ph 1 abc, Ch 1 ab and Ma 1 abc.",
        "prereqs": [
            "ma-1-d",
            "ma-1-abc",
            "ph-1-abc"
        ]
    },
    "phapheebe-118-ab": {
        "id": "phapheebe-118-ab",
        "course_id": "Ph/APh/EE/BE 118 ab",
        "name": "Physics of Measurement",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course explores the fundamental underpinnings of experimental measurements from the perspectives of information, noise, coupling, responsivity, and backaction. Its overarching goal is to enable students to develop intuition about a diversity of real measurement systems and the means to critically evaluate them. This involves developing a standard framework for estimating the ultimate and practical limits to information that can be extracted from a real measurement system. Topics will include the fundamental nature of information and signals, physical signal transduction and responsivity, the physical origin of noise processes, modulation, frequency conversion, synchronous detection, signal-sampling techniques, digitization, signal transforms, spectral analyses, and correlation methods. The first term will cover the essential underpinnings, while second-term topics will vary year-by-year according to interest. Among possible Ph 118 b topics are: high frequency, microwave, and fast time-domain measurements; biological interfaces and biosensing; the physics of functional brain imaging; and quantum measurement.\n Part b not offered 2024-25.",
        "offered": true,
        "instructors": "Roukes",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/physics-of-measurement",
        "prereq_text": "Prerequisites: Ph 127, APh 105, or equivalent, or permission from instructor.",
        "prereqs": [
            "ph-127-ab",
            "ph-105"
        ]
    },
    "phaphee-118-c": {
        "id": "phaphee-118-c",
        "course_id": "Ph/APh/EE 118 c",
        "name": "Physics of Measurement: Moonbounce and Beyond - Microwave Scattering for Communications and Metrology",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Roukes",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/physics-of-measurement:-moonbounce-and-beyond---microwave-scattering-for-communications-and-metrology",
        "prereq_text": "Prerequisites: Ph 118a, and a course in microwave physics and engineering (e.g., Ph 118b, EE 153, or equivalent), or permission from the instructor.",
        "prereqs": [
            "ee-153"
        ]
    },
    "eecs-119-abc": {
        "id": "eecs-119-abc",
        "course_id": "EE/CS 119 abc",
        "name": "Advanced Digital Systems Design",
        "units": "9 units (3-3-3) first, second term; 9 units (1-8-0) third term",
        "terms": "first, second, third terms",
        "description": "Advanced digital design as it applies to the design of systems using PLDs and ASICs (in particular, gate arrays and standard cells). The course covers both design and implementation details of various systems and logic device technologies. The emphasis is on the practical aspects of ASIC design, such as timing, testing, and fault grading. Topics include synchronous design, state machine design, arithmetic circuit design, application-specific parallel computer design, design for testability, CPLDs, FPGAs, VHDL, standard cells, timing analysis, fault vectors, and fault grading. Students are expected to design and implement both systems discussed in the class as well as self-proposed systems using a variety of technologies and tools.\n Given in alternate years;offered 2024-25.",
        "offered": true,
        "instructors": "George",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/advanced-digital-systems-design",
        "prereq_text": "Prerequisites: EE/CS 10 a or CS 24.",
        "prereqs": [
            "cs-24",
            "eecs-10-ab"
        ]
    },
    "eeaph-120": {
        "id": "eeaph-120",
        "course_id": "EE/APh 120",
        "name": "Physical Optics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Mirhosseini",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/physical-optics",
        "prereq_text": "Prerequisites: Intermediate-level familiarity with Fourier transforms and linear systems analysis. Basic understanding of Maxwell's electromagnetic theory (EE/APh 40 and EE 44, or equivalent).",
        "prereqs": [
            "ee-44",
            "eeaph-40"
        ]
    },
    "ee-121": {
        "id": "ee-121",
        "course_id": "EE 121",
        "name": "Great Ideas in Data Science",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Data science is a broad discipline that encompasses statistics, signal processing, machine learning, information theory, inverse problems, games, networks, and much else. This course provides a survey of some of the big ideas in these areas that have had significant conceptual and practical impact.\n not offered 2024-25",
        "offered": true,
        "instructors": "Chandrasekaran",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/great-ideas-in-data-science",
        "prereq_text": "Prerequisites: linear algebra and probability at the level of EE 55 or of ACM 104 + ACM 116.",
        "prereqs": [
            "ee-55"
        ]
    },
    "cmsacmee-122": {
        "id": "cmsacmee-122",
        "course_id": "CMS/ACM/EE 122",
        "name": "Mathematical Optimization",
        "units": "12 units (4-0-8)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Chandrasekaran",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/mathematical-optimization",
        "prereq_text": "Prerequisites: ACM 11 and ACM 104, or instructor's permission.",
        "prereqs": [
            "acm-11"
        ]
    },
    "eeaph-123": {
        "id": "eeaph-123",
        "course_id": "EE/APh 123",
        "name": "Advanced Lasers and Photonics Laboratory",
        "units": "9 units (1-3-5)",
        "terms": "first term",
        "description": "This course focuses on hands-on experience with advanced techniques related to lasers, optics, and photonics. Students have the opportunity to build and run several experiments and analyze data. Covered topics include laser-based microscopy, spectroscopy, nonlinear optics, quantum optics, ultrafast optics, adaptive optics, and integrated photonics. Limited enrollment.",
        "offered": true,
        "instructors": "Marandi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/advanced-lasers-and-photonics-laboratory",
        "prereq_text": "",
        "prereqs": []
    },
    "eemede-124": {
        "id": "eemede-124",
        "course_id": "EE/MedE 124",
        "name": "Mixed-mode Integrated Circuits",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Introduction to selected topics in mixed-signal circuits and systems in highly scaled CMOS technologies. Design challenges and limitations in current and future technologies will be discussed through topics such as clocking (PLLs and DLLs), clock distribution networks, sampling circuits, high-speed transceivers, timing recovery techniques, equalization, monitor circuits, power delivery, and converters (A/D and D/A). A design project is an integral part of the course.",
        "offered": true,
        "instructors": "Emami",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/mixed-mode-integrated-circuits",
        "prereq_text": "Prerequisites: EE 45 a or equivalent.",
        "prereqs": [
            "ee-45"
        ]
    },
    "eecsmede-125": {
        "id": "eecsmede-125",
        "course_id": "EE/CS/MedE 125",
        "name": "Digital Circuit Design with FPGAs and VHDL",
        "units": "9 units (3-6-0)",
        "terms": "third term",
        "description": "Study of programmable logic devices (FPGAs). Detailed study of the VHDL language, accompanied by tutorials of popular synthesis and simulation tools. Review of combinational circuits (both logic and arithmetic), followed by VHDL code for combinational circuits and corresponding FPGA-implemented designs. Review of sequential circuits, followed by VHDL code for sequential circuits and corresponding FPGA-implemented designs. Review of finite state machines, followed by VHDL code for state machines and corresponding FPGA-implemented designs. Final project. The course includes a wide selection of real-world projects, implemented and tested using FPGA boards.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/digital-circuit-design-with-fpgas-and-vhdl",
        "prereq_text": "Prerequisites: EE/CS 10 or equivalent.",
        "prereqs": [
            "eecs-10-ab"
        ]
    },
    "eemacs-126-ab": {
        "id": "eemacs-126-ab",
        "course_id": "EE/Ma/CS 126 ab",
        "name": "Information Theory",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "This class treats Shannon's mathematical theory of communication and the tools used to derive and understand it. The class is organized around fundamental questions and their solutions, leading to central results such as Shannon's source coding, channel coding, and rate-distortion theorems. Quantities that arise en route to these solutions include entropy, relative entropy, and mutual information for discrete and continuous random variables. The course explores the calculation of fundamental communication limits like entropy rate, capacity, and rate-distortion functions under a variety of source and communication channel models (e.g., memoryless, Markov, ergodic, and Gaussian). The course begins with a foundational discussion of the simplest communication scenarios and then expands to include topics like universal source coding, the role of side information in source coding and communications, and the generalization of earlier results to network systems. Network information theory topics include multiuser data compression and communication over multiple access channels, broadcast channels, and multiterminal networks. Philosophical and practical implications of the theory are also explored. This course, when combined with EE 112, EE/Ma/CS/IDS 127, EE/CS 161, and EE/CS/IDS 167, should prepare the student for research in information theory, coding theory, wireless communications, and/or data compression.\n Part b not offered 2024-25",
        "offered": true,
        "instructors": "Effros",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/information-theory",
        "prereq_text": "Prerequisites: Ma 3.",
        "prereqs": [
            "ma-3103"
        ]
    },
    "eemacsids-127": {
        "id": "eemacsids-127",
        "course_id": "EE/Ma/CS/IDS 127",
        "name": "Error-Correcting Codes",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course develops from first principles the theory and practical implementation of the most important techniques for combating errors in digital transmission and storage systems. Topics include highly symmetric linear codes, such as Hamming, Reed-Muller, and Polar codes; algebraic block codes, such as Reed-Solomon and BCH codes, including a self-contained introduction to the theory of finite fields; and low-density parity-check codes. Students will become acquainted with encoding and decoding algorithms, design principles and performance evaluation of codes.\n not offered 2024-25.",
        "offered": true,
        "instructors": "Kostina",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/error-correcting-codes",
        "prereq_text": "Prerequisites: EE 55 or equivalent.",
        "prereqs": [
            "ee-55"
        ]
    },
    "ee-128-ab": {
        "id": "ee-128-ab",
        "course_id": "EE 128 ab",
        "name": "Selected Topics in Digital Signal Processing",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "The course focuses on several important topics that are basic to modern signal processing. Topics include multirate signal processing material such as decimation, interpolation, filter banks, polyphase filtering, advanced filtering structures and nonuniform sampling, optimal statistical signal processing material such as linear prediction and antenna array processing, and signal processing for communication including optimal transceivers.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/selected-topics-in-digital-signal-processing",
        "prereq_text": "Prerequisites: EE 111 and EE/CS/IDS 160 or equivalent required, and EE 112 or equivalent recommended.",
        "prereqs": [
            "ee-112",
            "eecsids-160",
            "ee-111"
        ]
    },
    "mecsee-129": {
        "id": "mecsee-129",
        "course_id": "ME/CS/EE 129",
        "name": "Experimental Robotics",
        "units": "9 units (1-7-1)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Niemeyer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/experimental-robotics",
        "prereq_text": "Prerequisites: some experience with (i) Python programming (CS1, CS2, or equivalent), (ii) Hardware, Sensors, and Signal Processing (EE/ME7, ME8, EE1, or similar), and/or (iii) Robotic Devices (ME13, ME72, or related), as evidenced to the instructor.   Not recommended for first-year students.",
        "prereqs": []
    },
    "aphee-130": {
        "id": "aphee-130",
        "course_id": "APh/EE 130",
        "name": "Electromagnetic Theory for Photonic Devices",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Faraon",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/electromagnetic-theory-for-photonic-devices",
        "prereq_text": "",
        "prereqs": []
    },
    "aphee-131": {
        "id": "aphee-131",
        "course_id": "APh/EE 131",
        "name": "Light Interaction with Atomic Systems-Lasers",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Light-matter interaction, spontaneous and induced transitions in atoms and semiconductors. Absorption, amplification, and dispersion of light in atomic media. Principles of laser oscillation, generic types of lasers including semiconductor lasers, mode-locked lasers. Frequency combs in lasers. The spectral properties and coherence of laser light.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Vahala",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/light-interaction-with-atomic-systems-lasers",
        "prereq_text": "Prerequisites: APh/EE 130.",
        "prereqs": [
            "aphee-130"
        ]
    },
    "aphee-132": {
        "id": "aphee-132",
        "course_id": "APh/EE 132",
        "name": "Special Topics in Photonics and Optoelectronics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Interaction of light and matter, spontaneous and stimulated emission, laser rate equations, mode-locking, Q-switching, semiconductor lasers. Optical detectors and amplifiers; noise characterization of optoelectronic devices. Propagation of light in crystals, electro-optic effects and their use in modulation of light; introduction to nonlinear optics. Optical properties of nanostructures.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/special-topics-in-photonics-and-optoelectronics",
        "prereq_text": "",
        "prereqs": []
    },
    "mecsee-133-ab": {
        "id": "mecsee-133-ab",
        "course_id": "ME/CS/EE 133 ab",
        "name": "Robotics",
        "units": "9 units (3-2-4)",
        "terms": "first, second terms",
        "description": "The course develops the core concepts of robotics. The first quarter focuses on classical robotic manipulation, including topics in rigid body kinematics and dynamics. It develops planar and 3D kinematic formulations and algorithms for forward and inverse computations, Jacobians, and manipulability. The second quarter transitions to planning, navigation, and perception. Topics include configuration space, sample-based planners, A* and D* algorithms, to achieve collision-free motions. Course work transitions from homework and programming assignments to more open-ended team-based projects.",
        "offered": true,
        "instructors": "Niemeyer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/robotics",
        "prereq_text": "Prerequisites: ME/CS/EE 129, or Python programming experience, evidenced to instructor.",
        "prereqs": [
            "mecsee-129"
        ]
    },
    "mecsee-134": {
        "id": "mecsee-134",
        "course_id": "ME/CS/EE 134",
        "name": "Robotic Systems",
        "units": "9 units (1-7-1)",
        "terms": "second term",
        "description": "This course builds up, and brings to practice, the elements of robotic systems at the intersection of hardware, kinematics and control, computer vision, and autonomous behaviors. It presents selected topics from these domains, focusing on their integration into a full sense-think-act robot. The lectures will drive team-based projects, progressing from building custom robotic arms (5 to 7 degrees of freedom) to writing all necessary software (utilizing the Robotics Operating system, ROS). Teams are required to implement and customize general concepts for their selected tasks. Working systems will autonomously operate and demonstrate their capabilities during final presentations.",
        "offered": true,
        "instructors": "Niemeyer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/robotic-systems",
        "prereq_text": "Prerequisites: ME/CS/EE 133 a, or with permission of instructor.",
        "prereqs": [
            "mecsee-133-ab"
        ]
    },
    "eecsest-135": {
        "id": "eecsest-135",
        "course_id": "EE/CS/EST 135",
        "name": "Power System Analysis",
        "units": "9 units (3-3-3)",
        "terms": "first term",
        "description": "We are at the beginning of a historic transformation to decarbonize our energy system. This course introduces the basics of power systems analysis: phasor representation, 3-phase transmission system, transmission line models, transformer models, per-unit analysis, network matrix, power flow equations, power flow algorithms, optimal powerflow (OPF) problems, unbalanced power flow analysis and optimization,swing dynamics and stability.",
        "offered": true,
        "instructors": "Low",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/power-system-analysis",
        "prereq_text": "Prerequisites: EE 44, Ma 2, or equivalent.",
        "prereqs": [
            "ee-44",
            "ma-2102"
        ]
    },
    "eemacsids-136": {
        "id": "eemacsids-136",
        "course_id": "EE/Ma/CS/IDS 136",
        "name": "Information Theory and Applications",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This class introduces information measures such as entropy, information divergence, mutual information, information density, and establishes the fundamental importance of those measures in data compression, statistical inference, and error control. The course does not require a prior exposure to information theory; it is complementary to EE 126a.",
        "offered": true,
        "instructors": "Kostina",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/information-theory-and-applications",
        "prereq_text": "Prerequisites: EE 55 or equivalent.",
        "prereqs": [
            "ee-55"
        ]
    },
    "cseeids-143": {
        "id": "cseeids-143",
        "course_id": "CS/EE/IDS 143",
        "name": "Networks: Algorithms & Architecture",
        "units": "12 units (3-4-5)",
        "terms": "first term",
        "description": "Social networks, the web, and the internet are essential parts of our lives, and we depend on them every day. CS/EE/IDS 143 and CMS/CS/EE/IDS 144 study how they work and the \"big\" ideas behind our networked lives. In this course, the questions explored include: Why is an hourglass architecture crucial for the design of the Internet? Why doesn't the Internet collapse under congestion? How are cloud services so scalable? How do algorithms for wireless and wired networks differ? For all these questions and more, the course will provide a mixture of both mathematical analysis and hands-on labs. The course expects students to be comfortable with graph theory, probability, and basic programming.",
        "offered": true,
        "instructors": "Wierman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/networks:-algorithms-&-architecture",
        "prereq_text": "Prerequisites: Ma 2, Ma 3, Ma/CS 6 a, and CS 38, or instructor permission.",
        "prereqs": [
            "macs-6106-abc",
            "ma-2102",
            "cs-38",
            "ma-3103"
        ]
    },
    "cmscsecee-144": {
        "id": "cmscsecee-144",
        "course_id": "CMS/CS/Ec/EE 144",
        "name": "Networks: Structure & Economics",
        "units": "12 units (3-4-5)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Mazumdar",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/networks:-structure-&-economics",
        "prereq_text": "Prerequisites: Ma 2, Ma 3, Ma/CS 6 a, and CS 38, or instructor permission.",
        "prereqs": [
            "macs-6106-abc",
            "ma-2102",
            "cs-38",
            "ma-3103"
        ]
    },
    "csee-145": {
        "id": "csee-145",
        "course_id": "CS/EE 145",
        "name": "Projects in Networking",
        "units": "9 units (0-0-9)",
        "terms": "third term",
        "description": "Students are expected to execute a substantial project in networking, write up a report describing their work, and make a presentation.",
        "offered": true,
        "instructors": "Wierman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/projects-in-networking",
        "prereq_text": "Prerequisites: Either CMS/CS/EE/IDS 144 or CS/IDS 142 in the preceding term, or instructor permission.",
        "prereqs": []
    },
    "csee-146": {
        "id": "csee-146",
        "course_id": "CS/EE 146",
        "name": "Control and Optimization of Networks",
        "units": "9 units (3-3-3)",
        "terms": "second term",
        "description": "This is a research-oriented course meant for undergraduates and beginning graduate students who want to learn about current research topics in networks such as the Internet, power networks, social networks, etc. The topics covered in the course will vary, but will be pulled from current research in the design, analysis, control, and optimization of networks.",
        "offered": true,
        "instructors": "Low",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/control-and-optimization-of-networks",
        "prereq_text": "Prerequisites: Ma 2, Ma 3 or instructor's permission.",
        "prereqs": [
            "ma-2102",
            "ma-3103"
        ]
    },
    "eecs-147": {
        "id": "eecs-147",
        "course_id": "EE/CS 147",
        "name": "Digital Ventures Design",
        "units": "9 units (3-3-3)",
        "terms": "first term",
        "description": "This course aims to offer the scientific foundations of analysis, design, development, and launching of innovative digital products and study elements of their success and failure. The course provides students with an opportunity to experience combined team-based design, engineering, and entrepreneurship. The lectures present a disciplined step-by-step approach to develop new ventures based on technological innovation in this space, and with invited speakers, cover topics such as market analysis, user/product interaction and design, core competency and competitive position, customer acquisition, business model design, unit economics and viability, and product planning. Throughout the term students will work within an interdisciplinary team of their peers to conceive an innovative digital product concept and produce a business plan and a working prototype. The course project culminates in a public presentation and a final report. Every year the course and projects focus on a particular emerging technology theme.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/digital-ventures-design",
        "prereq_text": "",
        "prereqs": []
    },
    "eecnscs-148": {
        "id": "eecnscs-148",
        "course_id": "EE/CNS/CS 148",
        "name": "Advanced Topics in Vision: Large Language and Vision Models",
        "units": "12 units (3-0-9)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Perona, Gkioxari",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/advanced-topics-in-vision:-large-language-and-vision-models",
        "prereq_text": "Prerequisites: CMS/CS/CNS/EE/IDS 155, undergraduate calculus, linear algebra, statistics, computer programming, machine learning. Experience programming in Python, Numpy and PyTorch.",
        "prereqs": [
            "cmscscnseeids-155"
        ]
    },
    "eeaph-149": {
        "id": "eeaph-149",
        "course_id": "EE/APh 149",
        "name": "Frontiers of Nonlinear Photonics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course overviews recent advances in photonics with emphasis on devices and systems that utilize nonlinearities. A wide range of nonlinearities in the classical and quantum regimes is covered, including but not limited to second- and third-order nonlinear susceptibilities, Kerr, Raman, optomechanical, thermal, and multi-photon nonlinearities. A wide range of photonic platforms is also considered ranging from bulk to ultrafast and integrated photonics. The course includes an overview of the concepts as well as review and discussion of recent literature and advances in the field.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/frontiers-of-nonlinear-photonics",
        "prereq_text": "",
        "prereqs": []
    },
    "ee-150": {
        "id": "ee-150",
        "course_id": "EE 150",
        "name": "Topics in Electrical Engineering",
        "units": "",
        "terms": "terms to be arranged",
        "description": "Content will vary from year to year, at a level suitable for advanced undergraduate or beginning graduate students. Topics will be chosen according to the interests of students and staff. Visiting faculty may present all or portions of this course from time to time.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/topics-in-electrical-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "ee-151": {
        "id": "ee-151",
        "course_id": "EE 151",
        "name": "Electromagnetic Engineering",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Foundations of circuit theory-electric fields, magnetic fields, transmission lines, and Maxwell's equations, with engineering applications.",
        "offered": true,
        "instructors": "Yang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/electromagnetic-engineering",
        "prereq_text": "Prerequisites: EE 45.",
        "prereqs": [
            "ee-45"
        ]
    },
    "ee-152": {
        "id": "ee-152",
        "course_id": "EE 152",
        "name": "High Frequency Systems Laboratory",
        "units": "12 units (2-3-7)",
        "terms": "first term",
        "description": "The student will develop a strong, working knowledge of high-frequency systems covering RF and microwave frequencies. The essential building blocks of these systems will be studied along with the fundamental system concepts employed in their use. The first part of the course will focus on the design and measurement of core system building blocks; such as filters, amplifiers, mixers, and oscillators. Lectures will introduce key concepts followed by weekly laboratory sessions where the student will design and characterize these various system components. During the second part of the course, the student will develop their own high-frequency system, focused on a topic within remote sensing, communications, radar, or one within their own field of research.",
        "offered": true,
        "instructors": "Russell",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/high-frequency-systems-laboratory",
        "prereq_text": "Prerequisites: EE 45 or equivalent. EE 153 recommended.",
        "prereqs": [
            "ee-153",
            "ee-45"
        ]
    },
    "ee-153": {
        "id": "ee-153",
        "course_id": "EE 153",
        "name": "Microwave Circuits and Antennas",
        "units": "12 units (3-2-7)",
        "terms": "second term",
        "description": "High-speed circuits for wireless communications, radar and broadcasting. Lectures on the theory of transmission lines, characteristic impedance, maximum power transfer, impedance matching, signal-flow graphs, power dividers, coupled lines, even and odd mode analyses, couplers, filters, noise, amplifiers, oscillators, mixers and antennas. Labs on the design, fabrication and measurement of microwave circuits such as microstrip filters, power dividers, directional couplers, low-noise amplifiers and oscillators. Computer-Aided Design (CAD) software package: Microwave Office.",
        "offered": true,
        "instructors": "Antsos",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/microwave-circuits-and-antennas",
        "prereq_text": "Prerequisites: EE 45.",
        "prereqs": [
            "ee-45"
        ]
    },
    "ee-154-ab": {
        "id": "ee-154-ab",
        "course_id": "EE 154 ab",
        "name": "Practical Electronics for Space Applications",
        "units": "9 units (2-3-4)",
        "terms": "second, third terms",
        "description": "Part a: Subsystem Design: Students will be exposed to design for subsystem electronics in the space environment, including an understanding of the space environment, common approaches for low cost spacecraft, atmospheric / analogue testing, and discussions of risk. Emphasis on a practical exposure to early subsystem design for a TRL 3-4 effort. Part b: Subsystems to System Interfacing: Builds upon the first term by extending subsystems to be compatible with \"spacecraft\", including a near-space \"flight\" of prototype subsystems on a high-altitude balloon flight. Focus on qualification for the flight environment appropriate to a TRL 4-5 effort.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Klesh",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/practical-electronics-for-space-applications",
        "prereq_text": "",
        "prereqs": []
    },
    "cmscscnseeids-155": {
        "id": "cmscscnseeids-155",
        "course_id": "CMS/CS/CNS/EE/IDS 155",
        "name": "Machine Learning & Data Mining",
        "units": "12 units (3-3-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Yue",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/machine-learning-&-data-mining",
        "prereq_text": "Prerequisites: CS/CNS/EE 156 a. Having a sufficient background in algorithms, linear algebra, calculus, probability, and statistics, is highly recommended.",
        "prereqs": [
            "cscnsee-156-ab"
        ]
    },
    "cscnsee-156-ab": {
        "id": "cscnsee-156-ab",
        "course_id": "CS/CNS/EE 156 ab",
        "name": "Learning Systems",
        "units": "9 units (3-1-5)",
        "terms": "first, third terms",
        "description": "Introduction to the theory, algorithms, and applications of automated learning. How much information is needed to learn a task, how much computation is involved, and how it can be accomplished. Special emphasis will be given to unifying the different approaches to the subject coming from statistics, function approximation, optimization, pattern recognition, and neural networks.",
        "offered": true,
        "instructors": "Abu-Mostafa",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/learning-systems",
        "prereq_text": "Prerequisites: Ma 2 and CS 2, or equivalent.",
        "prereqs": [
            "cs-2",
            "ma-2102"
        ]
    },
    "eeae-157-ab": {
        "id": "eeae-157-ab",
        "course_id": "EE/Ae 157 ab",
        "name": "Introduction to the Physics of Remote Sensing",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "An overview of the physics behind space remote sensing instruments. Topics include the interaction of electromagnetic waves with natural surfaces, including scattering of microwaves, microwave and thermal emission from atmospheres and surfaces, and spectral reflection from natural surfaces and atmospheres in the near-infrared and visible regions of the spectrum. The class also discusses the design of modern space sensors and associated technology, including sensor design, new observation techniques, ongoing developments, and data interpretation. Examples of applications and instrumentation in geology, planetology, oceanography, astronomy, and atmospheric research.\n Part a offered spring term; Part b not offered 2024-25",
        "offered": true,
        "instructors": "Rosen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/introduction-to-the-physics-of-remote-sensing",
        "prereq_text": "Prerequisites: Ph 2 or equivalent.",
        "prereqs": [
            "ph-2-abc"
        ]
    },
    "geeeese-157-c": {
        "id": "geeeese-157-c",
        "course_id": "Ge/EE/ESE 157 c",
        "name": "Remote Sensing for Environmental and Geological Applications",
        "units": "9 units (3-3-3)",
        "terms": "third term",
        "description": "Analysis of electromagnetic radiation at visible, infrared, and radio wavelengths for interpretation of the physical and chemical characteristics of the surfaces of Earth and other planets. Topics: interaction of light with materials, spectroscopy of minerals and vegetation, atmospheric removal, image analysis, classification, and multi-temporal studies. This course does not require but is complementary to EE 157 ab with emphasis on applications for geological and environmental problems, using data acquired from airborne and orbiting remote sensing platforms. Students will work with digital remote sensing datasets in the laboratory and there will be one field trip.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Ehlmann",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/remote-sensing-for-environmental-and-geological-applications",
        "prereq_text": "",
        "prereqs": []
    },
    "eeaph-158": {
        "id": "eeaph-158",
        "course_id": "EE/APh 158",
        "name": "Quantum Electrical Circuits",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Mirhosseini",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/quantum-electrical-circuits",
        "prereq_text": "Prerequisites: advanced-level familiarity with Maxwell's electromagnetic theory and quantum mechanics (EE 151 and Ph 125 abc, or equivalent).",
        "prereqs": [
            "ph-125-abc",
            "ee-151"
        ]
    },
    "cscnseeids-159": {
        "id": "cscnseeids-159",
        "course_id": "CS/CNS/EE/IDS 159",
        "name": "Advanced Topics in Machine Learning",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course focuses on current topics in machine learning research. This is a paper reading course, and students are expected to understand material directly from research articles. Students are also expected to present in class, and to do a final project.",
        "offered": true,
        "instructors": "Yue",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/advanced-topics-in-machine-learning",
        "prereq_text": "Prerequisites: CS 155; strong background in statistics, probability theory, algorithms, and linear algebra; background in optimization is a plus as well.",
        "prereqs": []
    },
    "eecsids-160": {
        "id": "eecsids-160",
        "course_id": "EE/CS/IDS 160",
        "name": "Fundamentals of Information Transmission and Storage",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Basics of information theory: entropy, mutual information, source and channel coding theorems. Basics of coding theory: error-correcting codes for information transmission and storage, block codes, algebraic codes, sparse graph codes. Basics of digital communications: sampling, quantization, digital modulation, matched filters, equalization.",
        "offered": true,
        "instructors": "Kostina",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/fundamentals-of-information-transmission-and-storage",
        "prereq_text": "Prerequisites: EE 55 or equivalent.",
        "prereqs": [
            "ee-55"
        ]
    },
    "eecs-161": {
        "id": "eecs-161",
        "course_id": "EE/CS 161",
        "name": "Big Data Networks",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Next generation networks will have tens of billions of nodes forming cyber-physical systems and the Internet of Things. A number of fundamental scientific and technological challenges must be overcome to deliver on this vision. This course will focus on (1) How to boost efficiency and reliability in large networks; the role of network coding, distributed storage, and distributed caching; (2) How to manage wireless access on a massive scale; modern random access and topology formation techniques; and (3) New vistas in big data networks, including distributed computing over networks and crowdsourcing. A selected subset of these problems, their mathematical underpinnings, state-of-the-art solutions, and challenges ahead will be covered.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/big-data-networks",
        "prereq_text": "Prerequisites: Linear Algebra ACM/IDS 104 and Introduction to Probability Models ACM/EE/IDS 116 or their equivalents.",
        "prereqs": [
            "acmeeids-116",
            "acmids-104"
        ]
    },
    "ee-163": {
        "id": "ee-163",
        "course_id": "EE 163",
        "name": "Communication Theory",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Mathematical models of communication processes; signals and noise as random processes; sampling; modulation; spectral occupancy; intersymbol interference; synchronization; optimum demodulation and detection; signal-to-noise ratio and error probability in digital baseband and carrier communication systems; linear and adaptive equalization; maximum likelihood sequence estimation; multipath channels; parameter estimation; hypothesis testing; optical communication systems. Capacity measures; multiple antenna and multiple carrier communication systems; wireless networks; different generations of wireless systems.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/communication-theory",
        "prereq_text": "Prerequisites: EE 111; ACM/EE/IDS 116 or equivalent.",
        "prereqs": [
            "acmeeids-116",
            "ee-111"
        ]
    },
    "ee-164": {
        "id": "ee-164",
        "course_id": "EE 164",
        "name": "Stochastic and Adaptive Signal Processing",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Fundamentals of linear estimation theory are studied, with applications to stochastic and adaptive signal processing. Topics include deterministic and stochastic least-squares estimation, the innovations process, Wiener filtering and spectral factorization, state-space structure and Kalman filters, array and fast array algorithms, displacement structure and fast algorithms, robust estimation theory and LMS and RLS adaptive fields.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Hassibi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/stochastic-and-adaptive-signal-processing",
        "prereq_text": "Prerequisites: ACM/EE/IDS 116 or equivalent.",
        "prereqs": [
            "acmeeids-116"
        ]
    },
    "cscnseeids-165": {
        "id": "cscnseeids-165",
        "course_id": "CS/CNS/EE/IDS 165",
        "name": "Foundations of Machine Learning and Statistical Inference",
        "units": "12 units (3-3-6)",
        "terms": "second term",
        "description": "The course assumes students are comfortable with analysis, probability, statistics, and basic programming. This course will cover core concepts in machine learning and statistical inference. The ML concepts covered are spectral methods (matrices and tensors), non-convex optimization, probabilistic models, neural networks, representation theory, and generalization. In statistical inference, the topics covered are detection and estimation, sufficient statistics, Cramer-Rao bounds, Rao-Blackwell theory, variational inference, and multiple testing. In addition to covering the core concepts, the course encourages students to ask critical questions such as: How relevant is theory in the age of deep learning? What are the outstanding open problems? Assignments will include exploring failure modes of popular algorithms, in addition to traditional problem-solving type questions.",
        "offered": true,
        "instructors": "Anandkumar",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/foundations-of-machine-learning-and-statistical-inference",
        "prereq_text": "Prerequisites: CMS/ACM/EE 122, ACM/EE/IDS 116, CS 156 a, ACM/CS/IDS 157 or instructor's permission.",
        "prereqs": [
            "cmsacmee-122",
            "acmeeids-116"
        ]
    },
    "cseeids-166": {
        "id": "cseeids-166",
        "course_id": "CS/EE/IDS 166",
        "name": "Computational Cameras",
        "units": "12 units (3-3-6)",
        "terms": "third term",
        "description": "Computational cameras overcome the limitations of traditional cameras, by moving part of the image formation process from hardware to software. In this course, we will study this emerging multi-disciplinary field at the intersection of signal processing, applied optics, computer graphics, and vision. At the start of the course, we will study modern image processing and image editing pipelines, including those encountered on DSLR cameras and mobile phones. Then we will study the physical and computational aspects of tasks such as coded photography, light-field imaging, astronomical imaging, medical imaging, and time-of-flight cameras. The course has a strong hands-on component, in the form of homework assignments and a final project. In the homework assignments, students will have the opportunity to implement many of the techniques covered in the class. Example homework assignments include building an end-to-end HDR (High Dynamic Range) imaging pipeline, implementing Poisson image editing, refocusing a light-field image, and making your own lensless \"scotch-tape\" camera.\n Not offered 2024-25",
        "offered": false,
        "instructors": "Bouman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/computational-cameras",
        "prereq_text": "Prerequisites: ACM 104 or ACM 107 or equivalent.",
        "prereqs": []
    },
    "eecsids-167": {
        "id": "eecsids-167",
        "course_id": "EE/CS/IDS 167",
        "name": "Introduction to Data Compression and Storage",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The course will introduce the students to the basic principles and techniques of codes for data compression and storage. The students will master the basic algorithms used for lossless and lossy compression of digital and analog data and the major ideas behind coding for flash memories. Topics include the Huffman code, the arithmetic code, Lempel-Ziv dictionary techniques, scalar and vector quantizers, transform coding; codes for constrained storage systems.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/introduction-to-data-compression-and-storage",
        "prereq_text": "Prerequisites: Ma 3 or ACM/EE/IDS 116.",
        "prereqs": [
            "acmeeids-116",
            "ma-3103"
        ]
    },
    "medeeebe-168-abc": {
        "id": "medeeebe-168-abc",
        "course_id": "MedE/EE/BE 168 abc",
        "name": "Biomedical Optics: Principles and Imaging",
        "units": "9 units (4-0-5) each",
        "terms": "second term, part a offered 2024-25, part b offered 2025-26, part c offered 2026-27.",
        "description": "Part a covers the principles of optical photon transport in biological tissue. Topics include a brief introduction to biomedical optics, single-scatterer theories, Monte Carlo modeling of photon transport, convolution for broad-beam responses, radiative transfer equation and diffusion theory, hybrid Monte Carlo method and diffusion theory, and sensing of optical properties and spectroscopy, (absorption, elastic scattering, Raman scattering, and fluorescence). Part b covers established optical imaging technologies. Topics include ballistic imaging (confocal microscopy, two-photon microscopy, super-resolution microscopy, etc.), optical coherence tomography, Mueller optical coherence tomography, and diffuse optical tomography. Part c covers emerging optical imaging technologies. Topics include photoacoustic tomography, ultrasound-modulated optical tomography, optical time reversal (wavefront shaping/engineering), and ultrafast imaging.\n MedE/EE/BE 168 bc not offered 2024-25. Part a offered 2024-25.",
        "offered": true,
        "instructors": "Wang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/biomedical-optics:-principles-and-imaging",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "mecsee-169": {
        "id": "mecsee-169",
        "course_id": "ME/CS/EE 169",
        "name": "Mobile Robots",
        "units": "9 units (1-7-1)",
        "terms": "third term",
        "description": "Mobile robots need to perceive their environment and localize themselves with respect to maps thereof. They further require planners to move along collision-free paths. This course builds up mobile robots in team-based projects. Teams will write all necessary software from low-level hardware I/O to high level algorithms, using the robotic operating system (ROS). The final systems will autonomously maneuver to reach their goals or track various objectives.",
        "offered": true,
        "instructors": "Niemeyer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/mobile-robots",
        "prereq_text": "Prerequisites: ME/CS/EE 133 b, or with permission of instructor.",
        "prereqs": [
            "mecsee-133-ab"
        ]
    },
    "acmeeids-170": {
        "id": "acmeeids-170",
        "course_id": "ACM/EE/IDS 170",
        "name": "Mathematics of Signal Processing",
        "units": "12 units (3-0-9)",
        "terms": "third term",
        "description": "This course covers classical and modern approaches to problems in signal processing. Problems may include denoising, deconvolution, spectral estimation, direction-of-arrival estimation, array processing, independent component analysis, system identification, filter design, and transform coding. Methods rely heavily on linear algebra, convex optimization, and stochastic modeling. In particular, the class will cover techniques based on least-squares and on sparse modeling. Throughout the course, a computational viewpoint will be emphasized.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Hassibi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/mathematics-of-signal-processing",
        "prereq_text": "Prerequisites: ACM/IDS 104, CMS/ACM/EE 122, and ACM/EE/IDS 116; or instructor's permission.",
        "prereqs": [
            "cmsacmee-122",
            "acmids-104",
            "acmeeids-116"
        ]
    },
    "eecsmede-175": {
        "id": "eecsmede-175",
        "course_id": "EE/CS/MedE 175",
        "name": "Advanced Topics in Digital Design with FPGAs and VHDL",
        "units": "9 units (3-6-0)",
        "terms": "third term",
        "description": "Quick review of the VHDL language and RTL concepts. Dealing with sophisticated, multi-dimensional data types in VHDL. Dealing with multiple time domains. Transfer of control versus data between clock domains. Clock division and multiplication. Using PLLs. Dealing with global versus local and synchronous versus asynchronous resets. How to measure maximum speed in FPGAs (for both registered and unregistered circuits). The (often) hard task of time closure. The subtleties of the time behavior in state machines (a major source of errors in large, complex designs). Introduction to simulation. Construction of VHDL testbenches for automated testing. Dealing with files in simulation. All designs are physically implemented using FPGA boards.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/advanced-topics-in-digital-design-with-fpgas-and-vhdl",
        "prereq_text": "Prerequisites: EE/CS/MedE 125 or equivalent.",
        "prereqs": []
    },
    "esemeesteccheee-179": {
        "id": "esemeesteccheee-179",
        "course_id": "ESE/ME/EST/Ec/ChE/EE 179",
        "name": "Climate Change Impacts, Mitigation and Adaptation",
        "units": "3 units (3-0-0)",
        "terms": "second term",
        "description": "Climate change has already begun to impact life on the planet, and will continue in the coming decades. This class will explore particular causes and impacts of climate change, technologies to mitigate or adapt to those impacts, and the economic and social costs associated with them - particular focus will be paid to distributional issues, environmental and racial justice and equity intersections. The course will consist of 3-4 topical modules, each focused on a specific impact or sector (e.g. the electricity or transportation sector, climate impacts of food and agriculture, increasing fires and floods). Each module will contain lectures/content on the associated climate science background, engineering/technological developments to combat the issue, and an exploration of the economics and the inequities that exacerbate the situation, followed by group discussion and synthesis of the different perspectives.",
        "offered": true,
        "instructors": "Wennberg, Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/climate-change-impacts,-mitigation-and-adaptation",
        "prereq_text": "",
        "prereqs": []
    },
    "eeaph-180": {
        "id": "eeaph-180",
        "course_id": "EE/APh 180",
        "name": "Nanotechnology",
        "units": "6 units (3-0-3)",
        "terms": "first term",
        "description": "This course will explore the techniques and applications of nanofabrication and miniaturization of devices to the smallest scale. It will be focused on the understanding of the technology of miniaturization, its history and present trends towards building devices and structures on the nanometer scale. Technology and instrumentation for nanofabrication as well as future trends will be described. Examples of applications of nanotechnology in the electronics, communications, data storage, sensing and biotechnology will be analyzed. Students will understand the underlying physics and technology, as well as limitations of miniaturization.",
        "offered": true,
        "instructors": "Scherer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/nanotechnology",
        "prereq_text": "",
        "prereqs": []
    },
    "aphee-183": {
        "id": "aphee-183",
        "course_id": "APh/EE 183",
        "name": "Physics of Semiconductors and Semiconductor Devices",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Principles of semiconductor electronic structure, carrier transport properties, and optoelectronic properties relevant to semiconductor device physics. Fundamental performance aspects of basic and advanced semiconductor electronic and optoelectronic devices. Topics include energy band theory, carrier generation and recombination mechanisms, quasi-Fermi levels, carrier drift and diffusion transport, quantum transport.",
        "offered": true,
        "instructors": "Nadj-Perge",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/physics-of-semiconductors-and-semiconductor-devices",
        "prereq_text": "",
        "prereqs": []
    },
    "eemede-185": {
        "id": "eemede-185",
        "course_id": "EE/MedE 185",
        "name": "Micro/Nano Technology for Semiconductor and Medical Device",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Tai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/micro/nano-technology-for-semiconductor-and-medical-device",
        "prereq_text": "Prerequisites: APh/EE 9 or instructor's permission.",
        "prereqs": [
            "aphee-9"
        ]
    },
    "cnsbieecsnb-186": {
        "id": "cnsbieecsnb-186",
        "course_id": "CNS/Bi/EE/CS/NB 186",
        "name": "Vision: From Computational Theory to Neuronal Mechanisms",
        "units": "12 units (4-4-4)",
        "terms": "Second term",
        "description": "Lecture, laboratory, and project course aimed at understanding visual information processing, in both machines and the mammalian visual system. The course will emphasize an interdisciplinary approach aimed at understanding vision at several levels: computational theory, algorithms, psychophysics, and hardware (i.e., neuroanatomy and neurophysiology of the mammalian visual system). The course will focus on early vision processes, in particular motion analysis, binocular stereo, brightness, color and texture analysis, visual attention and boundary detection. Students will be required to hand in approximately three homework assignments as well as complete one project integrating aspects of mathematical analysis, modeling, physiology, psychophysics, and engineering.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Meister, Perona, Shimojo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/vision:-from-computational-theory-to-neuronal-mechanisms",
        "prereq_text": "",
        "prereqs": []
    },
    "eemede-187": {
        "id": "eemede-187",
        "course_id": "EE/MedE 187",
        "name": "MEMS/NEMS Technologies for Biomedical Devices",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Tai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/mems/nems-technologies-for-biomedical-devices",
        "prereq_text": "Prerequisites: APh/EE 9 or instructor's permission.",
        "prereqs": [
            "aphee-9"
        ]
    },
    "ee-188": {
        "id": "ee-188",
        "course_id": "EE 188",
        "name": "Computer Architecture",
        "units": "9 units (3-3-3)",
        "terms": "third",
        "description": "The course focuses on the design and implementation of modern CPUs and microcontrollers. The topics covered in addition to basic CPU architecture include caching and cache controllers, memory management and virtual memory, pipelining CPU operations, VLIW CPUs, branch prediction, and hardware multi-threading. The emphasis is on the practical aspects of CPU design such as timing, testing, and power use. There is significant laboratory work in which the students are expected to design and implement the systems discussed in the class.",
        "offered": true,
        "instructors": "George",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/computer-architecture",
        "prereq_text": "Prerequisites: EE/CS 119a or EE/CS/MedE 125 or equivalent.",
        "prereqs": [
            "eecs-119-abc"
        ]
    },
    "beeemede-189-ab": {
        "id": "beeemede-189-ab",
        "course_id": "BE/EE/MedE 189 ab",
        "name": "Design and Construction of Biodevices",
        "units": "189 a, 12 units (3-6-3) offered both first and third terms. 189 b, 9 units (0-9-0) offered only third term",
        "terms": "first, third terms",
        "description": "Students will learn to use an Arduino microcontroller to interface sensing and actuation hardware with the computer. Students will learn and practice engineering design principles through a set of projects. In part a, students will design and implement biosensing systems; examples include a pulse monitor, a pulse oximeter, and a real-time polymerase-chain-reaction incubator. Part b is a student-initiated design project requiring instructor's permission for enrollment. Enrollment is limited based on laboratory capacity.",
        "offered": true,
        "instructors": "Murray,Yang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/design-and-construction-of-biodevices",
        "prereq_text": "Prerequisites: BE/EE/MedE 189 a must be taken before BE/EE/MedE 189 b.",
        "prereqs": []
    },
    "aphee-190-abc": {
        "id": "aphee-190-abc",
        "course_id": "APh/EE 190 abc",
        "name": "Quantum Electronics",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "Generation, manipulations, propagation, and applications of coherent radiation. The basic theory of the interaction of electromagnetic radiation with resonant atomic transitions. Laser oscillation, important laser media, Gaussian beam modes, the electro-optic effect, nonlinear-optics theory, second harmonic generation, parametric oscillation, stimulated Brillouin and Raman scattering. Other topics include light modulation, diffraction of light by sound, integrated optics, phase conjugate optics, and quantum noise theory.\n Part c not offered 2024-25.",
        "offered": true,
        "instructors": "Vahala",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/quantum-electronics",
        "prereq_text": "Prerequisites: Ph 125 or equivalent.",
        "prereqs": [
            "ph-125-abc"
        ]
    },
    "medeee-204": {
        "id": "medeee-204",
        "course_id": "MedE/EE 204",
        "name": "Principles and Designs of Medical Neuromodulation Devices",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This is a course for senior undergraduates and graduate students. This course provides a review for advanced medical neuromodulation devices based on multidisciplinary engineering principles. Emphasis will be on implantable neuromodulation devices for both neural recording and stimulation such as EKG, EEG, EMG, pacemakers, DBS, etc. Sub-topics include biomaterials, biocompatibility, medical electronics, and FDA regulation on medical devices. The course will focus on engineering fundamentals specific for neural applications. Lectures and assignments will emphasize the design aspects of various devices as well as up-to-date literature study.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Tai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/principles-and-designs-of-medical-neuromodulation-devices",
        "prereq_text": "Prerequisites: Instructor's permission.",
        "prereqs": []
    },
    "mecdsee-234-ab": {
        "id": "mecdsee-234-ab",
        "course_id": "ME/CDS/EE 234 ab",
        "name": "Advanced Robotics: Planning",
        "units": "9 units (3-3-3)",
        "terms": "second, third terms",
        "description": "Advanced topics in robotic motion planning and navigation, including inertial navigation, simultaneous localization and mapping, Markov Decision Processes, Stochastic Receding Horizon Control, Risk-Aware planning, robotic coverage planning, and multi-robot coordination. Course work will consist of homework, programming projects, and labs. Given in alternate years.",
        "offered": true,
        "instructors": "Burdick",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/advanced-robotics:-planning",
        "prereq_text": "Prerequisites: ME/CS/EE 133 b, or equivalent. ME/CS/EE 133 a preferred.",
        "prereqs": [
            "mecsee-133-ab"
        ]
    },
    "medeee-268": {
        "id": "medeee-268",
        "course_id": "MedE/EE 268",
        "name": "Medical Imaging",
        "units": "9 units (4-0-5)",
        "terms": "second term",
        "description": "Medical imaging technologies will be covered. Topics include X-ray radiography, X-ray computed tomography (CT), nuclear imaging (PET & SPECT), ultrasonic imaging, and magnetic resonance imaging (MRI).\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Wang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/medical-imaging",
        "prereq_text": "",
        "prereqs": []
    },
    "ee-291": {
        "id": "ee-291",
        "course_id": "EE 291",
        "name": "Advanced Work in Electrical Engineering",
        "units": "",
        "terms": "",
        "description": "Special problems relating to electrical engineering. Primarily for graduate students; students should consult with their advisers.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ee/advanced-work-in-electrical-engineering",
        "prereq_text": "",
        "prereqs": []
    }
}