{
    "ese-1": {
        "id": "ese-1",
        "course_id": "ESE 1",
        "name": "Earth's Climate",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "An introduction to climate on Earth. How Earth's climate has changed in the past and its evolving response to the rapid increase in carbon dioxide and methane happening today. Model projections of future climate and associated risks. Development of climate policies in face of uncertainty in these projections and risks. Enrollment is limited. Satisfies the menu requirement of the Caltech core curriculum. Juniors and Seniors who have satisfied their menu course requirement should enroll in ESE 101.",
        "offered": true,
        "instructors": "Wennberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/earth's-climate",
        "prereq_text": "",
        "prereqs": []
    },
    "fsesege-18": {
        "id": "fsesege-18",
        "course_id": "FS/ESE/Ge 18",
        "name": "First-Year Seminar: The Unseen Microbial World in Plain Sight",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "To paraphrase a Caltech engineering colleague: \"In terms of Earth and the Environment, our species had been nothing more than the hood ornament on a really interesting car. We should be studying what's under the hood, the microbial world, if we want to understand the engine\". We will spend the term examining striking examples of microbes and microbial activities in the environment. First-year (undergraduates) only; limited enrollment.",
        "offered": true,
        "instructors": "Leadbetter",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/first-year-seminar:-the-unseen-microbial-world-in-plain-sight",
        "prereq_text": "",
        "prereqs": []
    },
    "esege-21": {
        "id": "esege-21",
        "course_id": "ESE/Ge 21",
        "name": "Tutorial: Biogeochemistry of Carbon Sequestration",
        "units": "9 units (2-0-7)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Sessions",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/tutorial:-biogeochemistry-of-carbon-sequestration",
        "prereq_text": "",
        "prereqs": []
    },
    "ese-90": {
        "id": "ese-90",
        "course_id": "ESE 90",
        "name": "Undergraduate Laboratory Research in Environmental Science and Engineering",
        "units": "",
        "terms": "any term",
        "description": "Approval of research supervisor required prior to registration. Independent research on current environmental problems; laboratory or field work is required. A written report is required for each term of registration. Graded pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/undergraduate-laboratory-research-in-environmental-science-and-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "ese-91": {
        "id": "ese-91",
        "course_id": "ESE 91",
        "name": "Senior Thesis Research",
        "units": "9 units",
        "terms": "third term",
        "description": "Two terms of ESE 90 are to be completed during the junior and/or senior year of study. At the end of the third term, students enrolled in ESE 91 will present a thesis of approximately 20 pages (excluding figures and references) to the mentor and the ESE Option Representative. The thesis must be approved by both the research mentor and the ESE faculty. An oral thesis defense will be arranged by the ESE Option Representative in the third term for all enrollees. All prior terms of ESE 90 will be taken on a pass/fail basis, but the third term of ESE 91 will carry a letter grade.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/senior-thesis-research",
        "prereq_text": "Prerequisites: ESE 90 and Instructor's permission.",
        "prereqs": []
    },
    "ese-100": {
        "id": "ese-100",
        "course_id": "ESE 100",
        "name": "Special Problems in Environmental Science and Engineering",
        "units": "Up to 12 units by arrangement",
        "terms": "any term",
        "description": "Special courses of readings or laboratory instruction. Graded pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/special-problems-in-environmental-science-and-engineering",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "ese-101": {
        "id": "ese-101",
        "course_id": "ESE 101",
        "name": "Earth's Atmosphere",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Introduction to the fundamental processes governing atmospheric circulations and climate. Starting from an overview of the observed state of the atmosphere and its variation over the past, the course discusses Earth's radiative energy balance including the greenhouse effect, Earth's orbit around the Sun and climatic effects of its variations, and the role of atmospheric circulations in maintaining the energy, angular momentum, and water balances, which determine the distributions of temperatures, winds, and precipitation. The focus throughout is on order-of-magnitude physics that is applicable to climates generally, including those of Earth's past and future and of other planets.",
        "offered": true,
        "instructors": "Schneider",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/earth's-atmosphere",
        "prereq_text": "",
        "prereqs": []
    },
    "ese-102": {
        "id": "ese-102",
        "course_id": "ESE 102",
        "name": "Earth's Oceans",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Thompson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/earth's-oceans",
        "prereq_text": "",
        "prereqs": []
    },
    "ese-103": {
        "id": "ese-103",
        "course_id": "ESE 103",
        "name": "Earth's Biogeochemical Cycles",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Frankenberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/earth's-biogeochemical-cycles",
        "prereq_text": "",
        "prereqs": []
    },
    "ese-104": {
        "id": "ese-104",
        "course_id": "ESE 104",
        "name": "Current Problems in Environmental Science and Engineering",
        "units": "1 unit",
        "terms": "second term",
        "description": "Discussion of current research by ESE graduate students, faculty, and staff.",
        "offered": true,
        "instructors": "Callies",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/current-problems-in-environmental-science-and-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "bigeese-105": {
        "id": "bigeese-105",
        "course_id": "Bi/Ge/ESE 105",
        "name": "Evolution",
        "units": "12 units (3-4-5)",
        "terms": "second term",
        "description": "The theory of evolution is arguably biology’s greatest idea and serves as the overarching framework for thinking about the diversity and relationships between organisms. This course will present a broad picture of evolution starting with discussions of the insights of the great naturalists, the study of the genetic basis of variation, and an introduction to the key driving forces of evolution. Following these foundations, we will then focus on a number of case studies including the following: evolution of oxygenic photosynthesis, origin of eukaryotes, multicellularity, influence of symbiosis, the emergence of life from the water (i.e. fins to limbs), the return of life to the water (i.e. limbs to fins), diversity following major extinction events, the discovery of Archaea, insights into evolution that have emerged from sequence analysis, and finally human evolution and the impact of humans on evolution (including examples such as antibiotic resistance). A specific focus for considering these issues will be the island biogeography of the Galapagos.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Phillips, Orphan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/evolution",
        "prereq_text": "Prerequisites: Completion of Core Curriculum Courses. Maximum enrollment: 15, by application only.",
        "prereqs": []
    },
    "ese-106": {
        "id": "ese-106",
        "course_id": "ESE 106",
        "name": "Research in Environmental Science and Engineering",
        "units": "",
        "terms": "any term",
        "description": "Exploratory research for first-year graduate students and qualified undergraduates. Graded pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/research-in-environmental-science-and-engineering",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "ese-110-abc": {
        "id": "ese-110-abc",
        "course_id": "ESE 110 abc",
        "name": "Seminar in Environmental Science and Engineering",
        "units": "1 unit",
        "terms": "first, second, third terms",
        "description": "Required attendance by first year graduate students at the weekly ESE seminar, Wednesdays 4pm. Graded pass/fail.",
        "offered": true,
        "instructors": "Karthikeyan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/seminar-in-environmental-science-and-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "cheesemems-111": {
        "id": "cheesemems-111",
        "course_id": "ChE/ESE/ME/MS 111",
        "name": "Sustainable Engineering",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Examines the Earth's resources including fresh water, nitrogen, carbon and other biogeochemical cycles that impose planetary constraints on engineering; systems approaches to sustainable development goals; fossil fuel formation, chemical composition, production and use; engineering challenges and opportunities in decarbonizing energy, transportation and industry; global flows of critical elements used in zero-carbon energy systems; food-water-energy nexus; analysis of regional and local systems to model effects of human activities on air, water and soil.",
        "offered": true,
        "instructors": "Kornfield",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/sustainable-engineering",
        "prereq_text": "Prerequisites: (ChE 62 and ChE 63 ab) or (ME 11 abc) or (Ph 2 c and MS 115) or Instructor's permission.",
        "prereqs": [
            "ph-2-abc",
            "me-11-abc"
        ]
    },
    "bemecese-119": {
        "id": "bemecese-119",
        "course_id": "BEM/Ec/ESE 119",
        "name": "Environmental Economics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course provides a survey from the perspective of economics of public policy issues regarding the management of natural resources and the protection of environmental quality. The course covers both conceptual topics and recent and current applications. Included are principles of environmental and resource economics, management of nonrenewable and renewable resources, and environmental policy with the focus on air pollution problems, both local problems (smog) and global problems (climate change).",
        "offered": true,
        "instructors": "Druckenmiller",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/environmental-economics",
        "prereq_text": "Prerequisites: Ec 11 or equivalent.",
        "prereqs": []
    },
    "geese-125": {
        "id": "geese-125",
        "course_id": "Ge/ESE 125",
        "name": "Geomorphology",
        "units": "12 units (3-5-4)",
        "terms": "first term",
        "description": "A quantitative examination of landforms, runoff generation, river hydraulics, sediment transport, erosion and deposition, hillslope creep, landslides and debris flows, glacial processes, and submarine and Martian landscapes. Field and laboratory exercises are designed to facilitate quantitative measurements and analyses of geomorphic processes.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Lamb",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/geomorphology",
        "prereq_text": "Prerequisites: Ge 11 a or instructor's permission.",
        "prereqs": []
    },
    "ese-130": {
        "id": "ese-130",
        "course_id": "ESE 130",
        "name": "Fundamentals of Atmosphere and Ocean Dynamics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Callies",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/fundamentals-of-atmosphere-and-ocean-dynamics",
        "prereq_text": "Prerequisites: ESE 101 and ESE 102 recommended and Ma 2 or equivalent (instructor's permission).",
        "prereqs": [
            "ma-2102"
        ]
    },
    "ese-131": {
        "id": "ese-131",
        "course_id": "ESE 131",
        "name": "Ocean Dynamics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course gives an in-depth discussion of the fluid dynamics of the world ocean. Building on the concepts developed in ESE 130, this course explores the vertical structure of the wind-driven gyre circulation, thermocline theory, the dynamics of the Southern Ocean, eddies and eddy parameterizations, geostrophic turbulence, submesoscale dynamics, the circulation of the deep ocean, tides, internal waves, and turbulent mixing.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Callies",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/ocean-dynamics",
        "prereq_text": "Prerequisites: ESE 102 and ESE 130, or instructor's permission.",
        "prereqs": []
    },
    "ese-132": {
        "id": "ese-132",
        "course_id": "ESE 132",
        "name": "Tropical Atmosphere Dynamics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Phenomenological description of tropical atmospheric circulations at different scales, and theories or models that capture the underlying fundamental dynamics, starting from the large-scale energy balance and moving down to cumulus convection and hurricanes. Topics to be addressed include: large-scale circulations such as the Hadley, Walker, and monsoonal circulations, the intertropical convergence zone, equatorial waves, convectively coupled waves, and hurricanes.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Schneider",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/tropical-atmosphere-dynamics",
        "prereq_text": "Prerequisites: ESE 101 and ESE 130, or instructor's permission.",
        "prereqs": []
    },
    "ese-133": {
        "id": "ese-133",
        "course_id": "ESE 133",
        "name": "Global Atmosphere Dynamics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Introduction to the global-scale fluid dynamics of atmospheres, beginning with a phenomenological overview of observed circulations on Earth and other planets and leading to currently unsolved problems. Topics include constraints on atmospheric circulations and zonal winds from angular momentum balance; Rossby wave generation, propagation, and dissipation and their roles in the maintenance of global circulations; moist convection and its coupling to waves and circulations; Hadley circulations and tropical-extratropical interactions; energy cycle and thermodynamic efficiency of atmospheric circulations. The course focuses on Earth's atmosphere but explores a continuum of possible planetary circulations and relationships among them as parameters such as the planetary rotation rate chance.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Schneider",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/global-atmosphere-dynamics",
        "prereq_text": "Prerequisites: ESE 101 and ESE 130, or instructor's permission.",
        "prereqs": []
    },
    "ese-134": {
        "id": "ese-134",
        "course_id": "ESE 134",
        "name": "Cloud and Boundary Layer Dynamics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Introduction to the dynamics controlling boundary layers and clouds and how they may change with climate, from a phenomenological overview of cloud and boundary layer morphologies to closure theories for turbulence and convection. Topics include similarity theories for boundary layers; mixed-layer models; moist thermodynamics and stability; stratocumulus and trade-cumulus boundary layers; shallow cumulus convection and deep convection.",
        "offered": true,
        "instructors": "Schneider",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/cloud-and-boundary-layer-dynamics",
        "prereq_text": "Prerequisites: ESE 101 or instructor's permission.",
        "prereqs": []
    },
    "ese-135": {
        "id": "ese-135",
        "course_id": "ESE 135",
        "name": "Topics in Atmosphere and Ocean Dynamics",
        "units": "3 units (1-0-2)",
        "terms": "third term",
        "description": "A lecture or discussion course on current research in atmosphere and ocean dynamics. Topics covered vary from year to year and may include global circulations of planetary atmospheres, geostrophic turbulence, atmospheric convection and cloud dynamics, wave dynamics and large-scale circulations in the tropics, marine physical-biogeochemical interactions, dynamics of the El Nino Southern Oscillation, and global warming.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/topics-in-atmosphere-and-ocean-dynamics",
        "prereq_text": "Prerequisites: ESE 101 or ESE 102, or instructor's permission or equivalent.",
        "prereqs": []
    },
    "ese-136": {
        "id": "ese-136",
        "course_id": "ESE 136",
        "name": "Climate Models",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "The course covers the architecture and scientific underpinnings of models of the atmosphere, ocean, land, and ice, numerical methods for the underlying differential equations, aspects of high-performance computing, and model calibration (both manual and machine-learned). Overviews of theoretical concepts will be combined with hands-on exercises in running a state-of-the-art climate model, and analyzing and understanding its output. The course will enable students to design their own model experiments and to evaluate the results critically.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Schneider",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/climate-models",
        "prereq_text": "Prerequisites: ESE 101 or ESE 102, or instructor's permission.",
        "prereqs": []
    },
    "ese-137": {
        "id": "ese-137",
        "course_id": "ESE 137",
        "name": "Polar Oceanography",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course focuses on high latitude processes related to the Earth's oceans and their interaction with the cryosphere, including glaciers, ice shelves and sea ice. The course starts with introductory lectures related to regional circulation features, water mass modification and ice dynamics. The second half of the course will focus on a single topic, with input from the students, and will be explored in detail through the scientific literature and through individual projects.",
        "offered": true,
        "instructors": "Thompson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/polar-oceanography",
        "prereq_text": "Prerequisites: ESE 131 or instructor's permission.",
        "prereqs": []
    },
    "ese-138": {
        "id": "ese-138",
        "course_id": "ESE 138",
        "name": "Waves in Geophysical Fluids",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Callies",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/waves-in-geophysical-fluids",
        "prereq_text": "Prerequisites: ESE 131 or instructor's permission.",
        "prereqs": []
    },
    "geese-139": {
        "id": "geese-139",
        "course_id": "Ge/ESE 139",
        "name": "Introduction to Atmospheric Radiation",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The basic physics of absorption and scattering of light by molecules, aerosols, and clouds. Theory of radiative transfer. Band models, correlated-k distributions and other approximate methods. Solar insolation, thermal emission, heating rates and radiances. Applications to Earth, Planets and Exoplanets.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Yung",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/introduction-to-atmospheric-radiation",
        "prereq_text": "Prerequisites: Ma 2, Ph 2, or instructor's permission.",
        "prereqs": [
            "ph-2-abc",
            "ma-2102"
        ]
    },
    "geese-140-c": {
        "id": "geese-140-c",
        "course_id": "Ge/ESE 140 c",
        "name": "Stable Isotope Biogeochemistry",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "An introduction to the use of stable isotopes in biogeochemistry, intended to give interested students the necessary background to understand applications in a variety of fields, from modern carbon cycling to microbial ecology to records of Ancient Earth. Topics include the principles of isotope distribution in reaction networks; isotope effects in enzyme-mediated reactions, and in metabolism and biosynthesis; characteristic fractionations accompanying carbon, nitrogen, and sulfur cycling; and applications of stable isotopes in the biogeosciences.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Sessions",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/stable-isotope-biogeochemistry",
        "prereq_text": "Prerequisites: Ge 140 a or equivalent.",
        "prereqs": []
    },
    "esegech-142": {
        "id": "esegech-142",
        "course_id": "ESE/Ge/Ch 142",
        "name": "Aquatic Chemistry of Natural Waters",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Zakem",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/aquatic-chemistry-of-natural-waters",
        "prereq_text": "Prerequisites: Ch 1 or instructor's permission.",
        "prereqs": []
    },
    "geese-143": {
        "id": "geese-143",
        "course_id": "Ge/ESE 143",
        "name": "Organic Geochemistry",
        "units": "9 units (3-2-4)",
        "terms": "third term",
        "description": "Main topics include the analysis, properties, sources, and cycling of natural organic materials in the environment, from their production in living organisms to burial and decomposition in sediments and preservation in the rock record. Specific topics include analytical methods for organic geochemistry, lipid structure and biochemistry, composition of organic matter, factors controlling organic preservation, organic climate and CO2 proxies, diagenesis and catagenesis, and biomarkers for ancient life. A laboratory component (three evening labs) teaches the extraction and analysis of modern and ancient organic biomarkers by GC/MS. Class includes a mandatory one-day (weekend) field trip to observe the Monterey Formation.",
        "offered": true,
        "instructors": "Sessions",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/organic-geochemistry",
        "prereq_text": "Prerequisites: Ch 41 a or equivalent.",
        "prereqs": []
    },
    "ese-144": {
        "id": "ese-144",
        "course_id": "ESE 144",
        "name": "Climate from Space",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This class will provide an overview of how we study the Earth's climate system using satellite remote sensing; a series of core lectures and guest lectures will be jointly taught by Caltech faculty and JPL scientists. Topics that will be covered include Introduction to the climate system; introduction to radiative transfer, retrieval methods and data assimilation; Earth's energy balance; atmospheric physics and composition; ocean dynamics and ice physics; monitoring the carbon cycle from space.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Teixeira, Thompson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/climate-from-space",
        "prereq_text": "",
        "prereqs": []
    },
    "mecegeese-146": {
        "id": "mecegeese-146",
        "course_id": "ME/CE/Ge/ESE 146",
        "name": "Computational Methods for Flow in Porous Media",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Fu",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/computational-methods-for-flow-in-porous-media",
        "prereq_text": "Prerequisites: ME 11 abc, ME 12 abc, ACM 95/100, ACM 106 ab (may be taken concurrently).",
        "prereqs": [
            "me-12-abc",
            "acm-95100-ab",
            "me-11-abc"
        ]
    },
    "gebibecnsese-147": {
        "id": "gebibecnsese-147",
        "course_id": "Ge/Bi/BE/CNS/ESE 147",
        "name": "Challenges and Opportunities in Quantitative Ecology",
        "units": "6 units (6-0-0)",
        "terms": "third term",
        "description": "Ecosystems are defined by dynamical interactions between groups of organisms, the communities they constitute, and the physical and chemical conditions and processes occurring in the environment. These dynamics are complex and multiscale across both length and time. This course will explore quantitative approaches that observe, measure, model, and monitor ecosystems and the services that they provide society-and the emerging opportunities that could employ these approaches to improve and strengthen global sustainability when it comes to our own ecology. This course will feature lectures each week from different members of the Caltech faculty working on ecological problems from different angles in order to illustrate how fresh insights can emerge by drawing on diverse ways-of-knowing.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Fischer, Tejada",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/challenges-and-opportunities-in-quantitative-ecology",
        "prereq_text": "",
        "prereqs": []
    },
    "geese-149": {
        "id": "geese-149",
        "course_id": "Ge/ESE 149",
        "name": "Marine Geochemistry",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Introduction to chemical oceanography and sediment geochemistry. We will address the question \"Why is the ocean salty?\" by examining the processes that determine the major, minor, and trace element distributions of seawater and ocean sediments. Topics include river and estuarine chemistry, air/sea exchange, nutrient uptake by the biota, radioactive tracers, redox processes in the water column and sediments, carbonate chemistry, and ventilation.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Adkins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/marine-geochemistry",
        "prereq_text": "Prerequisites: ESE 102.",
        "prereqs": []
    },
    "geese-150": {
        "id": "geese-150",
        "course_id": "Ge/ESE 150",
        "name": "Planetary Atmospheres",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "A broad survey of the formation, evolution, and present-day properties of planetary atmospheres, drawing examples from both the solar system and extrasolar planet literature. We will cover topics including energy balance, radiative transfer, chemistry, cloud formation, dynamics, and escape. The goal of this class is to provide an overview of key concepts relevant to planetary atmospheres that can serve as a foundation for future coursework or research in this area.",
        "offered": true,
        "instructors": "Knutson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/planetary-atmospheres",
        "prereq_text": "Prerequisites: Ch 1, Ma 2, Ph 2, or equivalents.",
        "prereqs": [
            "ph-2-abc",
            "ma-2102"
        ]
    },
    "geese-154": {
        "id": "geese-154",
        "course_id": "Ge/ESE 154",
        "name": "Readings in Paleoclimate",
        "units": "3 units (1-0-2)",
        "terms": "second term",
        "description": "Lectures and readings in areas of current interest in paleoceanography and paleoclimate.",
        "offered": true,
        "instructors": "Adkins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/readings-in-paleoclimate",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "geese-155": {
        "id": "geese-155",
        "course_id": "Ge/ESE 155",
        "name": "Paleoceanography",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Evaluation of the data and models that make up our current understanding of past climates. Emphasis will be placed on a historical introduction to the study of the past ten thousand to a few hundred thousand years, with some consideration of longer timescales. Evidence from marine and terrestrial sediments, ice cores, corals, and speleothems will be used to address the mechanisms behind natural climate variability. Models of this variability will be evaluated in light of the data. Topics will include sea level and ice volume, surface temperature evolution, atmospheric composition, deep ocean circulation, tropical climate, ENSO variability, and terrestrial/ocean linkages.",
        "offered": true,
        "instructors": "Adkins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/paleoceanography",
        "prereq_text": "Prerequisites: ESE 102.",
        "prereqs": []
    },
    "ese-156": {
        "id": "ese-156",
        "course_id": "ESE 156",
        "name": "Remote Sensing of the Atmosphere and Biosphere",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "An introduction into methods to quantify trace gases as well as vegetation properties remotely (from space, air-borne or ground-based). This course will provide the basic concepts of remote sensing, using hands-on examples to be solved in class and as problem-sets. Topics covered include Absorption spectroscopy, measurement and modeling techniques, optimal estimation theory and error characterization, applications in global studies of biogeochemical cycles and air pollution/quality. This course is complementary to EE/Ae 157 ab and Ge/EE/ESE 157 c with stronger emphasis on applications for the atmosphere and biosphere. Students will work with real and synthetic remote sensing data (basic knowledge of a scripting language is required, most of the examples will be in Julia).",
        "offered": true,
        "instructors": "Frankenberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/remote-sensing-of-the-atmosphere-and-biosphere",
        "prereq_text": "Prerequisites: ESE 101 or instructor's permission.",
        "prereqs": []
    },
    "geeeese-157-c": {
        "id": "geeeese-157-c",
        "course_id": "Ge/EE/ESE 157 c",
        "name": "Remote Sensing for Environmental and Geological Applications",
        "units": "9 units (3-3-3)",
        "terms": "third term",
        "description": "Analysis of electromagnetic radiation at visible, infrared, and radio wavelengths for interpretation of the physical and chemical characteristics of the surfaces of Earth and other planets. Topics: interaction of light with materials, spectroscopy of minerals and vegetation, atmospheric removal, image analysis, classification, and multi-temporal studies. This course does not require but is complementary to EE 157 ab with emphasis on applications for geological and environmental problems, using data acquired from airborne and orbiting remote sensing platforms. Students will work with digital remote sensing datasets in the laboratory and there will be one field trip.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Ehlmann",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/remote-sensing-for-environmental-and-geological-applications",
        "prereq_text": "",
        "prereqs": []
    },
    "eseche-158": {
        "id": "eseche-158",
        "course_id": "ESE/ChE 158",
        "name": "Aerosol Physics and Chemistry",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Fundamentals of aerosol physics and chemistry; aerodynamics and diffusion of aerosol particles; condensation and evaporation; thermodynamics of particulate systems; nucleation; coagulation; particle size distributions; optics of small particles.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Flagan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/aerosol-physics-and-chemistry",
        "prereq_text": "",
        "prereqs": []
    },
    "esebi-166": {
        "id": "esebi-166",
        "course_id": "ESE/Bi 166",
        "name": "Microbial Physiology",
        "units": "9 units (3-1-5)",
        "terms": "first term",
        "description": "A course on growth and functions in the prokaryotic cell. Topics covered: growth, transport of small molecules, protein excretion, membrane bioenergetics, energy metabolism, motility, chemotaxis, global regulators, and metabolic integration.",
        "offered": true,
        "instructors": "Leadbetter",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/microbial-physiology",
        "prereq_text": "Prerequisites: one year of general biology recommended.",
        "prereqs": []
    },
    "esebi-168": {
        "id": "esebi-168",
        "course_id": "ESE/Bi 168",
        "name": "Microbial Metabolic Diversity",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A course on the metabolic diversity of microorganisms. Basic thermodynamic principles governing energy conservation will be discussed, with emphasis placed on photosynthesis and respiration. Students will be exposed to genetic, genomic, and biochemical techniques that can be used to elucidate the mechanisms of cellular electron transfer underlying these metabolisms.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Newman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/microbial-metabolic-diversity",
        "prereq_text": "Prerequisites: ESE 142, ESE/Bi 166.",
        "prereqs": []
    },
    "esegech-171": {
        "id": "esegech-171",
        "course_id": "ESE/Ge/Ch 171",
        "name": "Atmospheric Chemistry I",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A detailed course about chemical transformation in Earth's atmosphere. Kinetics, spectroscopy, and thermodynamics of gas-phase chemistry of the stratosphere and troposphere; sources, sinks, and lifetimes of trace atmospheric species; stratospheric ozone chemistry; oxidation mechanisms in the troposphere; aerosol chemistry.",
        "offered": true,
        "instructors": "Wennberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/atmospheric-chemistry-i",
        "prereq_text": "Prerequisites: Ch 1 or equivalent.",
        "prereqs": []
    },
    "esegech-172": {
        "id": "esegech-172",
        "course_id": "ESE/Ge/Ch 172",
        "name": "Atmospheric Chemistry II",
        "units": "3 units (3-0-0)",
        "terms": "first term",
        "description": "A lecture and discussion course about active research in atmospheric chemistry. Potential topics include halogen chemistry of the stratosphere and troposphere; aerosol formation in remote environments; coupling of dynamics and photochemistry; development and use of modern remote-sensing and in situ instrumentation. Graded pass/fail.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Seinfeld, Wennberg",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/atmospheric-chemistry-ii",
        "prereq_text": "Prerequisites: ESE/Ge/Ch 171 or equivalent.",
        "prereqs": []
    },
    "esech-176": {
        "id": "esech-176",
        "course_id": "ESE/Ch 176",
        "name": "Environmental Physical Organic Chemistry",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will cover selected aspects of the chemistry of aquatic systems. Lectures cover basic principles of physical-organic chemistry relevant to the aquatic environment under realistic conditions. Specific topics covered in this course include the basic principles of equilibrium chemical and physical processes important for natural waters. Topics include: chemical potential, fugacity, phase transfer, acid-base chemistry, metal-ligand substitution chemistry, surface chemistry, octanol-water partitioning, air-water partitioning, partitioning to solid organic matter and biomedia, sorption processes, air-water exchange dynamics, and the kinetics and mechanisms of coupled organic and inorganic redox reactions. Thermodynamics, transport, phase transfer and kinetics are emphasized.",
        "offered": true,
        "instructors": "Diallo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/environmental-physical-organic-chemistry",
        "prereq_text": "Prerequisites: Ch 41 ab or instructor's permission.",
        "prereqs": []
    },
    "esech-177": {
        "id": "esech-177",
        "course_id": "ESE/Ch 177",
        "name": "Environmental Physical Organic Chemistry Part II",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will cover selected aspects of the organic chemistry of aquatic systems and coupled air-water systems. Topics include photochemical transformations, biochemical transformations in sub-surface water, surface water, and sediments, heterogeneous surface reactions and catalysis, hydrolysis reactions, nucleophilic displacement and substitution reactions, elimination reactions, carboxylic acid ester hydrolysis, thiophosphoric acid ester hydrolysis, carbamate ester hydrolysis, and amide ester hydrolysis. The primary goal is to better understand factors controlling the fate and behavior of organic compounds and persistent organic pollutants in the global environment. Case studies will be presented.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/environmental-physical-organic-chemistry-part-ii",
        "prereq_text": "Prerequisites: ESE/Ch 176 or instructor's permission.",
        "prereqs": []
    },
    "geesebi-178": {
        "id": "geesebi-178",
        "course_id": "Ge/ESE/Bi 178",
        "name": "Microbial Ecology",
        "units": "9 units (3-2-4)",
        "terms": "second term",
        "description": "Structural, phylogenetic, and metabolic diversity of microorganisms in nature. The course explores microbial interactions, relationships between diversity and physiology in modern and ancient environments, and influence of microbial community structure on biogeochemical cycles. Introduction to ecological principles and molecular approaches used in microbial ecology and geobiological investigations.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Orphan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/microbial-ecology",
        "prereq_text": "Prerequisites: either ESE/Bi 166 or ESE/Bi 168 recommended.",
        "prereqs": []
    },
    "esemeesteccheee-179": {
        "id": "esemeesteccheee-179",
        "course_id": "ESE/ME/EST/Ec/ChE/EE 179",
        "name": "Climate Change Impacts, Mitigation and Adaptation",
        "units": "3 units (3-0-0)",
        "terms": "second term",
        "description": "Climate change has already begun to impact life on the planet, and will continue in the coming decades. This class will explore particular causes and impacts of climate change, technologies to mitigate or adapt to those impacts, and the economic and social costs associated with them - particular focus will be paid to distributional issues, environmental and racial justice and equity intersections. The course will consist of 3-4 topical modules, each focused on a specific impact or sector (e.g. the electricity or transportation sector, climate impacts of food and agriculture, increasing fires and floods). Each module will contain lectures/content on the associated climate science background, engineering/technological developments to combat the issue, and an exploration of the economics and the inequities that exacerbate the situation, followed by group discussion and synthesis of the different perspectives.",
        "offered": true,
        "instructors": "Wennberg, Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/climate-change-impacts,-mitigation-and-adaptation",
        "prereq_text": "",
        "prereqs": []
    },
    "esegebiche-184": {
        "id": "esegebiche-184",
        "course_id": "ESE/Ge/Bi/ChE 184",
        "name": "Computational Tools for Decoding Microbial Ecosystems",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Karthikeyan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/computational-tools-for-decoding-microbial-ecosystems",
        "prereq_text": "Prerequisites: Prior knowledge in Microbiology/Microbial Ecology is required (or instructor's approval). Proficiency in python, bash, slurm, while encouraged, is not required.",
        "prereqs": []
    },
    "ese-200": {
        "id": "ese-200",
        "course_id": "ESE 200",
        "name": "Advanced Topics in Environmental Science and Engineering",
        "units": "",
        "terms": "any term",
        "description": "Course on contemporary topics in environmental science and engineering. Topics covered vary from year to year, depending on the interests of the students and staff.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/advanced-topics-in-environmental-science-and-engineering",
        "prereq_text": "",
        "prereqs": []
    },
    "gebiese-246": {
        "id": "gebiese-246",
        "course_id": "Ge/Bi/ESE 246",
        "name": "Molecular Geobiology Seminar",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "Critical reviews and discussion of classic papers and current research in microbiology and geomicrobiology. As the topics will vary from year to year, it may be taken multiple times.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Orphan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/molecular-geobiology-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "geesebi-248": {
        "id": "geesebi-248",
        "course_id": "Ge/ESE/Bi 248",
        "name": "Environmental Justice",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "This seminar course will explore and discuss the unique intersection of environmental racism, environmental justice, and academia. Course material will primarily feature readings and videos on a case study-like basis and focus on bringing conversations typically had in humanities, social sciences and activism to the bio and geosciences. Topics will center around two primary approaches: an \"outward-facing\" component that looks at environmental racism through the lens of various activisms, and an \"inward-facing\" component addressing the biases/malpractices broadly employed in the biological and geosciences, as well as the apparent moral dilemmas of decisions involving multiple stakeholders. Out of class work will largely be based on assigned readings, some multimedia presentations, and occasional writings and thought exercises. This course is taught concurrently with Hum 61 and can only be taken once, as Ge/ESE/Bi 248 or Hum 61.",
        "offered": true,
        "instructors": "Orphan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/environmental-justice",
        "prereq_text": "",
        "prereqs": []
    },
    "gebiesece-249": {
        "id": "gebiesece-249",
        "course_id": "Ge/Bi/ESE/CE 249",
        "name": "Stable Isotopes: Ecological and Environmental Applications",
        "units": "9 units (3-3-3)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Tejada",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/stable-isotopes:-ecological-and-environmental-applications",
        "prereq_text": "",
        "prereqs": []
    },
    "geese-298": {
        "id": "geese-298",
        "course_id": "Ge/ESE 298",
        "name": "Mentoring and Outreach",
        "units": "Units to be arranged, up to 12 units per year",
        "terms": "",
        "description": "In consultation with a faculty advisor and the Caltech Center for Teaching, Learning, and Outreach, students may obtain credit for engaging in volunteer efforts to promote public understanding of science; to mentor and tutor young people and underserved populations; or to otherwise contribute to the diversity, equity, and inclusiveness of the scientific enterprise. Students may petition their option representative (graduate students) or academic advisor (undergraduate students) if they seek credits beyond the 12-unit limit.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/mentoring-and-outreach",
        "prereq_text": "",
        "prereqs": []
    },
    "ese-300": {
        "id": "ese-300",
        "course_id": "ESE 300",
        "name": "Thesis Research",
        "units": "",
        "terms": "any term",
        "description": "Thesis research for graduate students after passing the qualifying exam. Graded pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ese/thesis-research",
        "prereq_text": "",
        "prereqs": []
    }
}