{
    "esl-101-ab": {
        "id": "esl-101-ab",
        "course_id": "ESL 101 ab",
        "name": "Oral Communication and Presentation",
        "units": "3 units (3-0-0)",
        "terms": "first, second terms",
        "description": "This course focuses on preparing non-native speakers of English with the communication skills necessary to organize, present or exchange information in a clear, concise manner to a variety of audiences. ESL 101 a will provide instruction on the development of pronunciation, intonation patterns and stress, grammar and verb tense, listening comprehension, and fluency in speaking. Aspects of American culture as well as come current events will be discussed. ESL 101 b is a continuation of ESL 101 a, and covers a variety of oral presentation skills. Students will be asked to paraphrase, summarize, and synthesize information from a journal article or in-class discussions and communicate ideas to the class. The class will discuss information from readings and other media sources in small groups to collect and organize ideas for discussion. ESL 101 ab is open to all first-year graduate students and may be required for some students designated by the ESL interview process during Orientation. A passing grade will satisfy the Institute English proficiency requirement for candidacy. Graded pass/fail. Open to international graduate students only.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/esl/oral-communication-and-presentation",
        "prereq_text": "",
        "prereqs": []
    },
    "eslwr-107": {
        "id": "eslwr-107",
        "course_id": "ESL/Wr 107",
        "name": "Fundamentals of Scientific Writing",
        "units": "6 units (3-0-3)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/esl/fundamentals-of-scientific-writing",
        "prereq_text": "",
        "prereqs": []
    }
}