{
    "fs-2": {
        "id": "fs-2",
        "course_id": "FS 2",
        "name": "The Evolution of Information Systems: From Life to Artificial Intelligence",
        "units": "6 units (2-0-4)",
        "terms": "second term",
        "description": "What is life? What is special about the human brain? How did the invention of writing enable the transition from human intelligence to artificial intelligence? We will argue that life is an information system that has memory stored in syntax (DNA) that is enriched by an innovation process (mutation and selection) that leads to new species. Also, we will argue that the human brain is an information system that has memory (enabled by natural languages) that is enriched by an innovation process (learning) that leads to new ideas. The emergence of life and the human brain served as the backdrop to the information (r)evolution that we are witnessing today!",
        "offered": true,
        "instructors": "Bruck",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/fs/the-evolution-of-information-systems:-from-life-to-artificial-intelligence",
        "prereq_text": "",
        "prereqs": []
    },
    "fsay-3": {
        "id": "fsay-3",
        "course_id": "FS/Ay 3",
        "name": "First-Year Seminar: Automating Discovering the Universe",
        "units": "6 units (2-0-4)",
        "terms": "",
        "description": "Powerful new instruments enable astronomers to collect huge volumes of data on billions of objects. As a result, astronomy is changing dramatically: by the end of this decade, most astronomers will probably be analyzing data collected in large surveys, and only a few will still be visiting observatories to collect their own data. The tool chest of future astronomers will involve facility with \"big data\", developing clever queries, algorithms (some based on machine learning) and statistics, and combining multiple databases. This course will introduce students to some of these tools. After \"recovering\" known objects, students will be unleashed to make their own astronomical discoveries in new data sets. Limited enrollment.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/fs/first-year-seminar:-automating-discovering-the-universe",
        "prereq_text": "",
        "prereqs": []
    },
    "fsph-4": {
        "id": "fsph-4",
        "course_id": "FS/Ph 4",
        "name": "First-Year Seminar: Astrophysics and Cosmology with Open Data",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "Astrophysics and cosmology are in the midst of a golden age of science-rich observations from incredibly powerful telescopes of various kinds. The data from these instruments are often freely available on the web. Anyone can do things like study x-rays from pulsars in our galaxy or gamma rays from distant galaxies using data from Swift and Fermi; discover planets eclipsing nearby stars using data from Kepler; measure the expansion of the universe using supernovae data; study the cosmic microwave background with data from Planck; find gravitational waves from binary black hole mergers using data from LIGO; and study the clustering of galaxies using Hubble data. We will explore some of these data sets and the science that can be extracted from them. A primary goal of this class is to develop skills in scientific computing and visualization. Bring your laptop!",
        "offered": true,
        "instructors": "Weinstein",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/fs/first-year-seminar:-astrophysics-and-cosmology-with-open-data",
        "prereq_text": "",
        "prereqs": []
    },
    "fsph-9": {
        "id": "fsph-9",
        "course_id": "FS/Ph 9",
        "name": "First-Year Seminar: The Science of Music",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "This course will focus on the physics of sound, how musical instruments make it, and how we hear it, including readings, discussions, demonstrations, and student observations using sound analysis software. In parallel we will consider what differentiates music from other sounds, and its role psychically and culturally. Students will do a final project of their choice and design, with possibilities including analysis of recordings of actual musical instruments, instrument construction and analysis, and tests or surveys of people's abilities or preferences. First-year (undergraduate) only; limited enrollment.",
        "offered": true,
        "instructors": "Politzer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/fs/first-year-seminar:-the-science-of-music",
        "prereq_text": "",
        "prereqs": []
    },
    "fsph-11-abc": {
        "id": "fsph-11-abc",
        "course_id": "FS/Ph 11 abc",
        "name": "First-Year Seminar: Beyond Physics",
        "units": "6 units (2-0-4)",
        "terms": "second, third terms of a first-year student's first year and first term of sophomore year",
        "description": "First-year students are offered the opportunity to enroll in this class by submitting potential solutions to problems posed in the fall term. A small number of solutions will be selected as winners, granting those students permission to register. This course demonstrates how research ideas arise, are evaluated, and tested and how the ideas that survive are developed. Weekly group discussions and one-on-one meetings with faculty allow students to delve into cutting edge scientific research. Ideas from physics are used to think about a huge swath of problems ranging from how to detect life on extrasolar planets to exploring the scientific underpinnings of science fiction in Hollywood films to considering the efficiency of molecular machines. Support for summer research at Caltech between an undergraduate's first and sophomore years will be automatic for students making satisfactory progress. Graded pass/fail. First-year (undergraduates) only; limited enrollment.",
        "offered": true,
        "instructors": "Phillips",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/fs/first-year-seminar:-beyond-physics",
        "prereq_text": "",
        "prereqs": []
    },
    "fsma-12": {
        "id": "fsma-12",
        "course_id": "FS/Ma 12",
        "name": "First-Year Seminar: The Mathematics of Enzyme Kinetics",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "Enzymes are at the heart of biochemistry. We will begin with a down to earth discussion of how, as catalysts, they are used to convert substrate to product. Then we will model their activity by using explicit equations. Under ideal conditions, their dynamics are described by a system of first order differential equations. The difficulty will be seen to stem from them being non-linear. However, under a steady state hypothesis, they reduce to a simpler equation, whose solution can describe the late time behavior. The students will apply it to some specially chosen, real examples.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/fs/first-year-seminar:-the-mathematics-of-enzyme-kinetics",
        "prereq_text": "Prerequisites: Ma 1 ab.",
        "prereqs": [
            "ma-1-d",
            "ma-1-abc"
        ]
    },
    "fsph-15": {
        "id": "fsph-15",
        "course_id": "FS/Ph 15",
        "name": "First-Year Seminar: Quantum Information Science Today and Tomorrow",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "Quantum information science is transforming our understanding of the physical world and pointing toward revolutionary future technologies. We will explore the conceptual foundations of this rapidly advancing field. Topics to be discussed include quantum entanglement, Bell inequalities, decoherence, quantum metrology, quantum computing, quantum error correction, and quantum cryptography.",
        "offered": true,
        "instructors": "Preskill",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/fs/first-year-seminar:-quantum-information-science-today-and-tomorrow",
        "prereq_text": "",
        "prereqs": []
    },
    "fsge-16": {
        "id": "fsge-16",
        "course_id": "FS/Ge 16",
        "name": "First-year Seminar: Earthquakes",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "Earthquakes and volcanic eruptions constitute some of the world's major natural hazards. What is the science behind prediction and/or rapid response to these events? We will review the current understanding of the science, the efforts that have been made in earthquake and volcano forecasting, and real-time response to these events. We will learn about advances in earthquake preparation in Southern California, and volcanic eruption forecasting and hazard mitigation elsewhere. There is a required field trip to visit faults and volcanoes somewhere in southern California. First-year (undergraduates) only; limited enrollment.",
        "offered": true,
        "instructors": "Stock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/fs/first-year-seminar:-earthquakes",
        "prereq_text": "",
        "prereqs": []
    },
    "fsesege-18": {
        "id": "fsesege-18",
        "course_id": "FS/ESE/Ge 18",
        "name": "First-Year Seminar: The Unseen Microbial World in Plain Sight",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "To paraphrase a Caltech engineering colleague: \"In terms of Earth and the Environment, our species had been nothing more than the hood ornament on a really interesting car. We should be studying what's under the hood, the microbial world, if we want to understand the engine\". We will spend the term examining striking examples of microbes and microbial activities in the environment. First-year (undergraduates) only; limited enrollment.",
        "offered": true,
        "instructors": "Leadbetter",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/fs/first-year-seminar:-the-unseen-microbial-world-in-plain-sight",
        "prereq_text": "",
        "prereqs": []
    },
    "fsge-20": {
        "id": "fsge-20",
        "course_id": "FS/Ge 20",
        "name": "First-Year Seminar: Life in the Universe",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/fs/first-year-seminar:-life-in-the-universe",
        "prereq_text": "",
        "prereqs": []
    }
}