{
    "humh-1": {
        "id": "humh-1",
        "course_id": "Hum/H 1",
        "name": "The Classical and Medieval Worlds",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "This course will survey the evolution of Mediterranean and European civilization from antiquity through the end of the Middle Ages. It will emphasize the reading and discussion of primary sources, especially but not exclusively literary works, against the backdrop of the broad historical narrative of the periods. The readings will present students with the essential characteristics of various ancient and medieval societies and give students access to those societies' cultural assumptions and perceptions of change.",
        "offered": true,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/the-classical-and-medieval-worlds",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-2": {
        "id": "humh-2",
        "course_id": "Hum/H 2",
        "name": "Freedom Dreams: African American Visions of Liberation Since Emancipation",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Over the course of their history in the United States, African Americans have advanced various visions of liberation and strategies for attaining it. This course will examine how African Americans have conceptualized and sought to realize their freedom dreams since the end of chattel slavery. We will focus, in particular, on visions of freedom considered radical or utopian, both in their contemporary moment and in our present. Investigating how African Americans have imagined freer lives beyond their own localities, beyond U.S. borders, and even beyond Earth, our topics of discussion in the course may include emigration movements, black communism, pan-Africanism, black feminism, cults, Afrofuturism, hip hop culture, and abolitionism.",
        "offered": true,
        "instructors": "Wiggins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/freedom-dreams:-african-american-visions-of-liberation-since-emancipation",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-3": {
        "id": "humh-3",
        "course_id": "Hum/H 3",
        "name": "The United States in the Twentieth Century",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Designed to introduce students to the academic study of history, this course examines key issues and events that shaped the political, social, and cultural history of the United States in the Twentieth Century. Through a wide variety of historical sources-including primary documents, fiction, and music-students will explore issues such as popular culture, immigration and labor, the civil rights movement, political realignment, and American intervention abroad.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/the-united-states-in-the-twentieth-century",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-5": {
        "id": "humh-5",
        "course_id": "Hum/H 5",
        "name": "The History of the Chinese Empire",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "This class will explore several facets of how the concept of empire and its historical formation in China was defined, portrayed, and developed over time. It offers students a chance to reflect on the interaction of event, record, and remembrance as these components combine in the creation and contestation of history. This course will particularly emphasize how the making, writing, and remembering of history responds to the advent of different regimes of legitimacy in order to give students a new perspective on the relationship between action, authorship, and interpretation in history.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/the-history-of-the-chinese-empire",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-6": {
        "id": "humh-6",
        "course_id": "Hum/H 6",
        "name": "Civilization, Science, and Archaeology: The Development of Science from Babylon through the Renaissance",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "Connections in antiquity between astrology and astronomy, early theories of light, Islamic science, new concepts of knowledge during the European Middle Ages and Renaissance, the early laboratory, the development of linear perspective, the origins of the Copernican and Keplerian systems of astronomy, and the science of Galileo.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/civilization,-science,-and-archaeology:-the-development-of-science-from-babylon-through-the-renaissance",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-7": {
        "id": "humh-7",
        "course_id": "Hum/H 7",
        "name": "Civilization, Science, and Archaeology: The Nature of Religious Belief in Ancient Egypt, Mesopotamia, and Israel",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "The civilizations of Egypt and Mesopotamia gave rise to complex forms of religious practices connected to the social order, moral behavior, and the afterlife. The course examines the origins of concepts of moral death and of sin as a violation of cosmic order in antiquity, the nature of polytheism, and the manner in which monotheism arose out of it. In addition to historical analyses the course includes readings by anthropologists who have studied cult structures as well as contemporary theories by evolutionary psychologists.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/civilization,-science,-and-archaeology:-the-nature-of-religious-belief-in-ancient-egypt,-mesopotamia,-and-israel",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-8": {
        "id": "humh-8",
        "course_id": "Hum/H 8",
        "name": "Civilization, Science, and Archaeology: Before Greece: The Origins of Civilization in Mesopotamia",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "This course will introduce students to the early development of civilization in Mesopotamia and Egypt from 4000 B.C.E. through 1000 B.C.E. Origins of agriculture and writing, the evolution of the city, and the structures of the Mesopotamian economy and social order will be discussed. Comparison with contemporary developments in Egypt during the Old and Middle Kingdoms may include a reading of Gilgamesh from 3000 B.C.E. and of the Egyptian Tale of Sinuhe. The course concludes with a discussion of life during the late Bronze Age. Focus will be on life as it was lived and experienced by many groups in pre-classical antiquity rather than on kings and dynasties.",
        "offered": true,
        "instructors": "Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/civilization,-science,-and-archaeology:-before-greece:-the-origins-of-civilization-in-mesopotamia",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-9": {
        "id": "humh-9",
        "course_id": "Hum/H 9",
        "name": "Europe Transformed",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Will introduce students to major aspects of the politics and culture of modernity that have profoundly transformed Western society and consciousness from the French Revolution to the contemporary era. A variety of historical, literary, and artistic works will be used to illuminate major social, intellectual, and cultural movements. The focus will be on significant and wide-ranging historical change (e.g., the industrial revolution, imperialism, socialism, fascism); on cultural innovation (e.g., modernism, impressionism, cubism); and on the work of significant thinkers.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Kormos-Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/europe-transformed",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-10": {
        "id": "humh-10",
        "course_id": "Hum/H 10",
        "name": "Medieval Europe: The Problem of Violence",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "This course will explore how people understood violence in Europe between ca. 500 and ca. 1400 AD. It will focus on the various norms that governed the use of violence in a period when the right of free people to carry and use weapons was considered self-evident. Working through primary sources, students will explore the relationship between violence and vengeance, the law, central authority and public order, religion, emotions, public ritual, and economics. As they go along students will consider whether violence can coexist with or even promote stable, ordered societies, or whether it by definition creates disorder.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/medieval-europe:-the-problem-of-violence",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-11": {
        "id": "humh-11",
        "course_id": "Hum/H 11",
        "name": "Love and Death: Using Demography to Study the History of Europe from 1700",
        "units": "9 units (3-0-6)",
        "terms": "first, third terms",
        "description": "Demographic events-births, marriages, deaths-have always been highly responsive to changes in the local environment. Decisions about when to marry, how many children to have, or what kind of household to live in have always been closely correlated to decisions people take in other areas of their lives and, as a result, can tell us a great deal about the economic, social, and cultural worlds people inhabit. This course examines differences in demographic trends in Europe across space and time, from 1700 to the present, as well as existing explanations for these differences, including political economic factors, social and cultural norms, biology and disease environments. Some topics include: the demographic effects of war, industrialization, and urbanization; changes related to the emergence of reliable contraceptive technologies; changes related to the expansion of economic opportunities for women; the effects of government policies on demographic decisions.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dennison",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/love-and-death:-using-demography-to-study-the-history-of-europe-from-1700",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-12": {
        "id": "humh-12",
        "course_id": "Hum/H 12",
        "name": "Social Theory",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course introduces students to both canonical and non-canonical theories of society. From the formative debates over the role of the state in human affairs in early modern Europe to radical interpretations of social good in the twentieth century, students will be exposed to competing theories of society and their implications in the political, the economic, the emotional, and the scientific realms. By the end of the quarter, students will be able to link contemporary notions of individuality, agency, rationality, morality, and ethics to divergent discourses in the history of social theory.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/social-theory",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-13": {
        "id": "humh-13",
        "course_id": "Hum/H 13",
        "name": "Brave New Worlds: Race, Human Rights and the Age of Discovery",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course traces the origins of modern racism and, perhaps surprisingly, of human rights advocacy itself, to a seminal moment in global history sometimes called the Age of Discovery. At this time, two small European kingdoms, Spain and Portugal, first conducted trade and conquest in Atlantic Africa, the Americas, and the Indian and Pacific Oceans, forging the world's first truly global empires. We study the legacy of racism and humanitarianism in eye-witness accounts, maps, images and other materials attesting to Spain's seminal encounters with the Americas.",
        "offered": true,
        "instructors": "Wey-Gomez",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/brave-new-worlds:-race,-human-rights-and-the-age-of-discovery",
        "prereq_text": "",
        "prereqs": []
    },
    "humhhps-14": {
        "id": "humhhps-14",
        "course_id": "Hum/H/HPS 14",
        "name": "Race, Science, and Medicine in U.S. History",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will explore how natural philosophers and scientists have defined, used, and sometimes challenged ideas about race from the eighteenth century to today. Using a range of primary and secondary sources, we will examine how scientific ideas about race developed in concert with European imperial expansion and slavery; how these ideas were employed in legal cases, medical practice, and eugenics policies; and how activists and scholars have challenged racist practices and ideas. Finally, we will turn to the recent resurgence of racial thinking in biology and medicine in the light of the history of race and science.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/race,-science,-and-medicine-in-u.s.-history",
        "prereq_text": "",
        "prereqs": []
    },
    "humhhps-15": {
        "id": "humhhps-15",
        "course_id": "Hum/H/HPS 15",
        "name": "Waste in the World",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "The things that human beings make and throw away rarely stay where we put them. Just as humans have shaped the biological and physical world, the biological and physical world shapes human actions. In this course, we will examine how these interacting forces propel environmental and cultural change. We will explore these concepts through the lens of waste - how different groups at different points in history define waste, where discarded things go and what they become as they move through space and time. We will consider how conflicting perceptions of utility and waste in different cultural and historical contexts have factored into shifting ideas about race, class, gender, wilderness, technology, consumption, and sovereignty. In rethinking waste, we will explore the multiple meanings of \"nature,\" assess the roots of sustainability, and evaluate past events in light of current ideas about environmental justice. While this course prioritizes reading and discussion, we will also engage with the world around us through visual analysis. Pasadena and Los Angeles will be among our most important resources, allowing us to ground global ideas in a local context.",
        "offered": true,
        "instructors": "Rand",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/waste-in-the-world",
        "prereq_text": "",
        "prereqs": []
    },
    "humhhps-18": {
        "id": "humhhps-18",
        "course_id": "Hum/H/HPS 18",
        "name": "Introduction to the History of Science",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "Major topics include the following: What are the origins of modern Western science, when did it emerge as distinct from philosophy and other cultural and intellectual productions, and what are its distinguishing features? When and how did observation, experiment, quantification, and precision enter the practice of science? What were some of the major turning points in the history of science? What is the changing role of science and technology? Using primary and secondary sources, students will take up significant topics in the history of science, from ancient Greek science to the 20th-century revolution in physics, biology, and technology. Hum/H/HPS 10 may be taken for credit toward the additional 36-unit HSS requirement by HPS majors and minors who have already fulfilled their first-year humanities requirement and counts as a history course in satisfying the first-year humanities breadth requirement.",
        "offered": true,
        "instructors": "Feingold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/introduction-to-the-history-of-science",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-19": {
        "id": "humh-19",
        "course_id": "Hum/H 19",
        "name": "Righting the Wrongs of History",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "In recent years, growing numbers of people committed to equity and social justice have discussed various ways of addressing historical injustices whose harms are still experienced in the present. Some have proposed monetary restitution and other restorative strategies that account for resources, opportunities, and lives lost. Others have advocated more symbolic reparative approaches that seek to heal the psychic wounds of injustice. This course will examine efforts to right the wrongs of history, with particular attention given to the decades-long movement for reparations for African Americans and recent efforts to address difficult histories at Caltech. Investigating initiatives that have been realized and others that have been only imagined, in this course we will seek to understand both the possibilities and impossibilities of repairing historical harms.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Wiggins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/righting-the-wrongs-of-history",
        "prereq_text": "",
        "prereqs": []
    },
    "humhhps-20": {
        "id": "humhhps-20",
        "course_id": "Hum/H/HPS 20",
        "name": "COVID-19 and Other Pandemics: Science, Medicine, and Public Controversies",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Kormos-Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/covid-19-and-other-pandemics:-science,-medicine,-and-public-controversies",
        "prereq_text": "",
        "prereqs": []
    },
    "h-60": {
        "id": "h-60",
        "course_id": "H 60",
        "name": "Reading in History",
        "units": "",
        "terms": "any term",
        "description": "Reading in history and related subjects, done either in connection with the regular courses or independently, but under the direction of members of the department. A brief written report will usually be required. Graded pass/fail. Not available for credit toward humanities-social science requirement.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/reading-in-history",
        "prereq_text": "",
        "prereqs": []
    },
    "ehvc-89": {
        "id": "ehvc-89",
        "course_id": "E/H/VC 89",
        "name": "New Media Arts in the 20th and 21st Centuries",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will examine artists' work with new technology, fabrication methods and media from the late 19th Century to the present. Major artists, exhibitions, and writings of the period will be surveyed. While considering this historical and critical context, students will create their own original new media artworks using technologies and/or fabrication methods they choose. Possible approaches to projects may involve robotics, electronics, computer programming, computer graphics, mechanics and other technologies. Students will be responsible for designing and fabricating their own projects. Topics may include systems in art, the influence of industrialism, digital art, robotics, telematics, media in performance, interactive installation art, and technology in public space. Artists studied may include Eadweard Muybridge, Marcel Duchamp, Vladmir Tatlin, John Cage, Jean Tinguely, Stelarc, Survival Research Laboratories, Lynne Hershman Leeson, Edwardo Kac, Natalie Jeremenjenko, Heath Bunting, Janet Cardiff and others.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Mushkin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/new-media-arts-in-the-20th-and-21st-centuries",
        "prereq_text": "",
        "prereqs": []
    },
    "h-98": {
        "id": "h-98",
        "course_id": "H 98",
        "name": "Reading in History",
        "units": "9 units (1-0-8)",
        "terms": "",
        "description": "An individual program of directed reading in history, in areas not covered by regular courses.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/reading-in-history",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "h-99-abc": {
        "id": "h-99-abc",
        "course_id": "H 99 abc",
        "name": "Research Tutorial",
        "units": "9 units (1-0-8)",
        "terms": "",
        "description": "Students will work with the instructor in the preparation of a research paper, which will form the basis of an oral examination.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/research-tutorial",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "vch-102": {
        "id": "vch-102",
        "course_id": "VC/H 102",
        "name": "Looking East/Looking West",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "From teapots to pastries, photographs to palanquins, objects and images mediated encounters between people and helped define the \"Orient\" and the \"Occident\". This class looks at the visual and material culture produced by and consumed during encounters between European and Asian travelers, diplomats, artists, writers, and tourists since the eighteenth century.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/looking-east/looking-west",
        "prereq_text": "",
        "prereqs": []
    },
    "h-107": {
        "id": "h-107",
        "course_id": "H 107",
        "name": "The Early Middle Ages",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course is designed to introduce students to the formative period of Western medieval history, from roughly 300 to 1000 CE. It will emphasize the development of a new civilization from the fusion of Roman, Germanic, and Christian traditions, with a focus on the Frankish world. The course focuses on the reading, analysis, and discussion of primary sources.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/the-early-middle-ages",
        "prereq_text": "",
        "prereqs": []
    },
    "h-108": {
        "id": "h-108",
        "course_id": "H 108",
        "name": "The High Middle Ages",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course is designed to introduce students to European history between 1000 and 1400. It will provide a topical as well as chronological examination of the economic, social, political, and religious evolution of western Europe during this period, with a focus on France, Italy, England, and Germany. The course emphasizes the reading, analysis, and discussion of primary sources.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/the-high-middle-ages",
        "prereq_text": "",
        "prereqs": []
    },
    "h-109": {
        "id": "h-109",
        "course_id": "H 109",
        "name": "Medieval Knighthood",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course tells the story of the knight from his beginnings in the early Middle Ages, through his zenith in the 11th, 12th, and 13th centuries, to his decline and transformation in the late medieval and early modern periods. The course treats the knight not simply as a military phenomenon but also as a social, political, religious, and cultural figure who personified many of the elements that set the Middle Ages apart.",
        "offered": true,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/medieval-knighthood",
        "prereq_text": "",
        "prereqs": []
    },
    "h-110": {
        "id": "h-110",
        "course_id": "H 110",
        "name": "Environment and Empire in the Early Modern Atlantic World",
        "units": "9 units (3-0-6)",
        "terms": "first",
        "description": "",
        "offered": true,
        "instructors": "Jones",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/environment-and-empire-in-the-early-modern-atlantic-world",
        "prereq_text": "",
        "prereqs": []
    },
    "h-111": {
        "id": "h-111",
        "course_id": "H 111",
        "name": "The Medieval Church",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course takes students through the history of the medieval Christian Church in Europe, from its roots in Roman Palestine, through the zenith of its power in the high Middle Ages, to its decline on the eve of the Reformation. The course focuses on the church less as a religion (although it will by necessity deal with some basic theology) than as an institution that came to have an enormous political, social, cultural, and economic impact on medieval life, and for a brief time made Rome once more the mistress of Europe.",
        "offered": true,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/the-medieval-church",
        "prereq_text": "",
        "prereqs": []
    },
    "h-112": {
        "id": "h-112",
        "course_id": "H 112",
        "name": "The Vikings",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will take on the Scandinavian seafaring warriors of the 8th-11th centuries as a historical problem. What were the Vikings, where did they come from, and how they did they differ from the Scandinavian and north German pirates and raiders who preceded them? Were they really the horned-helmeted, bloodthirsty barbarians depicted by modern popular media and by many medieval chronicles? What effect did they have in their roughly two centuries of raiding and colonization on the civilizations of medieval and ultimately modern Europe?\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/the-vikings",
        "prereq_text": "",
        "prereqs": []
    },
    "h-123": {
        "id": "h-123",
        "course_id": "H 123",
        "name": "Ordinary People: Uncovering Everyday Life in the European Past",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "In the historical record, much attention is given to wealthy elites (rulers and lawmakers, aristocrats, wealthy merchants), since they were the ones who left written records of their political and economic activities and their personal affairs. But what about the vast majority of people who lived in the past, most of whom were barely literate and had little opportunity to 'make history'? What can we know about them? This class focuses on the lives of ordinary people, and the sources historians use to learn about them. Special attention will be given to women, the poor, and other marginalized groups in societies ranging from England in the west to Russia in the east.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dennison",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/ordinary-people:-uncovering-everyday-life-in-the-european-past",
        "prereq_text": "",
        "prereqs": []
    },
    "h-124": {
        "id": "h-124",
        "course_id": "H 124",
        "name": "Russia",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Current events have us looking to the past for explanations. How does Russian history help us to understand what is happening in Russia today? Contemporary political commentary emphasizes the recent past: the history of the Soviet Union and its collapse in 1991. This course takes a longer look at Russian political, economic, social, and cultural history - from imperial Russia to the present day. The emphasis is on longer continuities over eras: tsarist, Soviet, post-Soviet. Topics covered include the nature and role of the state, internal politics, rule of law and property rights, serfdom, inequality, art and social commentary, popular resistance, censorship, and the effects of all of these on the lives of ordinary Russians.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dennison",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/russia",
        "prereq_text": "",
        "prereqs": []
    },
    "h-125": {
        "id": "h-125",
        "course_id": "H 125",
        "name": "Soviet Russia",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Why was the Russian Revolution of 1917 successful? And how did the Soviet system survive nearly 75 years? These questions will be addressed in the wider context of Russian history, with a focus on political, economic, and social institutions in the pre- and post-revolutionary period. Subjects covered include the ideological underpinnings of Bolshevism, Lenin and the Bolshevik coup, the rise of Stalin, collectivization, socialist realism, the command economy, World War II, the Krushchev 'thaw', dissident culture and the arts, popular culture, and Gorbachev's perestroika. A variety of sources will be used, including secondary historical literature, fiction, film, and art.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dennison",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/soviet-russia",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-129": {
        "id": "hhps-129",
        "course_id": "H/HPS 129",
        "name": "History of Satellites: From Sputnik to Starlink",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The artificial satellites encircling the planet make up a global information infrastructure. Most of us living in industrialized regions use satellites daily without even realizing it. How did satellites become so integral to terrestrial technological systems? How did Earth orbit transform from a wilderness into a landscape during the second half of the 20th century, and how is that landscape changing in the 21st? We will trace the history of satellites beginning with the first artificial \"moons\" and moving into the current moment of private industry ascendance, taking into account the development, use, and decay of these technologies. We will consider how designers and users shape satellites, and map out the ways that objects in orbit reflect and reinforce power and geopolitics on the ground below.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Rand",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/history-of-satellites:-from-sputnik-to-starlink",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-130": {
        "id": "hhps-130",
        "course_id": "H/HPS 130",
        "name": "Critical Infrastructures",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Rand",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/critical-infrastructures",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-131": {
        "id": "hhps-131",
        "course_id": "H/HPS 131",
        "name": "History of Extinction",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Lewis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/history-of-extinction",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-132": {
        "id": "hhps-132",
        "course_id": "H/HPS 132",
        "name": "Humanistic Ecology",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Humans' conceptions of nature have changed dramatically over time. Ecological systems influence human culture, politics, law, and many other spheres, and in turn, humans influence those systems. This class introduces students to the field of humanistic ecology-a discipline that looks to a number of cultural, political, historical and economic elements to better understand the role of ecology in a larger sphere outside of its scientific structure and uses. Humanistic ecology is designed to provide context for the study of ecology, and in a fundamental way, focuses on the appropriate role of humanity in its relationship to nature: what is ethical, or not, what is useful, or not, and a variety of other matters that should be considered when taking a fully three-dimensional view of ecological science.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Lewis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/humanistic-ecology",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-133": {
        "id": "hhps-133",
        "course_id": "H/HPS 133",
        "name": "Forests and Humans",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Forests - which cover 31 percent of the world's land surface - have played essential roles in enhancing the planet's biodiversity. Forests have also served humans in numerous and often controversial ways, and have also been subjected to dramatic change through human activity. How well have we served forests, as well as being served by them? The class will cover the growth and use of forests from a humanistic and historic perspective, as well as discussions about the role of fire in forests, with a particular emphasis on the unprecedented forest fires in California in the past several years and the global ecological implications.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Lewis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/forests-and-humans",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-134": {
        "id": "hhps-134",
        "course_id": "H/HPS 134",
        "name": "Birds, Evolution, Speciation and Society",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The cultural, scientific, social and political roles of birds make them an excellent lens through which to view humans' interactions with the natural world. This course will cover our changing understandings of birds, starting with hawking and falconry in earlier centuries, through the discovery of new species, up through Darwinian understandings of speciation and evolution, and continuing up to present scientific understandings of birds' capabilities and their ties to humankind, as well as to other anchors in the natural world. We will take a strong biographical as well as avian approach to understanding key personalities who furthered our understandings of avian science.",
        "offered": true,
        "instructors": "Lewis",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/birds,-evolution,-speciation-and-society",
        "prereq_text": "",
        "prereqs": []
    },
    "h-136": {
        "id": "h-136",
        "course_id": "H 136",
        "name": "Caltech in the Archives",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This class will introduce students to the methods of archival work in the humanities and social sciences. Over the course of the quarter students will receive an introduction to factors surrounding the collection, organization, and use of various types of archives as a background to several small-scale projects working in an archival collection of their own choosing. The seminar will center around weekly projects and synthetic analytical essays about the archival process and archival discoveries. Students hoping to combine their course work with an archive-based research paper may sign up for a separate independent study and conduct research concurrently, with instructor approval.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/caltech-in-the-archives",
        "prereq_text": "",
        "prereqs": []
    },
    "h-137": {
        "id": "h-137",
        "course_id": "H 137",
        "name": "Criminals, Outlaws, and Justice in a Thousand Years of Chinese History",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course explores the shifting boundary between discourses of crime and disobedience over the last millennium or so of Chinese history. It offers fictional, philosophical, political, propagandistic, official, and personal writings on crime and those who commit it as a basis for a wide-ranging series of discussions about when breaking the law is good, when breaking the law is bad, and who gets to decide where the line between a criminal and an outlaw should be drawn.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/criminals,-outlaws,-and-justice-in-a-thousand-years-of-chinese-history",
        "prereq_text": "",
        "prereqs": []
    },
    "h-138": {
        "id": "h-138",
        "course_id": "H 138",
        "name": "The Way",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course introduces students to some of the seminal writings on the meaning of life, the essentials of rulership, and the place of the individual in the universe from the history of Chinese thought and philosophy. Students are given selected readings from several schools of thought in Chinese history, with an emphasis on the formative Warring States era (the period of the Hundred Schools of classical Chinese philosophy). Instead of being asked to write expository or argumentative essays, participants in this seminar will be introduced to analyzing and presenting texts using the method of annotation. Exposure to the principles of annotation will provide students with a new approach to analyzing and talking about texts both within a humanistic context and beyond.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/the-way",
        "prereq_text": "",
        "prereqs": []
    },
    "h-139": {
        "id": "h-139",
        "course_id": "H 139",
        "name": "Translation Theory and Practice (Chinese Historical Sources Seminar)",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This seminar will introduce students to the problems and practices of historical translation for academic purposes, with a focus on primary materials from Chinese history. Students will take responsibility for an individual translation project, participate in seminar discussions and collaborative projects to improve the translations being made, and discuss the philosophical and methodological questions at the heart of the practice of translation. Advanced proficiency in written Chinese is required. Students who write analyses (4,000 words) of the sources being translated may enroll in this class as H 139, which satisfies the advanced humanities credit.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/translation-theory-and-practice-(chinese-historical-sources-seminar)",
        "prereq_text": "",
        "prereqs": []
    },
    "hl-142": {
        "id": "hl-142",
        "course_id": "H/L 142",
        "name": "Perspectives on History through Russian Literature",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "The Russian intelligentsia registered the arrival of modern urban society with a highly articulate sensitivity, perhaps because these changes-industrialization, the breakdown of traditional hierarchies and social bonds, the questioning of traditional beliefs-came to Russia so suddenly. This gives their writings a paradigmatic quality; the modern dilemmas that still haunt us are made so eloquently explicit in them that they have served as models for succeeding generations of writers and social critics. This course explores these writings (in English translation) against the background of Russian society, focusing especially on particular works of Chekhov, Dostoevsky, Goncharov, Tolstoy, and Turgenev.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dennison",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/perspectives-on-history-through-russian-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "h-149": {
        "id": "h-149",
        "course_id": "H 149",
        "name": "Age of Fracture: America Since 1974",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "In this course, we will examine America after Richard Nixon's resignation in 1974, a period that historians have referred to as an age of fracture and social disaggregation. Using fracture as a conceptual framework to investigate American politics and culture in the last quarter of the twentieth century, we'll consider how the recent past has informed present-day American society. Themes of study will include the culture wars, political polarization, globalization, and the growing wealth gap. In addition, we'll investigate the theoretical and methodological challenges of doing recent history.",
        "offered": true,
        "instructors": "Wiggins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/age-of-fracture:-america-since-1974",
        "prereq_text": "",
        "prereqs": []
    },
    "h-152": {
        "id": "h-152",
        "course_id": "H 152",
        "name": "Where Do We Go from Here? Black America in the Post-Civil Rights Era",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course will examine African American politics, culture, and society in the decades following the passage of landmark civil rights legislation in the 1960s. Topics of discussion will include deindustrialization and the rise of hip hop culture, black feminist and queer thought, debates over welfare and affirmative action, and mass incarceration. Analyzing a variety of political and cultural artifacts as well as cutting-edge secondary literature, we will investigate various moments in recent African American history to gain insight into changing notions of rights, citizenship, equality, and freedom in American society.",
        "offered": true,
        "instructors": "Wiggins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/where-do-we-go-from-here?-black-america-in-the-post-civil-rights-era",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-153": {
        "id": "hhps-153",
        "course_id": "H/HPS 153",
        "name": "Inequality and Environment",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This seminar introduces students to the history of environmental inequality, environmental racism, and environmental justice. Human bodies are inescapably enmeshed in our environments: human health and environmental health are inseparable. But environmental burdens and benefits are distributed unevenly along lines of race, gender, class, and nationality. We will examine local, national, and transnational case studies to understand the historical development of environmental inequalities and movements for environmental justice. We will consider different methods for studying environmental injustice and the politics of environmental knowledge.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/inequality-and-environment",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-154": {
        "id": "hhps-154",
        "course_id": "H/HPS 154",
        "name": "Feminist Science Studies",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This seminar offers an introduction to scholarship on gender and science. Feminist science studies can seem oxymoronic: the objectivity on which science depends appears opposed to the political commitments feminism implies. Scholars in feminist science studies, however, argue that feminist theory and methods can in fact improve scientific practice. This course will introduce students to the historical development of feminist Science & Technology Studies and what this field tells us about the history of women in science, the history of scientific theories of sex/gender, and the future of feminist research. This reading-heavy class will also include discussions of feminist epistemology, feminist research methods, and new directions in feminist STS.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/feminist-science-studies",
        "prereq_text": "",
        "prereqs": []
    },
    "hhps-155": {
        "id": "hhps-155",
        "course_id": "H/HPS 155",
        "name": "Mortality Crises and Social Change: Epidemic Disease from 1300 to the Present",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "What do we know about epidemics in the past? What did contemporaries understand about these events? How did societies respond to periodic bouts of epidemic disease? This course examines mortality crises and epidemics from the Black Death in the 14th century to the current coronavirus pandemic, with attention given to the impact of epidemics on societies, the ways in which such outbreaks have been understood over time and the kinds of responses they have elicited. We will draw on studies for a range of societies in order to identify patterns across space and time, and to highlight both continuity and change in the ways societies have dealt with contagious diseases.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dennison",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/mortality-crises-and-social-change:-epidemic-disease-from-1300-to-the-present",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-160": {
        "id": "hpsh-160",
        "course_id": "HPS/H 160",
        "name": "Einstein on the Run: European Scientists Fleeing Fascism, War, and the Holocaust",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Kormos-Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/einstein-on-the-run:-european-scientists-fleeing-fascism,-war,-and-the-holocaust",
        "prereq_text": "",
        "prereqs": []
    },
    "h-161": {
        "id": "h-161",
        "course_id": "H 161",
        "name": "Selected Topics in History",
        "units": "9 units (3-0-6)",
        "terms": "offered by announcement",
        "description": "This is an advanced humanities course on a specialized topic in History. It is usually taught by new or visiting faculty. The course may be re-taken for credit except as noted in the course announcement. Limited to 15 students. See registrar's announcement for details.",
        "offered": true,
        "instructors": "Staff, visitors",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/selected-topics-in-history",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-162": {
        "id": "hpsh-162",
        "course_id": "HPS/H 162",
        "name": "Social Studies of Science",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A comparative, multidisciplinary course that examines the practice of science in a variety of locales, using methods from the history, sociology, and anthropology of scientific knowledge. Topics covered include the high-energy particle laboratory as compared with a biological one; Western as compared to non-Western scientific reasoning; the use of visualization techniques in science from their inception to virtual reality; gender in science; and other topics.",
        "offered": true,
        "instructors": "Feingold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/social-studies-of-science",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-166": {
        "id": "hpsh-166",
        "course_id": "HPS/H 166",
        "name": "Historical Perspectives on the Relations between Science and Religion",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The course develops a framework for understanding the changing relations between science and religion in Western culture since antiquity. Focus will be on the ways in which the conceptual, personal, and social boundaries between the two domains have been reshaped over the centuries. Questions to be addressed include the extent to which a particular religious doctrine was more or less amenable to scientific work in a given period, how scientific activity carved an autonomous domain, and the roles played by scientific activity in the overall process of secularization.",
        "offered": true,
        "instructors": "Feingold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/historical-perspectives-on-the-relations-between-science-and-religion",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-167": {
        "id": "hpsh-167",
        "course_id": "HPS/H 167",
        "name": "Experimenting with History/Historic Experiment",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course uses a combination of lectures with hands-on laboratory work to bring out the methods, techniques, and knowledge that were involved in building and conducting historical experiments. We will connect our laboratory work with the debates and claims made by the original discoverers, asking such questions as how experimental facts have been connected to theories, how anomalies arise and are handled, and what sorts of conditions make historically for good data. Typical experiments might include investigations of refraction, laws of electric force, interference of polarized light, electromagnetic induction, or resonating circuits and electric waves. We will reconstruct instrumentation and experimental apparatus based on a close reading of original sources.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/experimenting-with-history/historic-experiment",
        "prereq_text": "Prerequisites: Ph 1 abc, and Ph 2 abc (may be taken concurrently).",
        "prereqs": [
            "ph-2-abc",
            "ph-1-abc"
        ]
    },
    "hpsh-168": {
        "id": "hpsh-168",
        "course_id": "HPS/H 168",
        "name": "History of Electromagnetism and Heat Science",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course covers the development of electromagnetism and thermal science from its beginnings in the early 18th century through the early 20th century. Topics covered include electrostatics, magnetostatics, electrodynamics, Maxwell's field theory, the first and second laws of thermodynamics, and statistical mechanics as well as related experimental discoveries.",
        "offered": true,
        "instructors": "Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/history-of-electromagnetism-and-heat-science",
        "prereq_text": "Prerequisites: Ph 1 abc, and Ph 2 abc (may be taken concurrently).",
        "prereqs": [
            "ph-2-abc",
            "ph-1-abc"
        ]
    },
    "hpsh-169": {
        "id": "hpsh-169",
        "course_id": "HPS/H 169",
        "name": "Selected Topics in the History of Science and Technology",
        "units": "9 units (3-0-6)",
        "terms": "",
        "description": "",
        "offered": true,
        "instructors": "Staff, visiting lecturers",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/selected-topics-in-the-history-of-science-and-technology",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-170": {
        "id": "hpsh-170",
        "course_id": "HPS/H 170",
        "name": "History of Light from Antiquity to the 20th Century",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "A study of the experimental, mathematical, and theoretical developments concerning light, from the time of Ptolemy in the 2nd century A.D. to the production of electromagnetic optics in the 20th century.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/history-of-light-from-antiquity-to-the-20th-century",
        "prereq_text": "Prerequisites: Ph 1 abc, and Ph 2 abc (may be taken concurrently).",
        "prereqs": [
            "ph-2-abc",
            "ph-1-abc"
        ]
    },
    "hpsh-171": {
        "id": "hpsh-171",
        "course_id": "HPS/H 171",
        "name": "History of Mechanics from Galileo through Euler",
        "units": "9 units (3-0-6)",
        "terms": "",
        "description": "This course covers developments in mechanics, as well as related aspects of mathematics and models of nature, from just before the time of Galileo through the middle of the 18th century, which saw the creation of fluid and rotational dynamics in the hands of Euler and others.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/history-of-mechanics-from-galileo-through-euler",
        "prereq_text": "Prerequisites: Ph 1 abc, and Ph 2 abc (may be taken concurrently).",
        "prereqs": [
            "ph-2-abc",
            "ph-1-abc"
        ]
    },
    "hpsh-172": {
        "id": "hpsh-172",
        "course_id": "HPS/H 172",
        "name": "History of Mathematics: A Global View with Close-ups",
        "units": "9 units (3-0-6)",
        "terms": "offered by announcement",
        "description": "The course will provide students with a brief yet adequate survey of the history of mathematics, characterizing the main developments and placing these in their chronological, cultural, and scientific contexts. A more detailed study of a few themes, such as Archimedes' approach to infinite processes, the changing meanings of \"analysis\" in mathematics, Descartes' analytic geometry, and the axiomatization of geometry c. 1900; students' input in the choice of these themes will be welcomed.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/history-of-mathematics:-a-global-view-with-close-ups",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-175": {
        "id": "hpsh-175",
        "course_id": "HPS/H 175",
        "name": "Matter, Motion, and Force: Physical Astronomy from Ptolemy to Newton",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The course will examine how elements of knowledge that evolved against significantly different cultural and religious backgrounds motivated the great scientific revolution of the 17th century.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/matter,-motion,-and-force:-physical-astronomy-from-ptolemy-to-newton",
        "prereq_text": "",
        "prereqs": []
    },
    "hpsh-180": {
        "id": "hpsh-180",
        "course_id": "HPS/H 180",
        "name": "Forbidden Knowledge",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Why does the notion of freedom of knowledge and teaching in science and engineering matter? What kinds of restrictions have been placed on scientists and engineers, their publications and institutions? Who restrained scientific and engineering knowledge of what sorts; for what reasons; and how successfully? These questions will be addressed by exploring the strategies developed by the U.S. research community to protect the international circulation of knowledge after World War II, when scientific freedom and the export of technical data had to be balanced with the needs of national security. Case studies will include the atomic bomb, the semiconductor industry in the 1970s and space technologies, notably rockets/missiles, in the 1990s. The threat to U.S. economics and military security posed by the Soviet Union in the Cold War, and by China today, has transformed the practice of research in university and in industry alike building new walls around the production and circulation of knowledge to affirm national sovereignty that is, all the while, being undermined by the global circulation of trained scientists and engineers.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/forbidden-knowledge",
        "prereq_text": "",
        "prereqs": []
    },
    "hhpsvc-185": {
        "id": "hhpsvc-185",
        "course_id": "H/HPS/VC 185",
        "name": "Angels and Monsters: Cosmology, Anthropology, and the Ends of the World",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course explores late medieval European understandings of the origins, structure, and workings of the cosmos in the realms of theology, physics, astronomy, astrology, magic, and medicine. Attention is given to the position of humans as cultural creatures at the intersection of nature and spirit; as well as to the place of Christian Europeans in relation to non-Christians and other categories of outsiders within and beyond Europe. We will examine the knowledge system that anticipated racializing theories in the West.",
        "offered": true,
        "instructors": "Wey-Gomez",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/angels-and-monsters:-cosmology,-anthropology,-and-the-ends-of-the-world",
        "prereq_text": "",
        "prereqs": []
    },
    "hhpsvc-186": {
        "id": "hhpsvc-186",
        "course_id": "H/HPS/VC 186",
        "name": "From Plato to Pluto: Maps, Exploration and Culture from Antiquity to the Present",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course covers a broad range of topics in the history of maps and exploration from Antiquity to the present. These topics range from the earliest visualizations of earth and space in the Classical world to contemporary techniques in interplanetary navigation. By way of maps, students will explore various ways in which different cultures have conceptualized and navigated earth and space. While maps emulate the world as perceived by the human eye, they, in fact, comprise a set of observations and perceptions of the relationship between bodies in space and time. Thus, students will study maps, and the exploration they enable, as windows to the cultures that have produced them, not only as scientific and technical artifacts to measure and navigate our world.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Wey-Gomez",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/from-plato-to-pluto:-maps,-exploration-and-culture-from-antiquity-to-the-present",
        "prereq_text": "",
        "prereqs": []
    },
    "hl-191": {
        "id": "hl-191",
        "course_id": "H/L 191",
        "name": "Perspectives on History through German Literature",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Industrialization, economic growth, and democracy came to Germany much later than to England and France, and the forms they took in Germany were filtered through the specific institutional character of Central Europe. German-speaking writers and intellectuals saw these trends from the perspective of indigenous intellectual traditions, and the resulting collisions of values and priorities largely shaped European and American social, political, and literary debates for much of the nineteenth and twentieth centuries. This course explores these writings (in English translation) against the historical background of Central European society, focusing on particular works of Goethe, Hoffmann, Heine, Nietzsche, Kafka, Rilke, and Mann.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dennison",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/perspectives-on-history-through-german-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "h-192": {
        "id": "h-192",
        "course_id": "H 192",
        "name": "The Crusades",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will introduce students to the series of religiously motivated European invasions of the Middle and Near East that began at the end of the eleventh century and that led to the creation of Latin Christian principalities in Palestine. Though the crusading movement came to embroil much of Europe itself, the course will focus strictly on the military expeditions to what the Crusaders called the Holy Land, and the history of the Crusader states up to the point of their destruction at the end of the thirteenth century. The course will be guided by the following questions: how did medieval Christianity justify wars of aggression against foreign peoples and religions? What motivated western Europeans to leave their homes and march into a hostile environment, where they often faced impoverishment if not death and where maintaining a Christian presence was a constant struggle? How did they manage to erect stable political entities in alien territory that lasted as long as they did, and how did they have to adapt their own culture to do so? Finally, how did the native peoples of the regions the Crusaders invaded and conquered-Muslim but also Christian and Jewish - perceive the Crusaders? How did the Crusaders' presence affect life in a region whose populations had their own ancient histories and patterns of life?\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/the-crusades",
        "prereq_text": "",
        "prereqs": []
    },
    "enh-193": {
        "id": "enh-193",
        "course_id": "En/H 193",
        "name": "Cervantes, Truth or Dare: Don Quixote in an Age of Empire",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Studies Cervantes's literary masterpiece, Don Quixote, with a view to the great upheavals that shaped the early modern world: Renaissance Europe's discovery of America; feudalism's demise and the rise of mass poverty; Reformation and Counter-Reformation; extermination of heretics and war against infidels; and the decline of the Hapsburg dynasty. The hapless protagonist of Don Quixote calls into question the boundaries between sanity and madness, truth and falsehood, history and fiction, objectivity and individual experience. What might be modern, perhaps even revolutionary, in Cervantes's dramatization of the moral and material dilemmas of his time? Conducted in English.",
        "offered": true,
        "instructors": "Wey-Gomez",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/cervantes,-truth-or-dare:-don-quixote-in-an-age-of-empire",
        "prereq_text": "",
        "prereqs": []
    },
    "h-201": {
        "id": "h-201",
        "course_id": "H 201",
        "name": "Reading and Research for Graduate Students",
        "units": "",
        "terms": "",
        "description": "",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/h/reading-and-research-for-graduate-students",
        "prereq_text": "",
        "prereqs": []
    }
}