{
    "humh-1": {
        "id": "humh-1",
        "course_id": "Hum/H 1",
        "name": "The Classical and Medieval Worlds",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "This course will survey the evolution of Mediterranean and European civilization from antiquity through the end of the Middle Ages. It will emphasize the reading and discussion of primary sources, especially but not exclusively literary works, against the backdrop of the broad historical narrative of the periods. The readings will present students with the essential characteristics of various ancient and medieval societies and give students access to those societies' cultural assumptions and perceptions of change.",
        "offered": true,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/the-classical-and-medieval-worlds",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-2": {
        "id": "humh-2",
        "course_id": "Hum/H 2",
        "name": "Freedom Dreams: African American Visions of Liberation Since Emancipation",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Over the course of their history in the United States, African Americans have advanced various visions of liberation and strategies for attaining it. This course will examine how African Americans have conceptualized and sought to realize their freedom dreams since the end of chattel slavery. We will focus, in particular, on visions of freedom considered radical or utopian, both in their contemporary moment and in our present. Investigating how African Americans have imagined freer lives beyond their own localities, beyond U.S. borders, and even beyond Earth, our topics of discussion in the course may include emigration movements, black communism, pan-Africanism, black feminism, cults, Afrofuturism, hip hop culture, and abolitionism.",
        "offered": true,
        "instructors": "Wiggins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/freedom-dreams:-african-american-visions-of-liberation-since-emancipation",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-3": {
        "id": "humh-3",
        "course_id": "Hum/H 3",
        "name": "The United States in the Twentieth Century",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Designed to introduce students to the academic study of history, this course examines key issues and events that shaped the political, social, and cultural history of the United States in the Twentieth Century. Through a wide variety of historical sources-including primary documents, fiction, and music-students will explore issues such as popular culture, immigration and labor, the civil rights movement, political realignment, and American intervention abroad.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/the-united-states-in-the-twentieth-century",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-5": {
        "id": "humh-5",
        "course_id": "Hum/H 5",
        "name": "The History of the Chinese Empire",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "This class will explore several facets of how the concept of empire and its historical formation in China was defined, portrayed, and developed over time. It offers students a chance to reflect on the interaction of event, record, and remembrance as these components combine in the creation and contestation of history. This course will particularly emphasize how the making, writing, and remembering of history responds to the advent of different regimes of legitimacy in order to give students a new perspective on the relationship between action, authorship, and interpretation in history.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/the-history-of-the-chinese-empire",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-6": {
        "id": "humh-6",
        "course_id": "Hum/H 6",
        "name": "Civilization, Science, and Archaeology: The Development of Science from Babylon through the Renaissance",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "Connections in antiquity between astrology and astronomy, early theories of light, Islamic science, new concepts of knowledge during the European Middle Ages and Renaissance, the early laboratory, the development of linear perspective, the origins of the Copernican and Keplerian systems of astronomy, and the science of Galileo.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/civilization,-science,-and-archaeology:-the-development-of-science-from-babylon-through-the-renaissance",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-7": {
        "id": "humh-7",
        "course_id": "Hum/H 7",
        "name": "Civilization, Science, and Archaeology: The Nature of Religious Belief in Ancient Egypt, Mesopotamia, and Israel",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "The civilizations of Egypt and Mesopotamia gave rise to complex forms of religious practices connected to the social order, moral behavior, and the afterlife. The course examines the origins of concepts of moral death and of sin as a violation of cosmic order in antiquity, the nature of polytheism, and the manner in which monotheism arose out of it. In addition to historical analyses the course includes readings by anthropologists who have studied cult structures as well as contemporary theories by evolutionary psychologists.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/civilization,-science,-and-archaeology:-the-nature-of-religious-belief-in-ancient-egypt,-mesopotamia,-and-israel",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-8": {
        "id": "humh-8",
        "course_id": "Hum/H 8",
        "name": "Civilization, Science, and Archaeology: Before Greece: The Origins of Civilization in Mesopotamia",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "This course will introduce students to the early development of civilization in Mesopotamia and Egypt from 4000 B.C.E. through 1000 B.C.E. Origins of agriculture and writing, the evolution of the city, and the structures of the Mesopotamian economy and social order will be discussed. Comparison with contemporary developments in Egypt during the Old and Middle Kingdoms may include a reading of Gilgamesh from 3000 B.C.E. and of the Egyptian Tale of Sinuhe. The course concludes with a discussion of life during the late Bronze Age. Focus will be on life as it was lived and experienced by many groups in pre-classical antiquity rather than on kings and dynasties.",
        "offered": true,
        "instructors": "Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/civilization,-science,-and-archaeology:-before-greece:-the-origins-of-civilization-in-mesopotamia",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-9": {
        "id": "humh-9",
        "course_id": "Hum/H 9",
        "name": "Europe Transformed",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Will introduce students to major aspects of the politics and culture of modernity that have profoundly transformed Western society and consciousness from the French Revolution to the contemporary era. A variety of historical, literary, and artistic works will be used to illuminate major social, intellectual, and cultural movements. The focus will be on significant and wide-ranging historical change (e.g., the industrial revolution, imperialism, socialism, fascism); on cultural innovation (e.g., modernism, impressionism, cubism); and on the work of significant thinkers.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Kormos-Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/europe-transformed",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-10": {
        "id": "humh-10",
        "course_id": "Hum/H 10",
        "name": "Medieval Europe: The Problem of Violence",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "This course will explore how people understood violence in Europe between ca. 500 and ca. 1400 AD. It will focus on the various norms that governed the use of violence in a period when the right of free people to carry and use weapons was considered self-evident. Working through primary sources, students will explore the relationship between violence and vengeance, the law, central authority and public order, religion, emotions, public ritual, and economics. As they go along students will consider whether violence can coexist with or even promote stable, ordered societies, or whether it by definition creates disorder.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Brown",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/medieval-europe:-the-problem-of-violence",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-11": {
        "id": "humh-11",
        "course_id": "Hum/H 11",
        "name": "Love and Death: Using Demography to Study the History of Europe from 1700",
        "units": "9 units (3-0-6)",
        "terms": "first, third terms",
        "description": "Demographic events-births, marriages, deaths-have always been highly responsive to changes in the local environment. Decisions about when to marry, how many children to have, or what kind of household to live in have always been closely correlated to decisions people take in other areas of their lives and, as a result, can tell us a great deal about the economic, social, and cultural worlds people inhabit. This course examines differences in demographic trends in Europe across space and time, from 1700 to the present, as well as existing explanations for these differences, including political economic factors, social and cultural norms, biology and disease environments. Some topics include: the demographic effects of war, industrialization, and urbanization; changes related to the emergence of reliable contraceptive technologies; changes related to the expansion of economic opportunities for women; the effects of government policies on demographic decisions.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dennison",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/love-and-death:-using-demography-to-study-the-history-of-europe-from-1700",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-12": {
        "id": "humh-12",
        "course_id": "Hum/H 12",
        "name": "Social Theory",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course introduces students to both canonical and non-canonical theories of society. From the formative debates over the role of the state in human affairs in early modern Europe to radical interpretations of social good in the twentieth century, students will be exposed to competing theories of society and their implications in the political, the economic, the emotional, and the scientific realms. By the end of the quarter, students will be able to link contemporary notions of individuality, agency, rationality, morality, and ethics to divergent discourses in the history of social theory.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/social-theory",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-13": {
        "id": "humh-13",
        "course_id": "Hum/H 13",
        "name": "Brave New Worlds: Race, Human Rights and the Age of Discovery",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course traces the origins of modern racism and, perhaps surprisingly, of human rights advocacy itself, to a seminal moment in global history sometimes called the Age of Discovery. At this time, two small European kingdoms, Spain and Portugal, first conducted trade and conquest in Atlantic Africa, the Americas, and the Indian and Pacific Oceans, forging the world's first truly global empires. We study the legacy of racism and humanitarianism in eye-witness accounts, maps, images and other materials attesting to Spain's seminal encounters with the Americas.",
        "offered": true,
        "instructors": "Wey-Gomez",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/brave-new-worlds:-race,-human-rights-and-the-age-of-discovery",
        "prereq_text": "",
        "prereqs": []
    },
    "humhhps-14": {
        "id": "humhhps-14",
        "course_id": "Hum/H/HPS 14",
        "name": "Race, Science, and Medicine in U.S. History",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will explore how natural philosophers and scientists have defined, used, and sometimes challenged ideas about race from the eighteenth century to today. Using a range of primary and secondary sources, we will examine how scientific ideas about race developed in concert with European imperial expansion and slavery; how these ideas were employed in legal cases, medical practice, and eugenics policies; and how activists and scholars have challenged racist practices and ideas. Finally, we will turn to the recent resurgence of racial thinking in biology and medicine in the light of the history of race and science.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/race,-science,-and-medicine-in-u.s.-history",
        "prereq_text": "",
        "prereqs": []
    },
    "humhhps-15": {
        "id": "humhhps-15",
        "course_id": "Hum/H/HPS 15",
        "name": "Waste in the World",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "The things that human beings make and throw away rarely stay where we put them. Just as humans have shaped the biological and physical world, the biological and physical world shapes human actions. In this course, we will examine how these interacting forces propel environmental and cultural change. We will explore these concepts through the lens of waste - how different groups at different points in history define waste, where discarded things go and what they become as they move through space and time. We will consider how conflicting perceptions of utility and waste in different cultural and historical contexts have factored into shifting ideas about race, class, gender, wilderness, technology, consumption, and sovereignty. In rethinking waste, we will explore the multiple meanings of \"nature,\" assess the roots of sustainability, and evaluate past events in light of current ideas about environmental justice. While this course prioritizes reading and discussion, we will also engage with the world around us through visual analysis. Pasadena and Los Angeles will be among our most important resources, allowing us to ground global ideas in a local context.",
        "offered": true,
        "instructors": "Rand",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/waste-in-the-world",
        "prereq_text": "",
        "prereqs": []
    },
    "humhhps-18": {
        "id": "humhhps-18",
        "course_id": "Hum/H/HPS 18",
        "name": "Introduction to the History of Science",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "Major topics include the following: What are the origins of modern Western science, when did it emerge as distinct from philosophy and other cultural and intellectual productions, and what are its distinguishing features? When and how did observation, experiment, quantification, and precision enter the practice of science? What were some of the major turning points in the history of science? What is the changing role of science and technology? Using primary and secondary sources, students will take up significant topics in the history of science, from ancient Greek science to the 20th-century revolution in physics, biology, and technology. Hum/H/HPS 10 may be taken for credit toward the additional 36-unit HSS requirement by HPS majors and minors who have already fulfilled their first-year humanities requirement and counts as a history course in satisfying the first-year humanities breadth requirement.",
        "offered": true,
        "instructors": "Feingold",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/introduction-to-the-history-of-science",
        "prereq_text": "",
        "prereqs": []
    },
    "humh-19": {
        "id": "humh-19",
        "course_id": "Hum/H 19",
        "name": "Righting the Wrongs of History",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "In recent years, growing numbers of people committed to equity and social justice have discussed various ways of addressing historical injustices whose harms are still experienced in the present. Some have proposed monetary restitution and other restorative strategies that account for resources, opportunities, and lives lost. Others have advocated more symbolic reparative approaches that seek to heal the psychic wounds of injustice. This course will examine efforts to right the wrongs of history, with particular attention given to the decades-long movement for reparations for African Americans and recent efforts to address difficult histories at Caltech. Investigating initiatives that have been realized and others that have been only imagined, in this course we will seek to understand both the possibilities and impossibilities of repairing historical harms.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Wiggins",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/righting-the-wrongs-of-history",
        "prereq_text": "",
        "prereqs": []
    },
    "humhhps-20": {
        "id": "humhhps-20",
        "course_id": "Hum/H/HPS 20",
        "name": "COVID-19 and Other Pandemics: Science, Medicine, and Public Controversies",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Kormos-Buchwald",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/covid-19-and-other-pandemics:-science,-medicine,-and-public-controversies",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-21": {
        "id": "humen-21",
        "course_id": "Hum/En 21",
        "name": "Monsters and Marvels",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "Marvels flourish at the boundaries of literary invention, religious belief, and scientific inquiry, challenging assumptions about natural processes and expected outcomes. From Grendel, the monstrous foe of Beowulf, to Satan, Milton's charismatic antihero, this seminar examines the uses of the marvelous in a variety of texts and genres, including Shakespearian drama, medieval romance, and early travel-writing. Readings may include Beowulf, Marie de France, Chaucer, John Mandeville, Shakespeare, Milton.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Jahner",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/monsters-and-marvels",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-22": {
        "id": "humen-22",
        "course_id": "Hum/En 22",
        "name": "Inequality",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Haugen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/inequality",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-23": {
        "id": "humen-23",
        "course_id": "Hum/En 23",
        "name": "Literature and Medicine",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The relationship between patients and doctors, the ill and the well, involves a constant exchange of stories. In this course we will look more closely at the relationship between medicine and narrative through a selection of fiction, essays and poems that investigate the interplay between doubt and diagnosis, the idea of the case study, the problem of medical responsibility, and the language of pain and illness. Authors covered may include Sontag, Mantel, Conan Doyle, Freud, Woolf, Dickinson, Ishiguro and Shelley.",
        "offered": true,
        "instructors": "Gilmore",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/literature-and-medicine",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-24": {
        "id": "humen-24",
        "course_id": "Hum/En 24",
        "name": "The Scientific Imagination in English Literature",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course considers three periods of major scientific development-the Renaissance, the nineteenth century, and the modern period- to explore the influence new ideas, discoveries, and theories had on the imagination of English writers. We will look at the early modern interplay between magic and science, Romantic and Victorian debates about evolution, and the twentieth-century advent of modern physics as we confront consistent tropes like the mad scientist, the scientist-hero, and the problem of uncertainty. Authors covered may include Shakespeare, Marlowe, Bacon, Shelley, Darwin, Conan Doyle, Stevenson, Auden, McEwan, and Stoppard.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Gilmore",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/the-scientific-imagination-in-english-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-25": {
        "id": "humen-25",
        "course_id": "Hum/En 25",
        "name": "The Human Animal",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "European literature has long been a testing ground for radical new ideas which have come to shape our basic understanding of what it means to be a thinking, speaking and perhaps even autonomous human being. The question of what - if anything - makes us different from animals was debated from numerous points of view: including talking dogs, philosophizing women, bestial men, humanlike beasts, and other creatures that defied the conventions of the time. This course explores some of the key literary texts that shaped this debate and pays careful attention to their cultural environments. Selected readings from Cervantes, La Fontaine, Swift, Rousseau, Buffon, Aikin, and Wollstonecraft, among others.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/the-human-animal",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-26": {
        "id": "humen-26",
        "course_id": "Hum/En 26",
        "name": "What Is Imagination?",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Albert Einstein once said that imagination is everything, and even more important than knowledge. This course invites you to think about - and use - your imagination as we explore how the act of imagining has been viewed over time in the service of memory and creativity, in both the arts and the sciences. Readings will focus on the eighteenth and nineteenth centuries and will include Hume, Moritz, Kant, Novalis, Hoffmann, Coleridge, and Wordsworth.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/what-is-imagination?",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-27": {
        "id": "humen-27",
        "course_id": "Hum/En 27",
        "name": "Introduction to the Modern Novel",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course is an introduction to the study of the contemporary novel in English. We will explore the value of reading novels both for their own sake and for what they might tell us about the history, culture, and politics of the contemporary English language. We will read around three novels from the twenty-first century, along with relevant essays, keywords, and short stories. Authors read may include Zadie Smith, Bernadine Evaristo, Angie Cruz, Tommy Orange, Julie Buntin, Akwaeke Emezi, and Ocean Vuong.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Murphy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/introduction-to-the-modern-novel",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-28": {
        "id": "humen-28",
        "course_id": "Hum/En 28",
        "name": "Telling Time in American Modernism",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Sherazi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/telling-time-in-american-modernism",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-29": {
        "id": "humen-29",
        "course_id": "Hum/En 29",
        "name": "Dream Narratives",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Dream narratives reveal as much about cultural beliefs and superstitions as they do about techniques of narration and interpretation. This course investigates key developments in the literature on dreams and dream interpretations with examples drawn from the Renaissance through the beginning of the nineteenth century. Selected readings from Boccaccio, Descartes, Calderón, Shakespeare, and Diderot, among others.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/dream-narratives",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-30": {
        "id": "humen-30",
        "course_id": "Hum/En 30",
        "name": "Reading Animals",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "In this course we will look closely at representations of nonhuman animals in literature from the Middle Ages to our present moment as opportunities to revisit definitions of, and the boundaries created and blurred between, the \"human\" and the \"animal.\" Readings may include Marie de France, Marianne Moore, Franz Kafka, Donna Haraway, Donika Kelly, and K-Ming Chang.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Hill",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/reading-animals",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-31": {
        "id": "humen-31",
        "course_id": "Hum/En 31",
        "name": "Introduction to Black Literature and Culture in the United States",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This introductory humanities course is for anyone who wishes to celebrate, study, and pass on Black expressive culture to the next generation. Altogether, the course will be an in-depth introduction to the study of Black intersectional identities and lived experiences across the United States. Our texts will be comprised of a variety of artistic, cultural, and literary works in the US created since before its founding up until today. In addition to reading several literary texts, students will have the opportunity to learn about several works of cultural expression that have become beloved touchstones in Black history. Students will also read and apply several critical contexts and methodologies for the study of Black literature and culture and will regularly document their own goals for furthering this body of work for future scholars.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Murphy",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/introduction-to-black-literature-and-culture-in-the-united-states",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-33": {
        "id": "humen-33",
        "course_id": "Hum/En 33",
        "name": "Modern Metamorphoses",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Narratives of metamorphosis have traditionally used their dramatic subject matter-a radical change of form-as a vehicle for social criticism. This course explores the ways in which twentieth-century writers experiment with the concept of metamorphosis to take on the most pressing political and social issues of their day, including slavery, women's rights, and critiques of capitalist excess. Readings to include Kafka, Garnett, Orwell, Tawada, and Erpenbeck.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/modern-metamorphoses",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-34": {
        "id": "humen-34",
        "course_id": "Hum/En 34",
        "name": "Literature and Deception",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "In this course, we will be considering lying and other types of deception from the point of view of literature and philosophy, with two main goals in mind: 1) to compare cultural practices of deception at various times in European history and 2) to think in general terms about the ability of a literary text to convey truth and falsehood. Can a fictional text be \"true\" in any meaningful sense, such as a political one? Or, as many people have thought over time, is it more accurate to think about literature as a beautiful lie? Readings will include the legend of Till Eulenspiegel as well as texts by Machiavelli, Shakespeare, Diderot, and those relating to the Ossian controversy.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/literature-and-deception",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-35": {
        "id": "humen-35",
        "course_id": "Hum/En 35",
        "name": "Beginning with Poems",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "Why begin the study of literature with poems? Written words are the building blocks of literature, and poetry, in Coleridge's famous equation, is \"the best words in the best order.\" To be understood and appreciated, poetry requires a close attention to words and their ordering as they are read and reread. All good literature requires such attention, but practically speaking, poetry provides the best way to acquire the art of rereading because of its shorter forms. More importantly, poetry can be the most emotionally intense and satisfying of literary forms. We will read a small number of poems written in English from the sixteenth to the twenty-first centuries from several genres - sonnet, ode, elegy, verse epistle, satire, villanelle - and on several subjects - love, death, and politics. Poets will include William Shakespeare, Emily Dickinson, and Louise Gluck.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Pigman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/beginning-with-poems",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-36": {
        "id": "humen-36",
        "course_id": "Hum/En 36",
        "name": "American Literature and Culture",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Studies of American aesthetics, genres, and ideas from the birth of the nation to the present. Students will be introduced to the techniques of formal analysis. We will consider what constitutes evidence in relation to texts and how to develop a persuasive interpretation. Topics may include Nature's Nation, slavery and its aftermath, individualism and the marketplace, the \"New Woman,\" and the relation between word and image.",
        "offered": true,
        "instructors": "Weinstein",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/american-literature-and-culture",
        "prereq_text": "",
        "prereqs": []
    },
    "humen-37": {
        "id": "humen-37",
        "course_id": "Hum/En 37",
        "name": "Welcome to Dystopia",
        "units": "9 units (3-0-6)",
        "terms": "first",
        "description": "",
        "offered": true,
        "instructors": "Holland",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/welcome-to-dystopia",
        "prereq_text": "",
        "prereqs": []
    },
    "humpl-40": {
        "id": "humpl-40",
        "course_id": "Hum/Pl 40",
        "name": "Right and Wrong",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "This course addresses questions such as: Where do our moral ideas come from? What justifies them? How should they guide our conduct, as individuals and as a society? What kind of person should one aspire to be? Topics the course may deal with include meta-ethical issues (e.g., What makes an action right or wrong? When is one morally responsible for one's actions? How should society be organized?) and normative questions (e.g., Is eating meat morally acceptable? What should we tolerate and why? What are society's obligations toward the poor?). In addition, the psychological and neural substrates of moral judgment and decision making may be explored. The course draws on a variety of sources, including selections from the great works of moral and political philosophy (e.g., Aristotle's Nichomachean Ethics, Hobbes's Leviathan, Kant's Groundings for a Metaphysics of Morals, and Rawls's A Theory of Justice), contemporary discussions of particular moral issues, and the science of moral thought.",
        "offered": true,
        "instructors": "Quartz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/right-and-wrong",
        "prereq_text": "",
        "prereqs": []
    },
    "humpl-41": {
        "id": "humpl-41",
        "course_id": "Hum/Pl 41",
        "name": "Knowledge and Reality",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "The theme of this course is the scope and limitations of rational belief and knowledge. Students will examine the nature of reality, the nature of the self, the nature of knowledge, and how we learn about the natural world. Students will be introduced to these issues through selections from some of the world's greatest philosophical works, including Descartes's Meditations, Pascal's Pensées, Hume's Enquiry Concerning Human Understanding, Berkeley's Principles of Human Knowledge, and Kant's Prolegomena to any Future Metaphysics. A variety of more contemporary readings will also be assigned.",
        "offered": true,
        "instructors": "Eberhardt, Hitchcock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/knowledge-and-reality",
        "prereq_text": "",
        "prereqs": []
    },
    "humpl-44": {
        "id": "humpl-44",
        "course_id": "Hum/Pl 44",
        "name": "Philosophy Through Science Fiction",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will provide a broad introduction to philosophy using examples from science fiction to make abstract philosophical problems vivid. Topics may include: time travel and the reality of the past and future; teleportation and what makes someone the same person over time; fictional tales of extended deception and Cartesian skepticism; futuristic utopias and the question of what make a life good; the moral status of aliens and animals; intelligent robots and the relation between mind and body; parallel universes and the philosophical foundations of quantum physics.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/philosophy-through-science-fiction",
        "prereq_text": "",
        "prereqs": []
    },
    "humpl-45": {
        "id": "humpl-45",
        "course_id": "Hum/Pl 45",
        "name": "Ethics & AI",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "How do we reconcile the possibilities of modern machine learning with ethical and moral demands of fairness, accountability and transparency? This course will take a case study-based approach to the challenges at the interface of algorithms and human values. By exploring existing debates on algorithmic bias, explainable AI and data ownership, students will be exposed to the relevance of ethical systems of thought to modern social questions.",
        "offered": true,
        "instructors": "Eberhardt",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/ethics-&-ai",
        "prereq_text": "",
        "prereqs": []
    },
    "humvc-48": {
        "id": "humvc-48",
        "course_id": "Hum/VC 48",
        "name": "Ways of Seeing",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "\"The knowledge of photography is just as important as that of the alphabet,\" wrote artist László Moholy-Nagy in 1928. \"The illiterate of the future,\" he warned, \"will be the person ignorant of the use of the camera as well as the pen.\" Almost a century later, this pronouncement rings as true as ever in a world so profoundly shaped not just by photography but also films, advertisements, and video games, cartoons and comics, molecular graphics and visual models. In this course we will explore how visual culture shapes our lives and daily experiences, and we will learn to find wonder in its rich details. In doing so, we will develop the visual literacy that Moholy-Nagy envisioned: essential skills in reading, analyzing, discussing, and writing about visual materials and their circulation through the physical and virtual networks that structure our world.",
        "offered": true,
        "instructors": "Jacobson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/ways-of-seeing",
        "prereq_text": "",
        "prereqs": []
    },
    "humvc-49": {
        "id": "humvc-49",
        "course_id": "Hum/VC 49",
        "name": "Seeing Race",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Stielau",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/seeing-race",
        "prereq_text": "",
        "prereqs": []
    },
    "humvc-50": {
        "id": "humvc-50",
        "course_id": "Hum/VC 50",
        "name": "Introduction to Film",
        "units": "9 units (3-0-6)",
        "terms": "first, third terms",
        "description": "This course examines the historical development of film as a popular art and entertainment medium from the 1880s to the present, with a focus on the American and European contexts. Students will learn how to watch a film - how to pay attention to significant visual details and to the ways films construct meaning from the language of images - and will develop the skills to write fluently about what they see. The course covers some of the most influential genres and movements from the earliest actuality films, through the French New Wave, to the Disney/Marvel Universe. Films covered may include short comedies from Charlie Chaplin and Buster Keaton,M,It Happened One Night,The Seven Samurai,The Battle of Algiers, andBlack Panther.",
        "offered": true,
        "instructors": "Jurca",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/introduction-to-film",
        "prereq_text": "",
        "prereqs": []
    },
    "humvc-51": {
        "id": "humvc-51",
        "course_id": "Hum/VC 51",
        "name": "Icons and Iconoclasm",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "How does something - an image, a person, a thing, an idea - become iconic? Drawing from the worlds of art and film, advertising and PR, science and technology, politics and propaganda, this course explores what makes certain people, places, and things \"icons.\" To do so, we will first deploy a range of methods for closely analyzing images as signs and symbols, including the practice art historians term \"iconology.\" We will then examine histories of how objects have circulated through culture - from newspapers and magazines to postcards, jpegs, and memes - and thereby become ubiquitous features of everyday experience. Finally, we will consider iconoclasm, the destruction of icons, and the beliefs and logics behind powerful interdictions against visual representation. Students will leave the course with a stronger understanding of image power as well as foundational tools of visual and media literacy.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Jacobson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/icons-and-iconoclasm",
        "prereq_text": "",
        "prereqs": []
    },
    "hum-59": {
        "id": "hum-59",
        "course_id": "Hum 59",
        "name": "Special Topics in Humanities",
        "units": "9 units (3-0-6)",
        "terms": "offered by announcement",
        "description": "This course will count as a first-year humanities course in either English, history, philosophy, or visual culture, as announced. It is usually taught by new or visiting faculty. The course may be re-taken once if the second class is offered in a different discipline (from among English, history, philosophy, and visual culture). Limited to 15 students. See registrar's announcement for details.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/special-topics-in-humanities",
        "prereq_text": "",
        "prereqs": []
    },
    "hum-75": {
        "id": "hum-75",
        "course_id": "Hum 75",
        "name": "Selected Topics in Humanities",
        "units": "Variable units",
        "terms": "offered by announcement",
        "description": "A course on a specialized topic in some area of the humanities, usually taught by new or visiting faculty. Recent offerings have included courses on film-making, poetry writing, speculative fiction, and the difference between humans and other animals. The course may be re-taken for credit except as noted in the course announcement. Class size is normally limited to 8-15 students. See registrar's announcement for details.",
        "offered": true,
        "instructors": "Staff, visitors",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/selected-topics-in-humanities",
        "prereq_text": "",
        "prereqs": []
    },
    "hum-80": {
        "id": "hum-80",
        "course_id": "Hum 80",
        "name": "Frontiers in the Humanities",
        "units": "1 unit (1-0-0)",
        "terms": "third term",
        "description": "Weekly seminar by a member of the Caltech humanities faculty or a visitor to discuss a topic of their current research at an introductory level. The course can be used to learn more about different areas of study within the humanities. For those interested in (or who become interested) in pursuing a second option in the humanities, the course will introduce students to the kinds of research carried out by members of the humanities faculty and help them find faculty advisers.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/frontiers-in-the-humanities",
        "prereq_text": "",
        "prereqs": []
    },
    "hum-105": {
        "id": "hum-105",
        "course_id": "Hum 105",
        "name": "Topics in French Literature",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Hum 105 and Hum 116 are taught in alternate years. Topics may include the 20th-century major French novels; French modern theatre; conflicting memories of the second world war; coming of age novels; the French Muslim identity. Conducted in French. Students who write papers in French may enroll in this class as L 105.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/topics-in-french-literature",
        "prereq_text": "Prerequisites: L 103 abc or equivalent.",
        "prereqs": []
    },
    "hum-114-abc": {
        "id": "hum-114-abc",
        "course_id": "Hum 114 abc",
        "name": "Spanish Language Literature and its Film Adaptations",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Offered concurrently with L 114abc. This course explores the mixed cultures of the Spanish speaking countries and the United States, through a compilation of novel excerpts, short stories, drama, music, poetry, and film. This heterogeneity of written and audiovisual texts aims to acquaint students with the rich cultures of the Spanish speaking peoples, from the standpoint of ethnicity, gender, and social class. The course also focuses on continuing to develop Spanish language skills. Conducted in Spanish. (a) The traditional role of women during dictatorships and their journey to freedom (b) Family relationships and their impact on mental and physical health (c) building gender, social, and economic equality. Each term can be taken independently. Students who write papers in Spanish may enroll in this class as L 114.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Arjona",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/spanish-language-literature-and-its-film-adaptations",
        "prereq_text": "Prerequisites: L 112 abc or equivalent.",
        "prereqs": []
    },
    "hum-115-abc": {
        "id": "hum-115-abc",
        "course_id": "Hum 115 abc",
        "name": "Hispanic Cultures in Film and Literature",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Offered concurrently with L 115. This course introduces students to narrative film and literature from the Hispanic world, with an emphasis on the hero figure. It also takes up hybridization and transculturation in the Americas, specifically in Mexico, Peru, and Cuba, as well as film and narratives of Spain from the Civil War to the present. Conducted in Spanish. (a) Basics of Hispanic films and narratives, and their socio-cultural roots (b) Hybridization and mestizo cultures in the Hispanic world (c) The last century in Hispanic film and narrative. Each term can be taken independently. Students who write papers in Spanish may enroll in this class as L 115.",
        "offered": true,
        "instructors": "Garcia",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/hispanic-cultures-in-film-and-literature",
        "prereq_text": "Prerequisites: L 112 abc or equivalent.",
        "prereqs": []
    },
    "hum-116": {
        "id": "hum-116",
        "course_id": "Hum 116",
        "name": "Topics in French Culture",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Offered concurrently with L 116. Hum 105 and Hum 116 given in alternate years. The course focuses on contemporary France. Topics may include France and the European Union; political parties and elections; family life; social protection; religion; education; media and technology. Conducted in French. Students who write papers in French may enroll in this class as L 116.",
        "offered": true,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/topics-in-french-culture",
        "prereq_text": "Prerequisites: L 103 abc or equivalent.",
        "prereqs": []
    },
    "hum-119": {
        "id": "hum-119",
        "course_id": "Hum 119",
        "name": "Selected Topics in Humanities",
        "units": "Variable units",
        "terms": "offered by announcement",
        "description": "This is an advanced humanities course on a specialized topic in some area of the humanities. It is usually taught by new or visiting faculty. The course may be re-taken for credit except as noted in the course announcement. Limited to 15 students. See registrar's announcement for details.",
        "offered": true,
        "instructors": "Staff, visitors",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/selected-topics-in-humanities",
        "prereq_text": "",
        "prereqs": []
    },
    "lhum-150": {
        "id": "lhum-150",
        "course_id": "L/Hum 150",
        "name": "Japanese Literature in Translation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Read and examine the selected classical Japanese literature and its traditions from 7th to 11th century from the perspectives of women, anti-heroes, and religions. A comparative analysis is applied to many genres such as oral traditions, performing arts, films, picture scrolls, comics, and anime to understand how Japanese think, and how Shinto and Buddhism have formed their ways of life, ethics, and concepts of life and death. Read selected portions of \"The Kojiki\", \"Manyoshu\", \"The Tale of Ise\", \"The tale of the Bamboo-Cutter\" (The Tale of the Moon Princess), and \"The Tale of Genji.\"\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Hirai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/japanese-literature-in-translation",
        "prereq_text": "",
        "prereqs": []
    },
    "lhum-151": {
        "id": "lhum-151",
        "course_id": "L/Hum 151",
        "name": "Japanese Literature in Translation from Medieval to Pre-modern Japan",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Read and examine the selected Medieval to pre-modern Japanese literature and its traditions from 11th to 18th century from the perspectives of women, anti-heroes, and religions. A comparative analysis is applied to many genres such as oral traditions, performing arts, films, picture scrolls, comics, and anime to understand how Japanese think, and how Shinto, Buddhism, Neo-Confucianism, as well as the social systems, have formed their ways of life, ethics, and concepts of life and death. Read \"The Princess Who Loved Insects\" from \"The Tsutsumi-Chunagon Monogatari\", selected chapters of \"The Tale of The Heike\", \"The Konjyaku Monogatari\", and \"Otogizoshi\". Also read \"The Double Suicide at Sonezaki\" and \"The Double Suicide at Amijima.\"",
        "offered": true,
        "instructors": "Hirai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/japanese-literature-in-translation-from-medieval-to-pre-modern-japan",
        "prereq_text": "",
        "prereqs": []
    },
    "lhum-152": {
        "id": "lhum-152",
        "course_id": "L/Hum 152",
        "name": "Classical French Literature in Translation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course introduces students to French theater and fiction of the seventeenth and eighteenth centuries, from Molière's comedies (The Misanthrope, Tartuffe), and Racine's tragedy Phaedra to the novels of Madame de Lafayette, Marivaux, and Laclos. Topics include the aesthetics of neoclassical theater, the rise of the novel, historical and social contexts (the reign of Louis XIV, libertinage, Rousseauism), and writers' creative development. Covers the period 1643-1789. Conducted in English, but students may read the French originals.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Merrill",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/classical-french-literature-in-translation",
        "prereq_text": "",
        "prereqs": []
    },
    "lhum-154": {
        "id": "lhum-154",
        "course_id": "L/Hum 154",
        "name": "The Modern French Novel in Translation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course introduces students to the French novel of the nineteenth and twentieth centuries, from the realist masterpieces of Stendhal (The Red and the Black), Balzac (Old Goriot), and Flaubert (Madame Bovary/Sentimental Education) to Marcel Proust's In Search of Lost Time. Topics include the literary representation of reality, historical and social contexts (the Bourbon Restoration, 1848 Revolution, the Third Republic), and the decline of the French nobility. Covers 1814-1918. Conducted in English, but students may read the French originals.",
        "offered": true,
        "instructors": "Merrill",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/the-modern-french-novel-in-translation",
        "prereq_text": "",
        "prereqs": []
    },
    "lhum-162": {
        "id": "lhum-162",
        "course_id": "L/Hum 162",
        "name": "Spanish and Latin American Literature in Translation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This class is an introduction to the literary masterworks of the Hispanic tradition from the 16th to the 20th centuries. Readings and discussions are in English, but students may read Spanish originals.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/spanish-and-latin-american-literature-in-translation",
        "prereq_text": "",
        "prereqs": []
    },
    "hum-169": {
        "id": "hum-169",
        "course_id": "Hum 169",
        "name": "Chinese Cinema",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Wang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/chinese-cinema",
        "prereq_text": "",
        "prereqs": []
    },
    "hum-174": {
        "id": "hum-174",
        "course_id": "Hum 174",
        "name": "Topics in Masterpieces of Chinese Writing",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Offered concurrently with L 174. Reading and discussion of representative Chinese written work throughout Chinese history, including philosophical texts and literary works in different genres. Students are expected to examine these works in light of their sociopolitical and historical contexts. Students who write papers in Chinese may enroll in this class as L 174. This course can be repeated for credit when the course content changes.",
        "offered": true,
        "instructors": "Wang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/hum/topics-in-masterpieces-of-chinese-writing",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    }
}