{
    "l-102-abc": {
        "id": "l-102-abc",
        "course_id": "L 102 abc",
        "name": "Elementary French",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/elementary-french",
        "prereq_text": "",
        "prereqs": []
    },
    "l-103-abc": {
        "id": "l-103-abc",
        "course_id": "L 103 abc",
        "name": "Intermediate French",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Merrill, Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/intermediate-french",
        "prereq_text": "Prerequisites: L 102 abc or equivalent.",
        "prereqs": []
    },
    "l-104": {
        "id": "l-104",
        "course_id": "L 104",
        "name": "French Cinema",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "A critical survey of major directors, genres, and movements in French cinema. Particular attention is devoted to the development of film theory and criticism in France and their relation to film production. The course may also focus on problems of transposition from literature to cinema. The class includes screenings of films by Méliès, Dulac, Clair, Renoir, Carné, Pagnol, Cocteau, Bresson, Tati, Truffaut, Godard, Resnais, Lelouch, Malle, Pialat, Rohmer, and Varda. Students are expected to write three 5-page critical papers. Conducted in French.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/french-cinema",
        "prereq_text": "Prerequisites: L 103 abc or equivalent.",
        "prereqs": []
    },
    "l-105": {
        "id": "l-105",
        "course_id": "L 105",
        "name": "Topics in French Literature",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Offered concurrently with Hum 105. L 105 and L 116 are taught in alternate years. Topics may include the 20th-century major French novels; French modern theatre; conflicting memories of the second world war; coming of age novels; the French Muslim identity. Conducted in French. Students who write papers in English may enroll in this class as Hum 105, which satisfies the advanced humanities requirement.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/topics-in-french-literature",
        "prereq_text": "Prerequisites: L 103 abc or equivalent.",
        "prereqs": []
    },
    "l-106-abc": {
        "id": "l-106-abc",
        "course_id": "L 106 abc",
        "name": "Elementary Japanese",
        "units": "9 units (4-0-5)",
        "terms": "first, second, third terms",
        "description": "",
        "offered": true,
        "instructors": "Fujio",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/elementary-japanese",
        "prereq_text": "Prerequisites: L106a is required for L106b and L106b is required for L106c.",
        "prereqs": []
    },
    "l-107-abc": {
        "id": "l-107-abc",
        "course_id": "L 107 abc",
        "name": "Intermediate Japanese",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Continued instruction and practice in conversation, building up vocabulary, and understanding complex sentence patterns. The emphasis, however, will be on developing reading skills. Recognition of approximately 1,000 characters.",
        "offered": true,
        "instructors": "Hirai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/intermediate-japanese",
        "prereq_text": "Prerequisites: L 106 abc or equivalent.",
        "prereqs": []
    },
    "l-108-abc": {
        "id": "l-108-abc",
        "course_id": "L 108 abc",
        "name": "Advanced Japanese",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "Developing overall language skills. Literary and newspaper readings. Technical and scientific translation. Improvement of listening and speaking ability so as to communicate with Japanese people in real situations. Recognition of the 1,850 general-use characters.",
        "offered": true,
        "instructors": "Hirai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/advanced-japanese",
        "prereq_text": "Prerequisites: L 107 abc or equivalent.",
        "prereqs": []
    },
    "lvc-109": {
        "id": "lvc-109",
        "course_id": "L/VC 109",
        "name": "Introduction to 20th-Century French Cinema",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course introduces students to the artistic style and the social, historical, and political content of French films, starting with Méliès and the Lumière brothers and working through surrealism and impressionism, 1930s poetic realism, the Occupation, the New Wave, the Cinema du look, and some critically acclaimed auteurs of the end of the century. The class teaches students to look at film as a medium with its own techniques and formal principles. Conducted in English.",
        "offered": true,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/introduction-to-20th-century-french-cinema",
        "prereq_text": "",
        "prereqs": []
    },
    "l-110-abc": {
        "id": "l-110-abc",
        "course_id": "L 110 abc",
        "name": "Elementary Spanish",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Grammar fundamentals and their use in understanding, speaking, reading, and writing Spanish. Exclusively for students with no previous knowledge of Spanish.",
        "offered": true,
        "instructors": "Arjona, Garcia",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/elementary-spanish",
        "prereq_text": "",
        "prereqs": []
    },
    "lvc-111": {
        "id": "lvc-111",
        "course_id": "L/VC 111",
        "name": "Introduction to 21st-Century French Cinema",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "L/VC 109 and L/VC 111 are taught in alternate years. This course looks at popular genres (comedy, thriller, animation film) and auteur cinema. It focuses on major trends in contemporary French movies and their relationships to French society (exploration of class, ethnic, gender and sexual identity, etc.). It analyzes the reappropriation of the national heritage, the progressive feminization of the filmmaking profession and the new appearance of directors who are immigrants or children of immigrants. Throughout this class, students will further develop their understanding of the methods and concepts of cinema studies. Conducted in English.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/introduction-to-21st-century-french-cinema",
        "prereq_text": "",
        "prereqs": []
    },
    "l-112-abc": {
        "id": "l-112-abc",
        "course_id": "L 112 abc",
        "name": "Intermediate Spanish",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Grammar review, vocabulary building, practice in conversation, and introduction to relevant history, literature, and culture. Literary reading and writing are emphasized in the second and third terms. Students who have studied Spanish elsewhere must consult with the instructor before registering.",
        "offered": true,
        "instructors": "Arjona",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/intermediate-spanish",
        "prereq_text": "Prerequisites: L 110 abc or equivalent.",
        "prereqs": []
    },
    "l-114-abc": {
        "id": "l-114-abc",
        "course_id": "L 114 abc",
        "name": "Spanish Language Literature and its Film Adaptations",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Offered concurrently with Hum 114abc. This course explores the mixed cultures of the Spanish speaking countries and the United States, through a compilation of novel excerpts, short stories, drama, music, poetry, and film. This heterogeneity of written and audiovisual texts aims to acquaint students with the rich cultures of the Spanish speaking peoples, from the standpoint of ethnicity, gender, and social class. The course also focuses on continuing to develop Spanish language skills. Conducted in Spanish. (a) The traditional role of women during dictatorships and their journey to freedom (b) Family relationships and their impact on mental and physical health (c) building gender, social, and economic equality. Each term can be taken independently. Students who write papers in English may enroll in this class as humanities, which satisfies the advanced humanities requirement.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Arjona",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/spanish-language-literature-and-its-film-adaptations",
        "prereq_text": "Prerequisites: L 112 abc or equivalent.",
        "prereqs": []
    },
    "l-115-abc": {
        "id": "l-115-abc",
        "course_id": "L 115 abc",
        "name": "Hispanic Cultures in Film and Literature",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Offered concurrently with Hum 115. This course introduces students to narrative film and literature from the Hispanic world, with an emphasis on the hero figure. It also takes up hybridization and transculturation in the Americas, specifically in Mexico, Peru, and Cuba, as well as film and narratives of Spain from the Civil War to the present. Conducted in Spanish. (a) Basics of Hispanic films and narratives, and their socio-cultural roots (b) Hybridization and mestizo cultures in the Hispanic world (c) The last century in Hispanic film and narrative. Each term can be taken independently. Students who write papers in English may enroll in this class as Hum 115, which satisfies the advanced humanities requirement.",
        "offered": true,
        "instructors": "Garcia",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/hispanic-cultures-in-film-and-literature",
        "prereq_text": "Prerequisites: L 112 abc or equivalent.",
        "prereqs": []
    },
    "l-116": {
        "id": "l-116",
        "course_id": "L 116",
        "name": "Topics in French Culture",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Offered concurrently with Hum 116. L 105 and L 116 given in alternate years. The course focuses on contemporary France. Topics may include France and the European Union; political parties and elections; family life; social protection; religion; education; media and technology. Conducted in French. Students who write papers in English may enroll in this class as Hum 116, which satisfies the advanced humanities requirement.",
        "offered": true,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/topics-in-french-culture",
        "prereq_text": "Prerequisites: L 103 abc or equivalent.",
        "prereqs": []
    },
    "l-130-abc": {
        "id": "l-130-abc",
        "course_id": "L 130 abc",
        "name": "Elementary German",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Grammar fundamentals and their use in aural comprehension, speaking, reading, and writing. Students who have had German in secondary school or college must consult with the instructor before registering.",
        "offered": true,
        "instructors": "Aebi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/elementary-german",
        "prereq_text": "",
        "prereqs": []
    },
    "l-132-abc": {
        "id": "l-132-abc",
        "course_id": "L 132 abc",
        "name": "Intermediate German",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Reading of short stories and plays, grammar review, aural and oral drills and exercises, expansion of vocabulary, and practice in reading, writing, and conversational skills. Second and third terms will emphasize written expression, technical/ scientific translation, and literary readings. Students who have studied German elsewhere must consult with the instructor before registering.",
        "offered": true,
        "instructors": "Aebi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/intermediate-german",
        "prereq_text": "Prerequisites: L 130 abc or equivalent.",
        "prereqs": []
    },
    "l-139": {
        "id": "l-139",
        "course_id": "L 139",
        "name": "Translation Theory and Practice (Chinese Historical Sources Seminar)",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This seminar will introduce students to the problems and practices of historical translation for academic purposes, with a focus on primary materials from Chinese history. Students will take responsibility for an individual translation project, participate in seminar discussions and collaborative projects to improve the translations being made, and discuss the philosophical and methodological questions at the heart of the practice of translation. Advanced proficiency in written Chinese is required. Students who write analyses (4,000 words) of the sources being translated may enroll in this class as H 139, which satisfies the advanced humanities credit.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/translation-theory-and-practice-(chinese-historical-sources-seminar)",
        "prereq_text": "",
        "prereqs": []
    },
    "hl-142": {
        "id": "hl-142",
        "course_id": "H/L 142",
        "name": "Perspectives on History through Russian Literature",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "The Russian intelligentsia registered the arrival of modern urban society with a highly articulate sensitivity, perhaps because these changes-industrialization, the breakdown of traditional hierarchies and social bonds, the questioning of traditional beliefs-came to Russia so suddenly. This gives their writings a paradigmatic quality; the modern dilemmas that still haunt us are made so eloquently explicit in them that they have served as models for succeeding generations of writers and social critics. This course explores these writings (in English translation) against the background of Russian society, focusing especially on particular works of Chekhov, Dostoevsky, Goncharov, Tolstoy, and Turgenev.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dennison",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/perspectives-on-history-through-russian-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "lhum-150": {
        "id": "lhum-150",
        "course_id": "L/Hum 150",
        "name": "Japanese Literature in Translation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Read and examine the selected classical Japanese literature and its traditions from 7th to 11th century from the perspectives of women, anti-heroes, and religions. A comparative analysis is applied to many genres such as oral traditions, performing arts, films, picture scrolls, comics, and anime to understand how Japanese think, and how Shinto and Buddhism have formed their ways of life, ethics, and concepts of life and death. Read selected portions of \"The Kojiki\", \"Manyoshu\", \"The Tale of Ise\", \"The tale of the Bamboo-Cutter\" (The Tale of the Moon Princess), and \"The Tale of Genji.\"\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Hirai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/japanese-literature-in-translation",
        "prereq_text": "",
        "prereqs": []
    },
    "lhum-151": {
        "id": "lhum-151",
        "course_id": "L/Hum 151",
        "name": "Japanese Literature in Translation from Medieval to Pre-modern Japan",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Read and examine the selected Medieval to pre-modern Japanese literature and its traditions from 11th to 18th century from the perspectives of women, anti-heroes, and religions. A comparative analysis is applied to many genres such as oral traditions, performing arts, films, picture scrolls, comics, and anime to understand how Japanese think, and how Shinto, Buddhism, Neo-Confucianism, as well as the social systems, have formed their ways of life, ethics, and concepts of life and death. Read \"The Princess Who Loved Insects\" from \"The Tsutsumi-Chunagon Monogatari\", selected chapters of \"The Tale of The Heike\", \"The Konjyaku Monogatari\", and \"Otogizoshi\". Also read \"The Double Suicide at Sonezaki\" and \"The Double Suicide at Amijima.\"",
        "offered": true,
        "instructors": "Hirai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/japanese-literature-in-translation-from-medieval-to-pre-modern-japan",
        "prereq_text": "",
        "prereqs": []
    },
    "lhum-152": {
        "id": "lhum-152",
        "course_id": "L/Hum 152",
        "name": "Classical French Literature in Translation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course introduces students to French theater and fiction of the seventeenth and eighteenth centuries, from Molière's comedies (The Misanthrope, Tartuffe), and Racine's tragedy Phaedra to the novels of Madame de Lafayette, Marivaux, and Laclos. Topics include the aesthetics of neoclassical theater, the rise of the novel, historical and social contexts (the reign of Louis XIV, libertinage, Rousseauism), and writers' creative development. Covers the period 1643-1789. Conducted in English, but students may read the French originals.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Merrill",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/classical-french-literature-in-translation",
        "prereq_text": "",
        "prereqs": []
    },
    "lvc-153": {
        "id": "lvc-153",
        "course_id": "L/VC 153",
        "name": "Refugees and Migrants' Visual and Textual Representations",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course focuses on the refugees and migrants' images in documentaries, narrative films, graphic novels, fictional texts, poetic works, and autobiographical narratives. It investigates how these representations participate in the development and strengthening of political discourse. Works by authors such as Hannah Arendt, Antje Ellermann, Achille Mbembe, Martin A. Schain, and Sasha Polakow-Suransky will provide some context to our analysis. Topics discussed in class include the historical and economic relationships of Europe with the refugees and migrants' countries of origin, the rise of anti-immigrant politics and its significance for the future of the European Union, but also its impact on social peace, in France in particular. This course is taught in English and satisfies the advanced humanities requirement.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/refugees-and-migrants'-visual-and-textual-representations",
        "prereq_text": "",
        "prereqs": []
    },
    "lhum-154": {
        "id": "lhum-154",
        "course_id": "L/Hum 154",
        "name": "The Modern French Novel in Translation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course introduces students to the French novel of the nineteenth and twentieth centuries, from the realist masterpieces of Stendhal (The Red and the Black), Balzac (Old Goriot), and Flaubert (Madame Bovary/Sentimental Education) to Marcel Proust's In Search of Lost Time. Topics include the literary representation of reality, historical and social contexts (the Bourbon Restoration, 1848 Revolution, the Third Republic), and the decline of the French nobility. Covers 1814-1918. Conducted in English, but students may read the French originals.",
        "offered": true,
        "instructors": "Merrill",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/the-modern-french-novel-in-translation",
        "prereq_text": "",
        "prereqs": []
    },
    "lhum-162": {
        "id": "lhum-162",
        "course_id": "L/Hum 162",
        "name": "Spanish and Latin American Literature in Translation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This class is an introduction to the literary masterworks of the Hispanic tradition from the 16th to the 20th centuries. Readings and discussions are in English, but students may read Spanish originals.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/spanish-and-latin-american-literature-in-translation",
        "prereq_text": "",
        "prereqs": []
    },
    "l-167": {
        "id": "l-167",
        "course_id": "L 167",
        "name": "Latin Literature",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Major works of Latin literature, usually one per term. No work will be studied more than once in four years and students may repeat the course for credit.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Pigman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/latin-literature",
        "prereq_text": "Prerequisites: Three years of high-school Latin.",
        "prereqs": []
    },
    "l-169": {
        "id": "l-169",
        "course_id": "L 169",
        "name": "Chinese Cinema",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Wang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/chinese-cinema",
        "prereq_text": "",
        "prereqs": []
    },
    "l-170-abc": {
        "id": "l-170-abc",
        "course_id": "L 170 abc",
        "name": "Introduction to Chinese",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "An introductory course in standard Chinese (Mandarin) designed for students with no previous knowledge of the language. The course introduces the fundamentals of Chinese, including pronunciation, grammar, and Chinese characters, emphasizing the four basic language skills: listening, speaking, reading, and writing. By the end of the three-term sequence, students will have acquired knowledge of basic rules of grammar and the ability to converse, read, and write on simple topics of daily life, and will have command of more than 800 Chinese compounds and 700 characters.",
        "offered": true,
        "instructors": "Wang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/introduction-to-chinese",
        "prereq_text": "",
        "prereqs": []
    },
    "l-171-abc": {
        "id": "l-171-abc",
        "course_id": "L 171 abc",
        "name": "Accelerated Chinese for Heritage Learners",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "A streamlined course designed for students who have acquired some speaking, writing, or reading skills, either from home or school. The course aims at consolidating and developing the students' ability in listening, conversation, reading, and writing. By the end of the three-term sequence, students should have command of 2000 Chinese compounds and 1500 characters, and be able to live or work in a Chinese speaking environment. Students who completed L 171 abc can advance to L 173 ab (Advanced Chinese)",
        "offered": true,
        "instructors": "Zhu",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/accelerated-chinese-for-heritage-learners",
        "prereq_text": "Prerequisites: Prior exposure to the language.",
        "prereqs": []
    },
    "l-172-abc": {
        "id": "l-172-abc",
        "course_id": "L 172 abc",
        "name": "Intermediate Chinese",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "A course designed to meet the personal interests and future professional goals of students who have had one year of elementary modern Chinese. Students will learn new vocabulary, sentence patterns, idiomatic expressions, and proverbs, as well as insights into Chinese society, culture, and customs.",
        "offered": true,
        "instructors": "Zhu",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/intermediate-chinese",
        "prereq_text": "Prerequisites: L 170 abc or L 171 abc or equivalent.",
        "prereqs": []
    },
    "l-173": {
        "id": "l-173",
        "course_id": "L 173",
        "name": "Advanced Chinese - Contemporary China",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Wang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/advanced-chinese---contemporary-china",
        "prereq_text": "Prerequisites: L 171 abc, L 172 abc or equivalent.",
        "prereqs": []
    },
    "l-174": {
        "id": "l-174",
        "course_id": "L 174",
        "name": "Topics in Masterpieces of Chinese Writing",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Offered concurrently with Hum 174. Reading and discussion of representative Chinese written work throughout Chinese history, including philosophical texts and literary works in different genres. Students are expected to examine these works in light of their sociopolitical and historical contexts. Students who write papers in English may enroll in this class as Hum 174, which satisfies the advanced humanities requirement. This course can be repeated for credit when the course content changes.",
        "offered": true,
        "instructors": "Wang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/topics-in-masterpieces-of-chinese-writing",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "l-175": {
        "id": "l-175",
        "course_id": "L 175",
        "name": "French Conversation",
        "units": "6 units (3-0-3)",
        "terms": "third term",
        "description": "Intense training in oral expression, pronunciation, vocabulary, listening comprehension and fluency. This course is designed for students interested in scientific French, planning to attend Ecole Polytechnique, or enrolled in the NSF REU program. Caltech professors and postdocs intending to spend time in France are also welcome. Discussion materials and guest lectures will focus on technical language to prepare students for their classes in math and science. Taught in French. L 175 can be repeated for credit as content changes every year.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/french-conversation",
        "prereq_text": "Prerequisites: L 102 abc and L 103 abc or equivalent.",
        "prereqs": []
    },
    "l-176": {
        "id": "l-176",
        "course_id": "L 176",
        "name": "Chinese Conversation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Training in oral expression, pronunciation, vocabulary, listening comprehension and fluency. The class is designed for students who have learned one year of Chinese and plan to incorporate it into their future professional or social lives. News, guest talks and discussion forums will be included. Can be repeated for credit as content changes every year.",
        "offered": true,
        "instructors": "Zhu",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/chinese-conversation",
        "prereq_text": "Prerequisites: L 170 abc or L 171 abc or equivalent.",
        "prereqs": []
    },
    "l-177": {
        "id": "l-177",
        "course_id": "L 177",
        "name": "Advanced Chinese - Classical Chinese",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Wang",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/advanced-chinese---classical-chinese",
        "prereq_text": "Prerequisites: L 171abc, L 172abc or equivalent.",
        "prereqs": []
    },
    "hl-191": {
        "id": "hl-191",
        "course_id": "H/L 191",
        "name": "Perspectives on History through German Literature",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Industrialization, economic growth, and democracy came to Germany much later than to England and France, and the forms they took in Germany were filtered through the specific institutional character of Central Europe. German-speaking writers and intellectuals saw these trends from the perspective of indigenous intellectual traditions, and the resulting collisions of values and priorities largely shaped European and American social, political, and literary debates for much of the nineteenth and twentieth centuries. This course explores these writings (in English translation) against the historical background of Central European society, focusing on particular works of Goethe, Hoffmann, Heine, Nietzsche, Kafka, Rilke, and Mann.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Dennison",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/l/perspectives-on-history-through-german-literature",
        "prereq_text": "",
        "prereqs": []
    }
}