{
    "nb-101": {
        "id": "nb-101",
        "course_id": "NB 101",
        "name": "Survey of Neurobiology Research at Caltech",
        "units": "1 unit",
        "terms": "first term",
        "description": "This course is designed to introduce undergraduate NB minors and first-year NB graduate students to the variety of research being undertaken by NB faculty. Topics from all the neurobiology-related research labs are discussed and span the range from single molecules to behavior to neuroscience-related aspects of public health.",
        "offered": true,
        "instructors": "Lester",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/survey-of-neurobiology-research-at-caltech",
        "prereq_text": "",
        "prereqs": []
    },
    "nbbicns-150": {
        "id": "nbbicns-150",
        "course_id": "NB/Bi/CNS 150",
        "name": "Introduction to Neuroscience",
        "units": "10 units (4-0-6)",
        "terms": "third term",
        "description": "General principles of the function and organization of nervous systems, providing both an overview of the subject and a foundation for advanced courses. Topics include the physical and chemical bases for action potentials, synaptic transmission, and sensory transduction; anatomy; development; sensory and motor pathways; memory and learning at the molecular, cellular, and systems level; and the neuroscience of brain diseases. Letter grades only.",
        "offered": true,
        "instructors": "Lester, Lois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/introduction-to-neuroscience",
        "prereq_text": "Prerequisites: Bi 8, 9, or instructor's permission.",
        "prereqs": []
    },
    "nbbicns-152": {
        "id": "nbbicns-152",
        "course_id": "NB/Bi/CNS 152",
        "name": "Neural Circuits and Physiology of Homeostatic Regulation",
        "units": "6 units (2-0-4)",
        "terms": "Second Term",
        "description": "An advanced course of lectures, readings, and student presentations focusing on neural basis of innate body functions such as appetite, sleep, temperature, and osmolality regulation. This course will also cover the gut-to-brain interactions focusing on homeostatic functions. These include genetics, neural manipulation, and viral tracing tools with particular emphasis on data interpretation and limitation of available neuroscience tools.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Oka",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/neural-circuits-and-physiology-of-homeostatic-regulation",
        "prereq_text": "Prerequisites: Graduate standing or NB/Bi/CNS 150, or equivalent.",
        "prereqs": []
    },
    "nbbicns-154": {
        "id": "nbbicns-154",
        "course_id": "NB/Bi/CNS 154",
        "name": "Principles of Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "Third term",
        "description": "This course aims to distill the fundamental tenets of brain science, unlike the voluminous textbook with a similar title. What are the essential facts and ways of understanding in this discipline? How does neuroscience connect to other parts of life science, physics, and mathematics? Lectures and guided reading will touch on a broad range of phenomena from evolution, development, biophysics, computation, behavior, and psychology. Students will benefit from prior exposure to at least some of these domains.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Meister",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/principles-of-neuroscience",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or equivalent.",
        "prereqs": []
    },
    "nbbibe-155": {
        "id": "nbbibe-155",
        "course_id": "NB/Bi/BE 155",
        "name": "Neuropharmacology",
        "units": "6 units (3-0-3)",
        "terms": "Second term",
        "description": "The neuroscience of drugs for therapy, for prevention, and for recreation. Students learn the prospects for new generations of medications in neurology, psychiatry, aging, and treatment of substance abuse. Topics: Types of drug molecules, Drug receptors, Electrophysiology, Drugs activate ion channels, Drugs block ion channels, Drugs activate and block G protein pathways, Drugs block neurotransmitter transporters, Pharmacokinetics, Recreational drugs, Nicotine Addiction, Opiate Addiction, Drugs for neurodegenerative diseases: Alzheimer's disease, Parkinson's disease, Drugs for epilepsy and migraine, and Psychiatric diseases: Nosology and drugs. The course is taught at the research level.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Lester",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/neuropharmacology",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150.",
        "prereqs": []
    },
    "nbbicns-157": {
        "id": "nbbicns-157",
        "course_id": "NB/Bi/CNS 157",
        "name": "Comparative Nervous Systems",
        "units": "9 units (2-3-4)",
        "terms": "third term",
        "description": "An introduction to the comparative study of the gross and microscopic structure of nervous systems. Emphasis on the vertebrate nervous system; also, the highly developed central nervous systems found in arthropods and cephalopods. Variation in nervous system structure with function and with behavioral and ecological specializations and the evolution of the vertebrate brain. Letter grades only.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Allman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/comparative-nervous-systems",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "nbbicns-162": {
        "id": "nbbicns-162",
        "course_id": "NB/Bi/CNS 162",
        "name": "Cellular and Systems Neuroscience Laboratory",
        "units": "12 units (2-4-6)",
        "terms": "First Term",
        "description": "A laboratory-based introduction to experimental methods used for electrophysiological studies of the central nervous system. Through the term, students investigate the physiological response properties of neurons in vertebrate and invertebrate brains, using extra- and intracellular recording techniques. Students are instructed in all aspects of experimental procedures, including proper surgical techniques, electrode fabrication, and data analysis. The class also includes a brain dissection and independent student projects that utilize modern digital neuroscience resources.",
        "offered": true,
        "instructors": "Oka, Wagenaar",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/cellular-and-systems-neuroscience-laboratory",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or instructor's permission.",
        "prereqs": []
    },
    "nbbicns-163": {
        "id": "nbbicns-163",
        "course_id": "NB/Bi/CNS 163",
        "name": "The Biological Basis of Neural Disorders",
        "units": "6 units (3-0-3)",
        "terms": "second term",
        "description": "The neuroscience of psychiatric, neurological, and neurodegenerative disorders and of substance abuse, in humans and in animal models. Students master the biological principles including genetics, cell biology, biochemistry, physiology, and circuits. Topics are taught at the research level and include classical and emerging therapeutic approaches and diagnostic strategies.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Lester, Lois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/the-biological-basis-of-neural-disorders",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or instructor's permission.",
        "prereqs": []
    },
    "nbbicns-164": {
        "id": "nbbicns-164",
        "course_id": "NB/Bi/CNS 164",
        "name": "Tools of Neurobiology",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Offers a broad survey of methods and approaches to understanding in modern neurobiology. The focus is on understanding the tools of the discipline, and their use will be illustrated with current research results. Topics include: molecular genetics, disease models, transgenic and knock-in technology, virus tools, tracing methods, gene profiling, light and electron microscopy, optogenetics, optical and electrical recording, neural coding, quantitative behavior, modeling and theory.",
        "offered": true,
        "instructors": "Meister",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/tools-of-neurobiology",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or equivalent.",
        "prereqs": []
    },
    "plcnsnbbipsy-167": {
        "id": "plcnsnbbipsy-167",
        "course_id": "Pl/CNS/NB/Bi/Psy 167",
        "name": "Consciousness",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "One of the last great challenges to our understanding of the world concerns conscious experience. What exactly is it? How is it caused or constituted? And how does it connect with the rest of our science? This course will cover philosophy of mind, cognitive psychology, and cognitive neuroscience in a mixture of lectures and in-class discussion. There are no formal pre-requisites, but background in philosophy (equivalent to Pl 41, Pl 110) and in neuroscience (equivalent to NB/Bi/CNS 150) is strongly recommended and students with such background will be preferentially considered. Limited to 20.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/consciousness",
        "prereq_text": "Prerequisites: None, but strongly suggest prior background in philosophy of mind and basic neurobiology (such as Bi 150).",
        "prereqs": []
    },
    "cnsbipsynb-176": {
        "id": "cnsbipsynb-176",
        "course_id": "CNS/Bi/Psy/NB 176",
        "name": "Cognition",
        "units": "9 units (4-0-5)",
        "terms": "Third term",
        "description": "The cornerstone of current progress in understanding the mind, the brain, and the relationship between the two is the study of human and animal cognition. This course will provide an in-depth survey and analysis of behavioral observations, theoretical accounts, computational models, patient data, electrophysiological studies, and brain-imaging results on mental capacities such as attention, memory, emotion, object representation, language, and cognitive development.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Shimojo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/cognition",
        "prereq_text": "",
        "prereqs": []
    },
    "cnsbieecsnb-186": {
        "id": "cnsbieecsnb-186",
        "course_id": "CNS/Bi/EE/CS/NB 186",
        "name": "Vision: From Computational Theory to Neuronal Mechanisms",
        "units": "12 units (4-4-4)",
        "terms": "Second term",
        "description": "Lecture, laboratory, and project course aimed at understanding visual information processing, in both machines and the mammalian visual system. The course will emphasize an interdisciplinary approach aimed at understanding vision at several levels: computational theory, algorithms, psychophysics, and hardware (i.e., neuroanatomy and neurophysiology of the mammalian visual system). The course will focus on early vision processes, in particular motion analysis, binocular stereo, brightness, color and texture analysis, visual attention and boundary detection. Students will be required to hand in approximately three homework assignments as well as complete one project integrating aspects of mathematical analysis, modeling, physiology, psychophysics, and engineering.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Meister, Perona, Shimojo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/vision:-from-computational-theory-to-neuronal-mechanisms",
        "prereq_text": "",
        "prereqs": []
    },
    "cnsbiphcsnb-187": {
        "id": "cnsbiphcsnb-187",
        "course_id": "CNS/Bi/Ph/CS/NB 187",
        "name": "Neural Computation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course aims at a quantitative understanding of how the nervous system computes. The goal is to link phenomena across scales from membrane proteins to cells, circuits, brain systems, and behavior. We will learn how to formulate these connections in terms of mathematical models, how to test these models experimentally, and how to interpret experimental data quantitatively. The concepts will be developed with motivation from some of the fascinating phenomena of animal behavior, such as: aerobatic control of insect flight, precise localization of sounds, sensing of single photons, reliable navigation and homing, rapid decision-making during escape, one-shot learning, and large-capacity recognition memory.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Meister",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/neural-computation",
        "prereq_text": "Prerequisites: introductory neuroscience (Bi 150 or equivalent); mathematical methods (Bi 195 or equivalent); scientific programming.",
        "prereqs": []
    },
    "bicnsnb-195": {
        "id": "bicnsnb-195",
        "course_id": "Bi/CNS/NB 195",
        "name": "Mathematics in Biology",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course develops the mathematical methods needed for a quantitative understanding of biological phenomena, including data analysis, formulation of simple models, and the framing of quantitative questions. Topics include: probability and stochastic processes, linear algebra and transforms, dynamical systems, scientific programming.",
        "offered": true,
        "instructors": "Thomson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/mathematics-in-biology",
        "prereq_text": "Prerequisites: calculus.",
        "prereqs": []
    },
    "bebicnsnb-197": {
        "id": "bebicnsnb-197",
        "course_id": "BE/Bi/CNS/NB 197",
        "name": "Mentoring and Outreach",
        "units": "taken in any term, usually 3 units per term and not more than 6 in a single term",
        "terms": "",
        "description": "In consultation with, and with the approval of, a faculty advisor (usually the student’s academic advisor) and the Caltech Center for Teaching, Learning, and Outreach. Students may obtain credit for engaging in volunteer efforts to promote public understanding of science; to mentor and tutor young people and underserved populations; or to otherwise contribute to the diversity, equity, and inclusiveness of the scientific enterprise. Students will be required to fill out short pre- and post-outreach activity forms to describe their proposal and to report on the results. Students may petition their option representative (graduate students) or academic advisor (undergraduate students) if they seek credits beyond the 12-unit limit. Offered pass/fail.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/mentoring-and-outreach",
        "prereq_text": "",
        "prereqs": []
    },
    "bebinb-203": {
        "id": "bebinb-203",
        "course_id": "BE/Bi/NB 203",
        "name": "Introduction to Programming for the Biological Sciences Bootcamp",
        "units": "6 units",
        "terms": "summer term",
        "description": "This course provides an intensive, hands-on, pragmatic introduction to computer programming aimed at biologists and bioengineers. No previous programming experience is assumed. Python is the language of instruction. Students will learn basic concepts such as data types, control structures, string processing, functions, input/output, etc., while writing code applied to biological problems. At the end of the course, students will be able to perform simple simulations, write scripts to run software packages and parse output, and analyze and plot data. This class is offered as a week-long summer \"boot camp\" the week after Commencement, in which students spend all day working on the course. Students who do not have a strong need for the condensed boot camp schedule are encouraged to take BE/Bi 103 a instead. Graded pass/fail.",
        "offered": true,
        "instructors": "Bois",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/introduction-to-programming-for-the-biological-sciences-bootcamp",
        "prereq_text": "",
        "prereqs": []
    },
    "nbbicns-216": {
        "id": "nbbicns-216",
        "course_id": "NB/Bi/CNS 216",
        "name": "Behavior of Mammals",
        "units": "6 units (2-0-4)",
        "terms": "First term",
        "description": "A course of lectures, readings, and discussions focused on the genetic, physiological, and ecological bases of behavior in mammals. A basic knowledge of neuroanatomy and neurophysiology is desirable.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Allman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/behavior-of-mammals",
        "prereq_text": "",
        "prereqs": []
    },
    "nbbicns-217": {
        "id": "nbbicns-217",
        "course_id": "NB/Bi/CNS 217",
        "name": "Central Mechanisms in Perception",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "Reading and discussions of behavioral and electrophysiological studies of the systems for the processing of sensory information in the brain.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Allman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/central-mechanisms-in-perception",
        "prereq_text": "",
        "prereqs": []
    },
    "nbbicns-220": {
        "id": "nbbicns-220",
        "course_id": "NB/Bi/CNS 220",
        "name": "Genetic Dissection of Neural Circuit Function",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "This advanced course will discuss the emerging science of neural \"circuit breaking\" through the application of molecular genetic tools. These include optogenetic and pharmacogenetic manipulations of neuronal activity, genetically based tracing of neuronal connectivity, and genetically based indicators of neuronal activity. Both viral and transgenic approaches will be covered, and examples will be drawn from both the invertebrate and vertebrate literature. Interested CNS or other graduate students who have little or no familiarity with molecular biology will be supplied with the necessary background information. Lectures and student presentations from the current literature.",
        "offered": true,
        "instructors": "Anderson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/genetic-dissection-of-neural-circuit-function",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or equivalent. Open to advanced (junior or senior) undergraduates only and with instructor permission.",
        "prereqs": []
    },
    "bicnsbenb-230": {
        "id": "bicnsbenb-230",
        "course_id": "Bi/CNS/BE/NB 230",
        "name": "Optogenetic and CLARITY Methods in Experimental Neuroscience",
        "units": "9 units (3-2-4)",
        "terms": "third term",
        "description": "The class covers the theoretical and practical aspects of using (1) optogenetic sensors and actuators to visualize and modulate the activity of neuronal ensembles; and (2) CLARITY approaches for anatomical mapping and phenotyping using tissue-hydrogel hybrids. The class offers weekly hands-on LAB exposure for opsin viral production and delivery to neurons, recording of light-modulated activity, and tissue clearing, imaging, and 3D reconstruction of fluorescent samples. Lecture topics include: opsin design (including natural and artificial sources), delivery (genetic targeting, viral transduction), light activation requirements (power requirements, wavelength, fiberoptics), compatible readout modalities (electrophysiology, imaging); design and use of methods for tissue clearing (tissue stabilization by polymers/hydrogels and selective extractions, such as of lipids for increased tissue transparency and macromolecule access). Class will discuss applications of these methods to neuronal circuits (case studies based on recent literature).\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Gradinaru",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/optogenetic-and-clarity-methods-in-experimental-neuroscience",
        "prereq_text": "Prerequisites: Graduate standing or NB/Bi/CNS 150 or equivalent or instructor's permission.",
        "prereqs": []
    },
    "bibecnsnb-241": {
        "id": "bibecnsnb-241",
        "course_id": "Bi/BE/CNS/NB 241",
        "name": "Spatial Genomics",
        "units": "9 units (1-8-0)",
        "terms": "third term",
        "description": "Maximum enrollment: 12. Applications of spatial genomics technology to various biological samples. Projects will be selected to represent problems in neurobiology, developmental biology and translational medicine. Emphasis will be placed on generating experimental data and analysis of data with machine learning algorithms for segmentation and clustering cells with single cell genomics tools, and preparation for publication.",
        "offered": true,
        "instructors": "Cai",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/spatial-genomics",
        "prereq_text": "Prerequisites: Instructor's permission.",
        "prereqs": []
    },
    "cnsbinb-247": {
        "id": "cnsbinb-247",
        "course_id": "CNS/Bi/NB 247",
        "name": "Cerebral Cortex",
        "units": "6 units (2-0-4)",
        "terms": "second term",
        "description": "A general survey of the structure and function of the cerebral cortex. Topics include cortical anatomy, functional localization, and newer computational approaches to understanding cortical processing operations. Motor cortex, sensory cortex (visual, auditory, and somatosensory cortex), association cortex, and limbic cortex. Emphasis is on using animal models to understand human cortical function and includes correlations between animal studies and human neuropsychological and functional imaging literature.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Andersen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/cerebral-cortex",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or equivalent.",
        "prereqs": []
    },
    "nbbicns-250-c": {
        "id": "nbbicns-250-c",
        "course_id": "NB/Bi/CNS 250 c",
        "name": "Topics in Systems Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The class focuses on quantitative studies of problems in systems neuroscience. Students will study classical work such as Hodgkin and Huxley's landmark papers on the ionic basis of the action potential, and will move from the study of interacting currents within neurons to the study of systems of interacting neurons. Topics will include lateral inhibition, mechanisms of motion tuning, local learning rules and their consequences for network structure and dynamics, oscillatory dynamics and synchronization across brain circuits, and formation and computational properties of topographic neural maps. The course will combine lectures and discussions, in which students and faculty will examine papers on systems neuroscience, usually combining experimental and theoretical/modeling components.",
        "offered": true,
        "instructors": "Siapas",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/topics-in-systems-neuroscience",
        "prereq_text": "Prerequisites: graduate standing.",
        "prereqs": []
    },
    "cnsbinb-256": {
        "id": "cnsbinb-256",
        "course_id": "CNS/Bi/NB 256",
        "name": "Brain-machine interfaces",
        "units": "6 units (2-0-4)",
        "terms": "third term",
        "description": "A brain-machine interface (BMI) records neural activity, decodes the intent of the participant, and generates control signals to operate assistive devices. Bi-directional BMIs can write signals back into the brain though electrical stimulation based on the recorded neural activity. These neurotechnologies have been advancing rapidly with therapeutic potential for several neurological diseases and disorders. Through lectures and reviews of the literature, the course will cover motor BMIs for robotics and communication, cognitive neural prosthetics, stimulation to restore sensation, and different invasive and non-invasive recording and stimulation technologies.\n Given in alternate years; not offered 2024-25.",
        "offered": true,
        "instructors": "Andersen",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/brain-machine-interfaces",
        "prereq_text": "",
        "prereqs": []
    },
    "nb-299": {
        "id": "nb-299",
        "course_id": "NB 299",
        "name": "Graduate Research",
        "units": "",
        "terms": "first, second, third terms",
        "description": "Students may register for research units after consultation with their adviser.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/nb/graduate-research",
        "prereq_text": "",
        "prereqs": []
    }
}