{
    "humpl-40": {
        "id": "humpl-40",
        "course_id": "Hum/Pl 40",
        "name": "Right and Wrong",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "This course addresses questions such as: Where do our moral ideas come from? What justifies them? How should they guide our conduct, as individuals and as a society? What kind of person should one aspire to be? Topics the course may deal with include meta-ethical issues (e.g., What makes an action right or wrong? When is one morally responsible for one's actions? How should society be organized?) and normative questions (e.g., Is eating meat morally acceptable? What should we tolerate and why? What are society's obligations toward the poor?). In addition, the psychological and neural substrates of moral judgment and decision making may be explored. The course draws on a variety of sources, including selections from the great works of moral and political philosophy (e.g., Aristotle's Nichomachean Ethics, Hobbes's Leviathan, Kant's Groundings for a Metaphysics of Morals, and Rawls's A Theory of Justice), contemporary discussions of particular moral issues, and the science of moral thought.",
        "offered": true,
        "instructors": "Quartz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/right-and-wrong",
        "prereq_text": "",
        "prereqs": []
    },
    "humpl-41": {
        "id": "humpl-41",
        "course_id": "Hum/Pl 41",
        "name": "Knowledge and Reality",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "The theme of this course is the scope and limitations of rational belief and knowledge. Students will examine the nature of reality, the nature of the self, the nature of knowledge, and how we learn about the natural world. Students will be introduced to these issues through selections from some of the world's greatest philosophical works, including Descartes's Meditations, Pascal's Pensées, Hume's Enquiry Concerning Human Understanding, Berkeley's Principles of Human Knowledge, and Kant's Prolegomena to any Future Metaphysics. A variety of more contemporary readings will also be assigned.",
        "offered": true,
        "instructors": "Eberhardt, Hitchcock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/knowledge-and-reality",
        "prereq_text": "",
        "prereqs": []
    },
    "humpl-44": {
        "id": "humpl-44",
        "course_id": "Hum/Pl 44",
        "name": "Philosophy Through Science Fiction",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will provide a broad introduction to philosophy using examples from science fiction to make abstract philosophical problems vivid. Topics may include: time travel and the reality of the past and future; teleportation and what makes someone the same person over time; fictional tales of extended deception and Cartesian skepticism; futuristic utopias and the question of what make a life good; the moral status of aliens and animals; intelligent robots and the relation between mind and body; parallel universes and the philosophical foundations of quantum physics.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/philosophy-through-science-fiction",
        "prereq_text": "",
        "prereqs": []
    },
    "humpl-45": {
        "id": "humpl-45",
        "course_id": "Hum/Pl 45",
        "name": "Ethics & AI",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "How do we reconcile the possibilities of modern machine learning with ethical and moral demands of fairness, accountability and transparency? This course will take a case study-based approach to the challenges at the interface of algorithms and human values. By exploring existing debates on algorithmic bias, explainable AI and data ownership, students will be exposed to the relevance of ethical systems of thought to modern social questions.",
        "offered": true,
        "instructors": "Eberhardt",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/ethics-&-ai",
        "prereq_text": "",
        "prereqs": []
    },
    "pl-89": {
        "id": "pl-89",
        "course_id": "Pl 89",
        "name": "Applied Ethics (Ethics Bowl)",
        "units": "3 units (3-0-0)",
        "terms": "first",
        "description": "",
        "offered": true,
        "instructors": "Gurcan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/applied-ethics-(ethics-bowl)",
        "prereq_text": "",
        "prereqs": []
    },
    "pl-90-ab": {
        "id": "pl-90-ab",
        "course_id": "Pl 90 ab",
        "name": "Senior Thesis",
        "units": "9 units (1-0-8)",
        "terms": "",
        "description": "Required of students taking the philosophy option. To be taken in any two consecutive terms of the senior year. Students will research and write a thesis of 10,000-12,000 words on a philosophical topic to be determined in consultation with their thesis adviser. Limited to students taking the philosophy option.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/senior-thesis",
        "prereq_text": "",
        "prereqs": []
    },
    "pl-98": {
        "id": "pl-98",
        "course_id": "Pl 98",
        "name": "Reading in Philosophy",
        "units": "9 units (1-0-8)",
        "terms": "",
        "description": "An individual program of directed reading in philosophy, in areas not covered by regular courses.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/reading-in-philosophy",
        "prereq_text": "Prerequisites: instructor's permission.",
        "prereqs": []
    },
    "pllaw-99": {
        "id": "pllaw-99",
        "course_id": "Pl/Law 99",
        "name": "Causation and Responsibility",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will examine the interrelationships between the concepts of causation, moral responsibility, and legal liability. It will consider legal doctrines of causation and responsibility, as well as attempts within philosophy to articulate these concepts. Questions to be addressed include: Can you be morally or legally responsible for harms that you do not cause? Is it worse to cause some harm, than to unsuccessfully attempt it? Is it justified to punish those who cause harm more severely than those who attempt harm? When, if ever, can the ends justify the means? What constitutes negligence? Is it worse to cause some harm, than to allow it to happen (when you could have prevented it)?\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Hitchcock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/causation-and-responsibility",
        "prereq_text": "",
        "prereqs": []
    },
    "pl-100": {
        "id": "pl-100",
        "course_id": "Pl 100",
        "name": "Free Will",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course examines the question of what it means to have free will, whether and why free will is desirable, and whether humans have free will. Topics may include historical discussions of free will from writers such as Aristotle, Boethius, and Hume; what it means for a scientific theory to be deterministic, and whether determinism is compatible with free will; the connection between free will and moral responsibility; the relationship between free will and the notion of the self; beliefs about free will; the psychology of decision making; and the insanity defense in law.",
        "offered": true,
        "instructors": "Hitchcock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/free-will",
        "prereq_text": "",
        "prereqs": []
    },
    "pl-102": {
        "id": "pl-102",
        "course_id": "Pl 102",
        "name": "Selected Topics in Philosophy",
        "units": "9 units (3-0-6)",
        "terms": "offered by announcement",
        "description": "",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/selected-topics-in-philosophy",
        "prereq_text": "Prerequisites: Hum/Pl 40 or Hum/Pl 41 or instructor’s permission.",
        "prereqs": []
    },
    "hpsplcs-110": {
        "id": "hpsplcs-110",
        "course_id": "HPS/Pl/CS 110",
        "name": "Causation and Explanation",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An examination of theories of causation and explanation in philosophy and neighboring disciplines. Topics discussed may include probabilistic and counterfactual treatments of causation, the role of statistical evidence and experimentation in causal inference, and the deductive-nomological model of explanation. The treatment of these topics by important figures from the history of philosophy such as Aristotle, Descartes, and Hume may also be considered.",
        "offered": true,
        "instructors": "Eberhardt",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/causation-and-explanation",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-120": {
        "id": "hpspl-120",
        "course_id": "HPS/Pl 120",
        "name": "Introduction to Philosophy of Science",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An introduction to fundamental philosophical problems concerning the nature of science. Topics may include the character of scientific explanation, criteria for the conformation and falsification of scientific theories, the relationship between theory and observation, philosophical accounts of the concept of \"law of nature,\" causation, chance, realism about unobservable entities, the objectivity of science, and issues having to do with the ways in which scientific knowledge changes over time.",
        "offered": true,
        "instructors": "McKenna",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/introduction-to-philosophy-of-science",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-122": {
        "id": "hpspl-122",
        "course_id": "HPS/Pl 122",
        "name": "Probability, Evidence, and Belief",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Philosophical and conceptual issues arising from the study of probability theory and how it relates to rationality and belief. Topics discussed may include the foundations and interpretations of probability, arguments for and against the view that we ought to have personal degrees of belief, rational change in beliefs over time, and the relationship between probability and traditional epistemological topics like evidence, justification, and knowledge.",
        "offered": true,
        "instructors": "Hitchcock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/probability,-evidence,-and-belief",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-123": {
        "id": "hpspl-123",
        "course_id": "HPS/Pl 123",
        "name": "Introduction to the Philosophy of Physics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course will examine the philosophical foundations of the physical theories covered in the first-year physics sequence: classical mechanics, electromagnetism, and special relativity. Topics may include: the goals of physics; what laws of nature are; the unification of physical theories; symmetries; determinism; locality; the reality of fields; the arrow of time.",
        "offered": true,
        "instructors": "Sebens",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/introduction-to-the-philosophy-of-physics",
        "prereq_text": "Prerequisites: Ph 1 abc or instructor's permission.",
        "prereqs": [
            "ph-1-abc"
        ]
    },
    "hpspl-124": {
        "id": "hpspl-124",
        "course_id": "HPS/Pl 124",
        "name": "Philosophy of Space and Time",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will focus on questions about the nature of space and time, particularly as they arise in connection with physical theory. Topics may include the nature and existence of space, time, and motion; the relationship between geometry and physical space (or space-time); entropy and the direction of time; the nature of simultaneity; and the possibility of time travel.",
        "offered": true,
        "instructors": "Hitchcock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/philosophy-of-space-and-time",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-125": {
        "id": "hpspl-125",
        "course_id": "HPS/Pl 125",
        "name": "Philosophical Issues in Quantum Physics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course will focus on philosophical and foundational questions raised by quantum physics. Questions may include: Is quantum mechanics a local theory? Is the theory deterministic or indeterministic? What is the role of measurement and observation? Does the wave function always obey the Schrödinger equation? Does the wave function give a complete description of the state of a system? Are there parallel universes? How are we to understand quantum probabilities?",
        "offered": true,
        "instructors": "Sebens",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/philosophical-issues-in-quantum-physics",
        "prereq_text": "Prerequisites: Ph 2 b, Ph 12 b, or Ch 21 a.",
        "prereqs": [
            "ph-2-abc",
            "ph-12-abc"
        ]
    },
    "hpspl-128": {
        "id": "hpspl-128",
        "course_id": "HPS/Pl 128",
        "name": "Philosophy of Mathematics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An examination of conceptual issues that arise in mathematics. The sorts of issues addressed may include the following: Are mathematical objects such as numbers in some sense real? How do we obtain knowledge of the mathematical world? Are proofs the only legitimate source of mathematical knowledge? What is the relationship between mathematics and the world? How is it possible to apply abstract theory to the world? Views of major historical figures such as Plato, Hume, Kant, and Mill, as well as of contemporary writers are examined. The course will also examine philosophical issues that arise in particular areas of mathematics such as probability theory and geometry.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Hitchcock",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/philosophy-of-mathematics",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-135": {
        "id": "hpspl-135",
        "course_id": "HPS/Pl 135",
        "name": "The Moral Brain",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will critically examine attempts to understand moral judgment and behavior from the perspective of neuroscience and controversies surrounding its implications for moral philosophy. Starting from an evolutionary perspective, we will investigate the search for moral precursors in non-human primates and the evolutionary innovations in cognitive, emotional, and motivational mechanisms purported to underlie human morality. From there, we will investigate controversies regarding this emerging \"neuroethics\" for debates in moral psychology and normative ethics, including the role of reason, desire, and the self in normative theory and whether neuroscience can play any role in adjudicating among competing theories of normative ethics.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Quartz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/the-moral-brain",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-136": {
        "id": "hpspl-136",
        "course_id": "HPS/Pl 136",
        "name": "Happiness and the Good Life",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course will critically examine the emerging science of happiness and positive psychology, its philosophical assumptions, methodology, and its role in framing social policy and practice. Topics to be addressed include: the relation between happiness as subjective well-being or life satisfaction and philosophical visions of the good life; the relation between happiness and virtue; the causes of happiness and the role of life experience; happiness and economic notions of human welfare, attempts to measure happiness, and the prospect for an economics of happiness; happiness as a brain state and whether brain science can illuminate the nature of happiness; mental illness and psychiatry in light of positive psychology.",
        "offered": true,
        "instructors": "Quartz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/happiness-and-the-good-life",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-138": {
        "id": "hpspl-138",
        "course_id": "HPS/Pl 138",
        "name": "Human Nature and Society",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course will investigate how assumptions about human nature shape political philosophy, social institutions, and social policy. The course will begin with a historical perspective, examining the work of such political philosophers as Plato, Locke, Rousseau, and Marx, along with such psychologists as Freud and Skinner. Against this historical perspective, it will then turn to examine contemporary views on human nature from cognitive neuroscience and evolutionary psychology and explore their potential implications for political philosophy and social policy. Among topics to be discussed will be the nature of human sociality and cooperation; economic systems and assumptions regarding production and consumption; and propaganda, marketing, and manipulation.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Quartz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/human-nature-and-society",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-139": {
        "id": "hpspl-139",
        "course_id": "HPS/Pl 139",
        "name": "Human Nature, Welfare, & Sustainability",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Policy makers since at least the time of Jeremy Bentham have argued that welfare maximization ought to be the goal of social policy. When this includes perfectionist notions of realizing one's capacities, economic prosperity, prosocial norms, and democratization have all coincided as key drivers of human development. Although the UN 2030 Agenda for Sustainable Development envisions worldwide inclusive and sustainable economic growth, there is substantial debate regarding the extent to which sustainability and economic growth are compatible. This course will critically examine the links between human welfare, economic growth, and material culture to better understand why economic growth and welfare have been taken to be intertwined - and the extent to which they could be decoupled. Our starting point will be the Brundtland report, its conception of welfare based on human needs, and subsequent articulations of needs-based theories of human welfare, including evolutionary and biological accounts that include social comparison processes such as esteem, status, and recognition. This will provide us with a theoretical framework for investigating the role of material culture in satisfying these needs and whether they may be satisfied by less resource-intense routes.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Quartz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/human-nature,-welfare,-&-sustainability",
        "prereq_text": "",
        "prereqs": []
    },
    "hpspl-165": {
        "id": "hpspl-165",
        "course_id": "HPS/Pl 165",
        "name": "Selected Topics in Philosophy of Science",
        "units": "9 units (3-0-6)",
        "terms": "offered by announcement",
        "description": "",
        "offered": true,
        "instructors": "Staff, visiting lecturers",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/selected-topics-in-philosophy-of-science",
        "prereq_text": "",
        "prereqs": []
    },
    "plcnsnbbipsy-167": {
        "id": "plcnsnbbipsy-167",
        "course_id": "Pl/CNS/NB/Bi/Psy 167",
        "name": "Consciousness",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "One of the last great challenges to our understanding of the world concerns conscious experience. What exactly is it? How is it caused or constituted? And how does it connect with the rest of our science? This course will cover philosophy of mind, cognitive psychology, and cognitive neuroscience in a mixture of lectures and in-class discussion. There are no formal pre-requisites, but background in philosophy (equivalent to Pl 41, Pl 110) and in neuroscience (equivalent to NB/Bi/CNS 150) is strongly recommended and students with such background will be preferentially considered. Limited to 20.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/consciousness",
        "prereq_text": "Prerequisites: None, but strongly suggest prior background in philosophy of mind and basic neurobiology (such as Bi 150).",
        "prereqs": []
    },
    "plhps-183": {
        "id": "plhps-183",
        "course_id": "Pl/HPS 183",
        "name": "Bioethics",
        "units": "9 units (3-0-6)",
        "terms": "first, third terms",
        "description": "",
        "offered": true,
        "instructors": "Gurcan, Helou",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/bioethics",
        "prereq_text": "",
        "prereqs": []
    },
    "pl-185": {
        "id": "pl-185",
        "course_id": "Pl 185",
        "name": "Moral Philosophy",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "A survey of topics in moral philosophy. The emphasis will be on metaethical issues, although some normative questions may be addressed. Metaethical topics that may be covered include the fact/value distinction; the nature of right and wrong (consequentialism, deontological theories, rights-based ethical theories, virtue ethics); the status of moral judgments (cognitivism vs. noncognitivism, realism vs. irrealism); morality and psychology; moral relativism; moral skepticism; morality and self-interest; the nature of justice. The implications of these theories for various practical moral problems may also be considered.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/pl/moral-philosophy",
        "prereq_text": "",
        "prereqs": []
    }
}