{
    "ps-12": {
        "id": "ps-12",
        "course_id": "PS 12",
        "name": "Introduction to Political Science",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "Introduction to the tools and concepts of analytical political science. Subject matter is primarily American political processes and institutions. Topics: spatial models of voting, redistributive voting, games, presidential campaign strategy, Congress, congressional-bureaucratic relations, and coverage of political issues by the mass media.",
        "offered": true,
        "instructors": "Hirsch, Kiewiet",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/introduction-to-political-science",
        "prereq_text": "",
        "prereqs": []
    },
    "ps-20": {
        "id": "ps-20",
        "course_id": "PS 20",
        "name": "Political-Economic Development and Material Culture",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "During the 19th-century the American economy, despite the Civil War, caught up to and surpassed all European economies. How did the likes of Singer, John Deere and Seth Thomas - latecomers to the markets they served-come to dominate those markets both domestically and internationally? Why did the technology of interchangeable parts and mass production become known as 'the American system' when much of that technology was imported from Europe? What role did government play in facilitating or thwarting innovation and economic growth? This course will explore such questions as reflected in the ordinary things people collect under the label 'antiques'. What do we learn from the fact that we can document a half dozen American manufacturers of apple peelers but not a single comparable European company? Why is the hand sewn quilt a nearly unique American folk art form and what does the evolution of quilting patterns tell us about technology and economic prosperity? What do baking powder cans as a category of collectible tell us about the politics of federal versus state regulation? Students will be expected to each choose a topic that asks such questions and to explore possible answers, all with an eye to understanding the interplay of economics, politics, and demography.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/political-economic-development-and-material-culture",
        "prereq_text": "",
        "prereqs": []
    },
    "ps-97": {
        "id": "ps-97",
        "course_id": "PS 97",
        "name": "Undergraduate Research",
        "units": "",
        "terms": "any term",
        "description": "This course offers advanced undergraduates the opportunity to pursue research in political science individually or in a small group. Graded pass/fail.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/undergraduate-research",
        "prereq_text": "Prerequisites: advanced political science and instructor's permission.",
        "prereqs": []
    },
    "ps-99-ab": {
        "id": "ps-99-ab",
        "course_id": "PS 99 ab",
        "name": "Political Science Research Seminar",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "Development and presentation of a major research paper on a topic of interest in political science or political economy. The project will be one that the student has initiated in a political science course they have already taken from the PS courses required for the PS option, numbered above 101. This course will be devoted to understanding research in political science, and basic political science methodology. Students will be exposed to current research journals, work to understand a research literature of interest, and work to formulate a research project. Fulfills the Institute scientific writing requirement.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/political-science-research-seminar",
        "prereq_text": "Prerequisites: political science major; completion of a required PS course for major.",
        "prereqs": []
    },
    "ps-101": {
        "id": "ps-101",
        "course_id": "PS 101",
        "name": "Selected Topics in Political Science",
        "units": "",
        "terms": "offered by announcement",
        "description": "",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/selected-topics-in-political-science",
        "prereq_text": "",
        "prereqs": []
    },
    "ps-120": {
        "id": "ps-120",
        "course_id": "PS 120",
        "name": "American Electoral Behavior and Party Strategy",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "A consideration of existing literature on the voting behavior of the citizen, and an examination of theoretical and empirical views of the strategies followed by the parties. Two substantial papers are expected of students.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/american-electoral-behavior-and-party-strategy",
        "prereq_text": "",
        "prereqs": []
    },
    "ps-121": {
        "id": "ps-121",
        "course_id": "PS 121",
        "name": "Analyzing Congress",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Introduction to the US Congress with an emphasis on thinking analytically and empirically about the determinants of Congressional behavior. Among the factors examined are the characteristics and incentives of legislators, rules governing the legislative process and internal organization, separation of powers, political parties, Congressional elections, and interest group influence.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/analyzing-congress",
        "prereq_text": "",
        "prereqs": []
    },
    "ps-122": {
        "id": "ps-122",
        "course_id": "PS 122",
        "name": "Political Representation",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Why does the U.S. Constitution feature separation of powers and protect states' rights? Should the Senate have a filibuster? When can Congress agree on the best policy for the country (and what does \"best\" even mean)? This course uses a rigorous set of tools including game theory and social choice to help students understand the effectiveness of American democracy to represent diverse interests. Using the tools, we study U.S. electoral systems, Congress, federalism, and the courts, with a focus on understanding how the country has tried to overcome the challenges of group decision making and the inevitable conflicts that arise between the branches of government and divided political interests. Students will leave the course with a deeper understanding of how rules and strategy shape U.S. democracy.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/political-representation",
        "prereq_text": "Prerequisites: PS 12.",
        "prereqs": []
    },
    "ps-123": {
        "id": "ps-123",
        "course_id": "PS 123",
        "name": "Regulation and Politics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will examine the historical origins of several regulatory agencies and trace their development over the past century or so. It will also investigate a number of current issues in regulatory politics, including the great discrepancies that exist in the cost-effectiveness of different regulations, and the advent of more market-based approaches to regulations instead of traditional \"command-and-control.\" Not offered on a pass/fail basis.",
        "offered": false,
        "instructors": "Kiewiet",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/regulation-and-politics",
        "prereq_text": "Prerequisites: PS 12.",
        "prereqs": []
    },
    "ecps-124": {
        "id": "ecps-124",
        "course_id": "Ec/PS 124",
        "name": "Identification Problems in the Social Sciences",
        "units": "9 units (3- 0-6)",
        "terms": "second term",
        "description": "Statistical inference in the social sciences is a difficult enterprise whereby we combine data and assumptions to draw conclusions about the world we live in. We then make decisions, for better or for worse, based on these conclusions. A simultaneously intoxicating and sobering thought! Strong assumptions about the data generating process can lead to strong but often less than credible (perhaps incredible?) conclusions about our world. Weaker assumptions can lead to weaker but more credible conclusions. This course explores the range of inferences that are possible when we entertain a range of assumptions about how data is generated. We explore these ideas in the context of a number of applications of interest to social scientists.",
        "offered": true,
        "instructors": "Sherman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/identification-problems-in-the-social-sciences",
        "prereq_text": "Prerequisites: Ec 122.",
        "prereqs": []
    },
    "ps-125": {
        "id": "ps-125",
        "course_id": "PS 125",
        "name": "Analyzing Political Conflict and Violence",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course examines the causes of and solutions for conflict and violence: Why do wars occur and how do we stop them? We cover topics such as terrorism, ethnic violence, civil wars, the Israeli-Palestinian conflict, repression, revolutions, and inter-state wars. We study these phenomena using the rational choice framework and modern tools in data analysis. The goals of the class are to explain conflicts and their terminations as outcomes of strategic decision-making and to understand the empirical strengths and weakness of current explanations.",
        "offered": true,
        "instructors": "Gibilisco",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/analyzing-political-conflict-and-violence",
        "prereq_text": "",
        "prereqs": []
    },
    "idsecps-126": {
        "id": "idsecps-126",
        "course_id": "IDS/Ec/PS 126",
        "name": "Applied Data Analysis",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Fundamentally, this course is about making arguments with numbers and data. Data analysis for its own sake is often quite boring, but becomes crucial when it supports claims about the world. A convincing data analysis starts with the collection and cleaning of data, a thoughtful and reproducible statistical analysis of it, and the graphical presentation of the results. This course will provide students with the necessary practical skills, chiefly revolving around statistical computing, to conduct their own data analysis. This course is not an introduction to statistics or computer science. I assume that students are familiar with at least basic probability and statistical concepts up to and including regression.",
        "offered": true,
        "instructors": "Katz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/applied-data-analysis",
        "prereq_text": "Prerequisites: Ma 3/103 or ACM/EE/IDS 116, Ec 122 or IDS/ACM/CS 157 or Ma 112 a.",
        "prereqs": [
            "acmeeids-116",
            "idsacmcs-157",
            "ma-112-ab",
            "ma-3103"
        ]
    },
    "anps-127": {
        "id": "anps-127",
        "course_id": "An/PS 127",
        "name": "Corruption",
        "units": "9 units (3-0-6)",
        "terms": "first, second terms",
        "description": "Corruption taxes economies and individuals in both the developing and the developed world. We will examine what corruption means in different places and contexts, from grand financial scandals to misappropriation of all manner of public resources. How do we measure corruption? What are its costs and social consequences? What have culture and psychology got to do with it? How much do governance and a free press matter? What are the potential solutions? Students will work closely with the professor to develop an independent and original research project of their choice. Limited enrollment.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/corruption",
        "prereq_text": "Prerequisites: AN 14 or PS 12.",
        "prereqs": []
    },
    "psec-128": {
        "id": "psec-128",
        "course_id": "PS/Ec 128",
        "name": "Introduction to Public Health Economics and Policy",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will cover the basic concepts and principles of health economics and challenges in health policy implementation. By studying this course, students will establish economic thinking and be able to flexibly use economic methods to analyze practical problems in the field of health care. Students will also learn about the application of machine learning in public health. This course combines theory and methodology. The teaching goal focuses on students' ability to analyze and solve practical problems. Interactive teaching is done through group discussions and topic debates around case studies. Each chapter consists of a theory and case analysis. The case discussion will focus on basic theories and methods and highlight the hot issues in the current medical and health system. The exam will be an open-book exam, with class discussions accounting for 40%, and the final exam accounting for 60%.",
        "offered": true,
        "instructors": "Cao",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/introduction-to-public-health-economics-and-policy",
        "prereq_text": "",
        "prereqs": []
    },
    "ps-132": {
        "id": "ps-132",
        "course_id": "PS 132",
        "name": "Formal Theories in Political Science",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Axiomatic structure and behavioral interpretations of game theoretic and social choice models and models of political processes based on them.",
        "offered": true,
        "instructors": "Agranov",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/formal-theories-in-political-science",
        "prereq_text": "Prerequisites: PS 12 and PS/Ec 172.",
        "prereqs": []
    },
    "ps-135": {
        "id": "ps-135",
        "course_id": "PS 135",
        "name": "Analyzing Legislative Elections",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "The purpose of this course is to understand legislative elections. The course will study, for example, what role money plays in elections and why incumbents do better at the polls. It will also examine how electoral rules impact the behavior both of candidates and voters, and will explore some of the consequences of legislative elections, such as divided government.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/analyzing-legislative-elections",
        "prereq_text": "",
        "prereqs": []
    },
    "ps-139": {
        "id": "ps-139",
        "course_id": "PS 139",
        "name": "Comparative Politics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course offers a broad introduction to the theoretical and empirical research in comparative political economy. An emphasis will be placed on the parallel process of political and economic development and its consequences on current democratic political institutions such as: electoral rules, party systems, parliamentary versus presidential governments, legislatures, judicial systems, and bureaucratic agencies as exemplified in central bank politics. We will study the differential impact of these political institutions on the type of policies they implement and the economic outcomes they produce. The main objective of the course will be to assess the robustness of the analyzed theories in light of their empirical support, coming mainly from statistical analysis.",
        "offered": true,
        "instructors": "Lopez-Moctezuma",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/comparative-politics",
        "prereq_text": "Prerequisites: PS 12.",
        "prereqs": []
    },
    "ps-141-ab": {
        "id": "ps-141-ab",
        "course_id": "PS 141 ab",
        "name": "A History of Budgetary Politics in the United States",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "This class will examine budgetary conflict at key junctures in U.S. history. Topics include the struggle to establish a viable fiscal system in the early days of the Republic, the ante bellum tariff, the \"pension politics\" of the post-Civil War era, the growth of the American welfare state, and the battle over tax and entitlement reform in the 1980s and 1990s.",
        "offered": true,
        "instructors": "Kiewiet",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/a-history-of-budgetary-politics-in-the-united-states",
        "prereq_text": "",
        "prereqs": []
    },
    "psec-172": {
        "id": "psec-172",
        "course_id": "PS/Ec 172",
        "name": "Game Theory",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course is an introduction to non-cooperative game theory, with applications to political science and economics. It covers the theories of normal-form games and extensive-form games, and introduces solutions concepts that are relevant for situations of complete and incomplete information. The basic theory of repeated games is introduced. Applications are to auction theory and asymmetric information in trading models, cheap talk and voting rules in congress, among many others.",
        "offered": true,
        "instructors": "Pomatto",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ps/game-theory",
        "prereq_text": "Prerequisites: Ec 11 or PS 12 and one from the following list: ACM 116, ACM 117, Ma 3, or Ma/ACM/IDS 140 ab.",
        "prereqs": [
            "maacmids-140-abc",
            "ma-3103",
            "cmsacm-117"
        ]
    }
}