{
    "psy-13": {
        "id": "psy-13",
        "course_id": "Psy 13",
        "name": "Introduction to Cognitive Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course will provide an introduction to what we know about the fascinating link between the brain, the mind, and behavior. We will start with a basic review of the brain as a biological organ, its evolution, development, and its basic operations including visual and others' senses. Next, we will discuss how the brain gives rise to a wide variety of complex behaviors, memory, social and emotional behaviors. The course will finally introduce students to the wider neurophilosophical questions concerning freewill, death and morality.",
        "offered": true,
        "instructors": "Kahn",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/introduction-to-cognitive-neuroscience",
        "prereq_text": "",
        "prereqs": []
    },
    "psy-25": {
        "id": "psy-25",
        "course_id": "Psy 25",
        "name": "Reading and Research in Psychology",
        "units": "",
        "terms": "",
        "description": "Not available for credit toward humanities-social science requirement. Written report required. Graded pass/fail.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/reading-and-research-in-psychology",
        "prereq_text": "",
        "prereqs": []
    },
    "psy-101": {
        "id": "psy-101",
        "course_id": "Psy 101",
        "name": "Selected Topics in Psychology",
        "units": "",
        "terms": "offered by announcement",
        "description": "",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/selected-topics-in-psychology",
        "prereq_text": "",
        "prereqs": []
    },
    "cnspsybi-102-a": {
        "id": "cnspsybi-102-a",
        "course_id": "CNS/Psy/Bi 102 a",
        "name": "Social and Decision Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Introduction to the computations made by the brain during economic and social decision making and their neural substrates. Part a: Introduction to social and decision neuroscience. Neural substrates of reward and reinforcement learning. Unconscious and conscious processing. The neural basis of emotion. Goal-directed and habit learning. The neural substrates of facial processing.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/social-and-decision-neuroscience",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 and CNS/Bi/Ph/CS/NB 187, or instructor's permission.",
        "prereqs": []
    },
    "cnspsybi-102-b": {
        "id": "cnspsybi-102-b",
        "course_id": "CNS/Psy/Bi 102 b",
        "name": "Social and Decision Neuroscience",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Introduction to the computations made by the brain during economic and social decision making and their neural substrates. Part b: History and mechanisms of reinforcement. Memory and valuation. Neural repurposing. Mentalizing and strategic thinking. Neural bases of prosociality, risky choice and delay discounting. Mathematical economic-style theories of neural circuits.",
        "offered": true,
        "instructors": "Camerer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/social-and-decision-neuroscience",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 and CNS/Bi/Ph/CS/NB 187, or instructor's permission.",
        "prereqs": []
    },
    "psycns-105-ab": {
        "id": "psycns-105-ab",
        "course_id": "Psy/CNS 105 ab",
        "name": "Frontiers in Neuroeconomics",
        "units": "5 units (1.5-0-3.5)",
        "terms": "first and second terms",
        "description": "The new discipline of Neuroeconomics seeks to understand the mechanisms underlying human choice behavior, born out of a confluence of approaches derived from Psychology, Neuroscience and Economics. This seminar will consider a variety of emerging themes in this new field. Some of the topics we will address include the neural bases of reward and motivation, the neural representation of utility and risk, neural systems for inter-temporal choice, goals vs habits, and strategic interactions. We will also spend time evaluating various forms of computational and theoretical models that underpin the field such as reinforcement-learning, Bayesian models and race to barrier models. Each week we will focus on key papers and/or book chapters illustrating the relevant concepts.",
        "offered": true,
        "instructors": "O'Doherty",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/frontiers-in-neuroeconomics",
        "prereq_text": "",
        "prereqs": []
    },
    "ecpsy-106": {
        "id": "ecpsy-106",
        "course_id": "Ec/Psy 106",
        "name": "Behavioral Game Theory",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "In this course we will examine game theories that are explicitly meant to describe behavior of humans and other species. Prominent models are those with level-k hierarchies, quantal response equilibrium (QRE) and cursed equilibrium. Most of the data is experimental evidence from a wide variety of games. We will also learn about field evidence, mostly about mixed strategies and application of level-k hierarchies to firms' decisions. Data include biological measures such as response times, eye-tracking, fMRI and evidence from psychiatric disorders. Students are expected to replicate an existing experiment (individual students) or work in small teams to create and run a new experiment.",
        "offered": true,
        "instructors": "Camerer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/behavioral-game-theory",
        "prereq_text": "Prerequisites: PS/Ec 172.",
        "prereqs": []
    },
    "ecpsy-108": {
        "id": "ecpsy-108",
        "course_id": "Ec/Psy 108",
        "name": "Foundations of Behavioral Economics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Sprenger",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/foundations-of-behavioral-economics",
        "prereq_text": "",
        "prereqs": []
    },
    "ecpsy-109": {
        "id": "ecpsy-109",
        "course_id": "Ec/Psy 109",
        "name": "Frontiers in Behavioral Economics",
        "units": "9 units (3-0-6)",
        "terms": "",
        "description": "This course will study topics in behavioral economics demonstrating departures from the classic economics assumptions of rationality and pure self-interest. We will study evidence of these departures, models that have been designed to capture these preferences, and applications of these models to important economic questions. Topics will include biases and heuristics, risk preferences, self-control, strategic uncertainty, and social preferences, among others. The course will be based in readings from both classic and modern research. Methodologically, the course will combine both theoretical and empirical evidence of the mentioned above topics.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/frontiers-in-behavioral-economics",
        "prereq_text": "Prerequisites: Ec 11.",
        "prereqs": []
    },
    "psy-115": {
        "id": "psy-115",
        "course_id": "Psy 115",
        "name": "Social Psychology",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "The study of how people think about other people and behave toward or around others. Topics include social cognition and emotions (theory of mind and empathy), their development from childhood to old age, impairments in social functions, altruism and cooperation, social groups (ingroup and outgroup), attribution and stereotypes. The class also presents evidence on how these social phenomena are implemented in the human brain and introduces behavioral and neuroscientific methods used in social psychology and social neuroscience.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/social-psychology",
        "prereq_text": "",
        "prereqs": []
    },
    "psy-120": {
        "id": "psy-120",
        "course_id": "Psy 120",
        "name": "Metascience: The Science of Being An Impactful Scientist",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will provide the student with a unique insight into the skills used by successful scientists in the social sciences, with the focus being on psychology and cognitive neuroscience (although this is interesting for any type of science career). The course promotes active (hands on) learning, to enhance skills such as creative idea formation, theory, science communication including presentation and writing skills for the public. The class will also provide discussion on practices and expert opinions on what departments looks for when recruiting students and hiring faculty. Enrollment limited to 14 students.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/metascience:-the-science-of-being-an-impactful-scientist",
        "prereq_text": "Prerequisites: There are no prerequisites, but having taken NB/Bi/CNS 150 would be advantageous.",
        "prereqs": []
    },
    "psy-125": {
        "id": "psy-125",
        "course_id": "Psy 125",
        "name": "Reading and Research in Psychology",
        "units": "",
        "terms": "",
        "description": "Same as Psy 25, but for graduate credit. Not available for credit toward humanities-social science requirement.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/reading-and-research-in-psychology",
        "prereq_text": "",
        "prereqs": []
    },
    "psycns-130": {
        "id": "psycns-130",
        "course_id": "Psy/CNS 130",
        "name": "Introduction to Human Memory",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "The course offers an overview of experimental findings and theoretical issues in the study of human memory. Topics include iconic and echoic memory, working memory, spatial memory, implicit learning and memory; forgetting: facts vs. skills, memory for faces; retrieval: recall vs. recognition, context-dependent memory, semantic memory, spreading activation models and connectionist networks, memory and emotion, infantile amnesia, memory development, and amnesia.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/introduction-to-human-memory",
        "prereq_text": "",
        "prereqs": []
    },
    "psycns-132": {
        "id": "psycns-132",
        "course_id": "Psy/CNS 132",
        "name": "Computational Reinforcement-learning in Biological and Non-biological Systems",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Reinforcement-learning concerns the computational principles by which animals and artificial agents can learn to select actions in their environment in order to maximize their future rewards. Over the past 50 years there has been a rich interplay between the development and application of reinforcement-learning models in artificial intelligence, and the investigation of reinforcement-learning in biological systems, including humans. This course will review this rich literature, covering the psychology of animal-learning, the neurobiology of reward and reinforcement, and the theoretical basis and application of reinforcement-learning models to biological and non-biological systems.",
        "offered": true,
        "instructors": "O'Doherty",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/computational-reinforcement-learning-in-biological-and-non-biological-systems",
        "prereq_text": "",
        "prereqs": []
    },
    "psy-133": {
        "id": "psy-133",
        "course_id": "Psy 133",
        "name": "Computation, Cognition and Consciousness",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will critically examine the impact of recent advances in computational neuroscience for central problems of philosophy of mind. Beginning with a historical overview of computationalism (the thesis that mental states are computational states), the course will examine how psychological explanation may be understood in computational terms across a variety of levels of description, from sub-neuronal and single neuroncomputation to circuit and network levels. Specific issues will include: whether computation provides unifying psychological principles across species; whether specific mental states such as pain are computational states; digital/analog computation, dynamical systems, and mental representation; whether conscious experience can be understood as a computational process.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/computation,-cognition-and-consciousness",
        "prereq_text": "",
        "prereqs": []
    },
    "plcnsnbbipsy-167": {
        "id": "plcnsnbbipsy-167",
        "course_id": "Pl/CNS/NB/Bi/Psy 167",
        "name": "Consciousness",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "One of the last great challenges to our understanding of the world concerns conscious experience. What exactly is it? How is it caused or constituted? And how does it connect with the rest of our science? This course will cover philosophy of mind, cognitive psychology, and cognitive neuroscience in a mixture of lectures and in-class discussion. There are no formal pre-requisites, but background in philosophy (equivalent to Pl 41, Pl 110) and in neuroscience (equivalent to NB/Bi/CNS 150) is strongly recommended and students with such background will be preferentially considered. Limited to 20.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/consciousness",
        "prereq_text": "Prerequisites: None, but strongly suggest prior background in philosophy of mind and basic neurobiology (such as Bi 150).",
        "prereqs": []
    },
    "cnsbipsynb-176": {
        "id": "cnsbipsynb-176",
        "course_id": "CNS/Bi/Psy/NB 176",
        "name": "Cognition",
        "units": "9 units (4-0-5)",
        "terms": "Third term",
        "description": "The cornerstone of current progress in understanding the mind, the brain, and the relationship between the two is the study of human and animal cognition. This course will provide an in-depth survey and analysis of behavioral observations, theoretical accounts, computational models, patient data, electrophysiological studies, and brain-imaging results on mental capacities such as attention, memory, emotion, object representation, language, and cognitive development.\n Given in alternate years; offered 2024-25.",
        "offered": true,
        "instructors": "Shimojo",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/cognition",
        "prereq_text": "",
        "prereqs": []
    },
    "psybicns-255": {
        "id": "psybicns-255",
        "course_id": "Psy/Bi/CNS 255",
        "name": "Topics in Emotion and Social Cognition",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Emotions are at the forefront of most human endeavors. Emotions aid us in decision-making (gut feelings), help us remember, torment us, yet have ultimately helped us to survive. Over the past few decades, we have begun to characterize the neural systems that extend from primitive affective response such as fight or flight to the complex emotions experienced by humans including guilt, envy, empathy and social pain. This course will begin with an in-depth examination of the neurobiological systems that underlie negative and positive emotions and move onto weekly discussions, based on assigned journal articles that highlight both rudimentary and complex emotions. The final weeks will be devoted to exploring how the neurobiological systems are disrupted in affective disorders including anxiety, aggression and psychopathy. In addition to these discussions and readings, each student will be required to write a review paper or produce a short movie on a topic related to one of the emotions discussed in these seminars and its underlying neural mechanisms.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/topics-in-emotion-and-social-cognition",
        "prereq_text": "Prerequisites: NB/Bi/CNS 150 or instructor's permission.",
        "prereqs": []
    },
    "psy-283-abc": {
        "id": "psy-283-abc",
        "course_id": "Psy 283 abc",
        "name": "Graduate Proseminar in Social and Decision Neuroscience",
        "units": "3 units (1.5-0-1.5)",
        "terms": "first, second, third terms",
        "description": "The course involves student presentations of their research, reading and discussion of recent research in social and decision neuroscience, and development of professional skill such as scientific writing and speaking, research ethics, writing grants and peer review. This course is only open to graduate students in the Social and Decision Neuroscience, Computational and Neural Systems and Social Science PhD programs.",
        "offered": true,
        "instructors": "Camerer, Rangel, O'Doherty",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/graduate-proseminar-in-social-and-decision-neuroscience",
        "prereq_text": "",
        "prereqs": []
    },
    "sspsycns-285": {
        "id": "sspsycns-285",
        "course_id": "SS/Psy/CNS 285",
        "name": "Topics in Social, Cognitive, and Decision Sciences",
        "units": "3 units (1.5-0-1.5)",
        "terms": "second term",
        "description": "The goal of this course is to introduce graduate students to current research questions in cognitive sciences, political science, and economics. Select faculty will present their research background, methods, and a sampling of current studies. Background readings and pdf of presentation will be provided.",
        "offered": true,
        "instructors": "Pomatto",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/psy/topics-in-social,-cognitive,-and-decision-sciences",
        "prereq_text": "",
        "prereqs": []
    }
}