{
    "ss-200": {
        "id": "ss-200",
        "course_id": "SS 200",
        "name": "Selected Topics in Social Science",
        "units": "",
        "terms": "offered by announcement",
        "description": "",
        "offered": true,
        "instructors": "Staff, visiting lecturers",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/selected-topics-in-social-science",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-201-abc": {
        "id": "ss-201-abc",
        "course_id": "SS 201 abc",
        "name": "Analytical Foundations of Social Science",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course covers the fundamentals of utility theory, game theory, and social choice theory, as well as some topics in experimental and behavioral economics. These basic theories are developed and illustrated with applications to electoral politics, market trading, bargaining, auctions, mechanism design and implementation, legislative and parliamentary voting and organization, public economics, industrial organization, and other topics in economics and political science. Open to Social Science graduate students only.\n Part a and b not offered 2024-25.",
        "offered": true,
        "instructors": "Sprenger/Camerer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/analytical-foundations-of-social-science",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-202-abc": {
        "id": "ss-202-abc",
        "course_id": "SS 202 abc",
        "name": "Political Theory",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Course will introduce the student to the central problems of political theory and analysis, beginning with the essential components of the democratic state and proceeding through a variety of empirical topics. These topics will include the analysis of electoral and legislative institutions, legislative agenda processes, voting behavior, comparative political economy, and cooperation and conflict in international politics. The student will be sensitized to the primary empirical problems of the discipline and trained in the most general applications of game theoretic reasoning to political science. Open to Social Science graduate students only.",
        "offered": true,
        "instructors": "Katz, Hirsch, Lopez-Moctezuma",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/political-theory",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-205-abc": {
        "id": "ss-205-abc",
        "course_id": "SS 205 abc",
        "name": "Foundations of Economics",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "This is a graduate course in the fundamentals of economics. Topics include comparative statics and maximization techniques, the neo-classical theory of consumption and production, general equilibrium theory and welfare economics, public goods and externalities, the economic consequences of asymmetric information and incomplete markets, and recursive methods with applications to labor eco-nomics and financial economics. Open to Social Science graduate students only.",
        "offered": true,
        "instructors": "Caradonna, Pomatto, Niemeyer",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/foundations-of-economics",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-209": {
        "id": "ss-209",
        "course_id": "SS 209",
        "name": "Behavioral Economics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course explores how psychological facts and constructs can be used to inform models of limits on rationality, willpower and greed, to expand the scope of economic analysis. Topics include overconfidence, heuristics for statistical judgment, loss-aversion, hyperbolic discounting, optimal firm behavior when consumers are limited in rationality, behavioral game theory, behavioral finance, neuroeconomic dual-self models, and legal and welfare implications of rationality limits.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/behavioral-economics",
        "prereq_text": "Prerequisites: SS 201 abc or instructor's permission.",
        "prereqs": []
    },
    "ss-210-abc": {
        "id": "ss-210-abc",
        "course_id": "SS 210 abc",
        "name": "Foundations of Political Economy",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Mathematical theories of individual and social choice applied to problems of welfare economics and political decision making as well as to the construction of political economic processes consistent with stipulated ethical postulates, political platform formulation, the theory of political coalitions, and decision making in political organizations.\n Part a and c not offered 2024-25.",
        "offered": true,
        "instructors": "Gibilisco",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/foundations-of-political-economy",
        "prereq_text": "Prerequisites: SS 202 c, SS 205 b.",
        "prereqs": []
    },
    "ss-211-abc": {
        "id": "ss-211-abc",
        "course_id": "SS 211 abc",
        "name": "Advanced Economic Theory",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "May be repeated for credit. Advanced work in a specialized area of economic theory, with topics varying from year to year according to the interests of students.",
        "offered": true,
        "instructors": "Niemeyer, Pomatto, Caradonna",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/advanced-economic-theory",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-212-abc": {
        "id": "ss-212-abc",
        "course_id": "SS 212 abc",
        "name": "Experimental Economics",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "This three-quarter sequence is designed for advanced Social Science Ph.D. students with the aim of introducing students to the methodology of modern experimental economics and to provide an in-depth overview of the contributions of experimental methods to a wide variety of fields. The specific topics covered, which will vary from year to year, include but are not limited to individual decision making, preference and belief elicitation, game theory, social learning, bargaining, labor economics, public finance, auctions, voting and elections, competitive markets, networks, matching, mechanism design, coordination/communication, and information aggregation. The focus will be on theory-based experiments and how the dialog between theoretical analysis and laboratory data feeds each other, thereby leading to new avenues of theoretical and experimental research.",
        "offered": true,
        "instructors": "Agranov, Nielsen, Sprenger",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/experimental-economics",
        "prereq_text": "Prerequisites: SS 201 abc, SS 202 abc, SS 205 abc, SS 222 abc or with permission of the instructor.",
        "prereqs": []
    },
    "ss-213-abc": {
        "id": "ss-213-abc",
        "course_id": "SS 213 abc",
        "name": "Financial Economics",
        "units": "9 units (3-2-4)",
        "terms": "first term",
        "description": "Mathematical finance: Pricing financial derivatives, risk management, and optimal portfolio selection. Methods of stochastic, Ito calculus for models driven by Brownian motion. Asset pricing theory: Mean-variance theory, information economics, continuous-time finance and differential equations, intertemporal consumption-based asset pricing theories, recent developments in intermediary-based and behavioral asset pricing theories. Behavioral finance: Empirical facts about asset prices, investor trading behavior, and firm behavior. Psychology about investor preferences and beliefs. Behavioral finance models that explain empirical facts. Trading strategies implemented by hedge funds. Prescriptive behavioral finance that aims at helping individuals and institutions to make better financial decisions.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/financial-economics",
        "prereq_text": "",
        "prereqs": []
    },
    "ssma-214": {
        "id": "ssma-214",
        "course_id": "SS/Ma 214",
        "name": "Mathematical Finance",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Cvitanic",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/mathematical-finance",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-218": {
        "id": "ss-218",
        "course_id": "SS 218",
        "name": "Neuroscience Applications to Economics and Politics",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "Topics in behavioral, affective, and social neuroscience that inform how individuals make economic decisions. Applications of neuroscience ideas and methods to understanding choice under risk and uncertainty, temporal discounting and self-control, advertisement and preference formation, habit, addiction, and judgment bias.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/neuroscience-applications-to-economics-and-politics",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-222-abc": {
        "id": "ss-222-abc",
        "course_id": "SS 222 abc",
        "name": "Econometrics",
        "units": "9 units (3-0-6)",
        "terms": "first, second, third terms",
        "description": "Introduction to the use of multivariate and nonlinear methods in the social sciences. Open to Social Science graduate students only.",
        "offered": true,
        "instructors": "Sherman, Xin, Sherman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/econometrics",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-223-abc": {
        "id": "ss-223-abc",
        "course_id": "SS 223 abc",
        "name": "Topics in Theoretical and Applied Econometrics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "The courses in this sequence cover advanced methods and tools in econometrics, as well as their applications to a variety of topics in economics, including industrial organization, dynamic choice, information economics, political economy, market design, and behavioral economics.\n Part a and b not offered 2024-25.",
        "offered": true,
        "instructors": "Xin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/topics-in-theoretical-and-applied-econometrics",
        "prereq_text": "Prerequisites: SS 222 abc; may be repeated for credit.",
        "prereqs": []
    },
    "ss-224": {
        "id": "ss-224",
        "course_id": "SS 224",
        "name": "Social Science Data",
        "units": "9 units (3-3-3)",
        "terms": "second term",
        "description": "This course provides broad coverage of empirical methods in the social sciences. This includes both methods of data collection and practical aspects of data analysis, as well as related issues of survey design, experimental design, techniques for handling large datasets, and issues specific to the collection and analysis of field and historical data. This course also provides students with hands-on experience with data. Open to Social Science graduate students only.",
        "offered": true,
        "instructors": "Alvarez",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/social-science-data",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-225": {
        "id": "ss-225",
        "course_id": "SS 225",
        "name": "Experimetrics",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course explores the interaction of experimental design and econometric inference in the laboratory approach to economic questions. The course critically evaluates existing experimental studies to highlight this interaction and motivate consideration of inferential strategies early in an experiments design. Methodological topics may include testing theories in two-by-two designs, power and optimal design, classifying subjects into canonical types, testing based on elicited preferences and beliefs, and challenges introduced by communication and dynamics in economic experiments.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/experimetrics",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-228-abc": {
        "id": "ss-228-abc",
        "course_id": "SS 228 abc",
        "name": "Applied Empirical Methods in the Social Sciences",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Course covers methods used in contemporary applied empirical work in a variety of social sciences. Topics covered include (a) maximum likelihood, Bayesian estimation, management and computation of large datasets, (b) reduced form methods like instrumental variables (IV), difference-in-differences (DID), natural experiments, event study and panel data methods, and (c) structural estimation. Emphasis is on the application of tools to substantive social science problems rather than statistical theory, in areas including political science, political economy, corporate finance, and accounting. Application focus will vary with instructor interests.\n Part a and b not offered 2024-25.",
        "offered": true,
        "instructors": "Lopez-Moctezuma",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/applied-empirical-methods-in-the-social-sciences",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-229-abc": {
        "id": "ss-229-abc",
        "course_id": "SS 229 abc",
        "name": "Theoretical and Quantitative Dimensions of Historical Development",
        "units": "9 units (3-0-6)",
        "terms": "second, third terms",
        "description": "May be repeated for credit. Introduction to modern quantitative history. The tools of economic and political theory applied to problems of economic, social, and political development in a historical context. Second and third terms will be graded together. A pass/fail will be assigned in the second term and then changed to the appropriate letter grade at the end of the third term.",
        "offered": true,
        "instructors": "Rosenthal, Janas",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/theoretical-and-quantitative-dimensions-of-historical-development",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-231-abc": {
        "id": "ss-231-abc",
        "course_id": "SS 231 abc",
        "name": "American and Comparative Politics",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "An advanced graduate Social Science sequence in American and comparative politics. The sequence will focus on political institutions and behavior, introducing students to the important theories of American and comparative politics. Students will learn how historical, observational, and experimental data are used in American and comparative political analysis.\n Section a offered by Katz; section b not offered 2024-25.",
        "offered": true,
        "instructors": "Katz",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/american-and-comparative-politics",
        "prereq_text": "Prerequisites: SS 202 abc, or permission of the instructor.",
        "prereqs": []
    },
    "ss-281": {
        "id": "ss-281",
        "course_id": "SS 281",
        "name": "Graduate Social Science Writing Seminar",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Only open to advanced graduate students in social science. How can social scientists write in a style that makes someone actually want to read their papers? This seminar combines writing exercises with help in planning a professional social science paper and with extensive comments on drafts.",
        "offered": true,
        "instructors": "Gibilisco",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/graduate-social-science-writing-seminar",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-282-abc": {
        "id": "ss-282-abc",
        "course_id": "SS 282 abc",
        "name": "Graduate Proseminar in Social Science",
        "units": "3 units (1.5-0-1.5)",
        "terms": "first, second, third terms",
        "description": "Course for graduate students in social sciences. Students present their research and lead discussion of material relevant to their research program. Open to Social Science Graduate Students only.",
        "offered": true,
        "instructors": "Nielsen, Nielsen/Janas, Janas",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/graduate-proseminar-in-social-science",
        "prereq_text": "",
        "prereqs": []
    },
    "sspsycns-285": {
        "id": "sspsycns-285",
        "course_id": "SS/Psy/CNS 285",
        "name": "Topics in Social, Cognitive, and Decision Sciences",
        "units": "3 units (1.5-0-1.5)",
        "terms": "second term",
        "description": "The goal of this course is to introduce graduate students to current research questions in cognitive sciences, political science, and economics. Select faculty will present their research background, methods, and a sampling of current studies. Background readings and pdf of presentation will be provided.",
        "offered": true,
        "instructors": "Pomatto",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/topics-in-social,-cognitive,-and-decision-sciences",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-299": {
        "id": "ss-299",
        "course_id": "SS 299",
        "name": "Writing",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Sherazi",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/writing",
        "prereq_text": "",
        "prereqs": []
    },
    "ss-300": {
        "id": "ss-300",
        "course_id": "SS 300",
        "name": "Research in Social Science",
        "units": "",
        "terms": "",
        "description": "",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/ss/research-in-social-science",
        "prereq_text": "",
        "prereqs": []
    }
}