{
    "humvc-48": {
        "id": "humvc-48",
        "course_id": "Hum/VC 48",
        "name": "Ways of Seeing",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "\"The knowledge of photography is just as important as that of the alphabet,\" wrote artist László Moholy-Nagy in 1928. \"The illiterate of the future,\" he warned, \"will be the person ignorant of the use of the camera as well as the pen.\" Almost a century later, this pronouncement rings as true as ever in a world so profoundly shaped not just by photography but also films, advertisements, and video games, cartoons and comics, molecular graphics and visual models. In this course we will explore how visual culture shapes our lives and daily experiences, and we will learn to find wonder in its rich details. In doing so, we will develop the visual literacy that Moholy-Nagy envisioned: essential skills in reading, analyzing, discussing, and writing about visual materials and their circulation through the physical and virtual networks that structure our world.",
        "offered": true,
        "instructors": "Jacobson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/ways-of-seeing",
        "prereq_text": "",
        "prereqs": []
    },
    "humvc-49": {
        "id": "humvc-49",
        "course_id": "Hum/VC 49",
        "name": "Seeing Race",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Stielau",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/seeing-race",
        "prereq_text": "",
        "prereqs": []
    },
    "humvc-50": {
        "id": "humvc-50",
        "course_id": "Hum/VC 50",
        "name": "Introduction to Film",
        "units": "9 units (3-0-6)",
        "terms": "first, third terms",
        "description": "This course examines the historical development of film as a popular art and entertainment medium from the 1880s to the present, with a focus on the American and European contexts. Students will learn how to watch a film - how to pay attention to significant visual details and to the ways films construct meaning from the language of images - and will develop the skills to write fluently about what they see. The course covers some of the most influential genres and movements from the earliest actuality films, through the French New Wave, to the Disney/Marvel Universe. Films covered may include short comedies from Charlie Chaplin and Buster Keaton,M,It Happened One Night,The Seven Samurai,The Battle of Algiers, andBlack Panther.",
        "offered": true,
        "instructors": "Jurca",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/introduction-to-film",
        "prereq_text": "",
        "prereqs": []
    },
    "humvc-51": {
        "id": "humvc-51",
        "course_id": "Hum/VC 51",
        "name": "Icons and Iconoclasm",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "How does something - an image, a person, a thing, an idea - become iconic? Drawing from the worlds of art and film, advertising and PR, science and technology, politics and propaganda, this course explores what makes certain people, places, and things \"icons.\" To do so, we will first deploy a range of methods for closely analyzing images as signs and symbols, including the practice art historians term \"iconology.\" We will then examine histories of how objects have circulated through culture - from newspapers and magazines to postcards, jpegs, and memes - and thereby become ubiquitous features of everyday experience. Finally, we will consider iconoclasm, the destruction of icons, and the beliefs and logics behind powerful interdictions against visual representation. Students will leave the course with a stronger understanding of image power as well as foundational tools of visual and media literacy.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Jacobson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/icons-and-iconoclasm",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-60": {
        "id": "vc-60",
        "course_id": "VC 60",
        "name": "Art/Media",
        "units": "",
        "terms": "offered by announcement",
        "description": "A practice-based course taught by a visiting artist in residence. See registrar's announcement for details.",
        "offered": true,
        "instructors": "",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/art/media",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-61": {
        "id": "vc-61",
        "course_id": "VC 61",
        "name": "Environmental Justice",
        "units": "6 units (2-0-4)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Mushkin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/environmental-justice",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-70": {
        "id": "vc-70",
        "course_id": "VC 70",
        "name": "Traditions of Japanese Art",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "An introduction to the great traditions of Japanese art from prehistory through the Meiji Restoration (1868-1912). Students will examine major achievements of sculpture, painting, temple architecture, and ceramics as representations of each artistic tradition, whether native or adapted from foreign sources. Fundamental problems of style and form will be discussed, but aesthetic analysis will always take place within the conditions created by the culture.",
        "offered": true,
        "instructors": "Wolfgram",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/traditions-of-japanese-art",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-73": {
        "id": "vc-73",
        "course_id": "VC 73",
        "name": "Seeing Systems: Critical Research as Visual Art",
        "units": "9 units (3-0-6)",
        "terms": "first",
        "description": "",
        "offered": true,
        "instructors": "American Artist",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/seeing-systems:-critical-research-as-visual-art",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-74": {
        "id": "vc-74",
        "course_id": "VC 74",
        "name": "Imaging Ecological Futures: Visual Art and Ecology",
        "units": "9 units (3-0-6)",
        "terms": "third",
        "description": "",
        "offered": true,
        "instructors": "Segall",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/imaging-ecological-futures:-visual-art-and-ecology",
        "prereq_text": "",
        "prereqs": []
    },
    "vce-81": {
        "id": "vce-81",
        "course_id": "VC/E 81",
        "name": "Careers in STEAM",
        "units": "1 unit (1-0-0)",
        "terms": "second term",
        "description": "A series of weekly seminars by practitioners in industry and academia working at the intersections of science, technology, engineering, art and design. The course can be used to learn more about the different careers in these interdisciplinary areas. Guest speakers will talk about their career trajectory, the nature of their work and the role that science, engineering and/or computing plays in their field. Speakers may include professionals in the fields of investigative science journalism, film/TV, apparel design and manufacturing, architecture, music/sound engineering and editing, art, culture and heritage exhibition and conservation, creative coding, technological art and other areas. Topics will be presented at an informal, introductory level. Graded pass/fail.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Mushkin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/careers-in-steam",
        "prereq_text": "",
        "prereqs": []
    },
    "evc-88": {
        "id": "evc-88",
        "course_id": "E/VC 88",
        "name": "Critical Making",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course examines the concepts and practices of maker culture through hands-on engagement, guest workshops, lectures, reading and discussions on the relations between technology, culture and society. Classes may include digital fabrication, physical computing, and other DIY technologies as well as traditional making. Major writings and practitioners' work may be covered from the study of maker culture, DIY culture, media, critical theory, histories of science, design and art.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Mushkin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/critical-making",
        "prereq_text": "",
        "prereqs": []
    },
    "ehvc-89": {
        "id": "ehvc-89",
        "course_id": "E/H/VC 89",
        "name": "New Media Arts in the 20th and 21st Centuries",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course will examine artists' work with new technology, fabrication methods and media from the late 19th Century to the present. Major artists, exhibitions, and writings of the period will be surveyed. While considering this historical and critical context, students will create their own original new media artworks using technologies and/or fabrication methods they choose. Possible approaches to projects may involve robotics, electronics, computer programming, computer graphics, mechanics and other technologies. Students will be responsible for designing and fabricating their own projects. Topics may include systems in art, the influence of industrialism, digital art, robotics, telematics, media in performance, interactive installation art, and technology in public space. Artists studied may include Eadweard Muybridge, Marcel Duchamp, Vladmir Tatlin, John Cage, Jean Tinguely, Stelarc, Survival Research Laboratories, Lynne Hershman Leeson, Edwardo Kac, Natalie Jeremenjenko, Heath Bunting, Janet Cardiff and others.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Mushkin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/new-media-arts-in-the-20th-and-21st-centuries",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-90": {
        "id": "vc-90",
        "course_id": "VC 90",
        "name": "Reading in Visual Culture",
        "units": "9 units (1-0-8)",
        "terms": "first, second, third terms",
        "description": "An individual program of directed reading in Visual Culture, in areas not covered by regular courses. VC 90 is intended primarily for Visual Culture minors. Interested students should confer with a Visual Culture faculty member and agree upon a topic before registering for the course.",
        "offered": true,
        "instructors": "Faculty, Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/reading-in-visual-culture",
        "prereq_text": "Prerequisites: Instructor's permission.",
        "prereqs": []
    },
    "vch-102": {
        "id": "vch-102",
        "course_id": "VC/H 102",
        "name": "Looking East/Looking West",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "From teapots to pastries, photographs to palanquins, objects and images mediated encounters between people and helped define the \"Orient\" and the \"Occident\". This class looks at the visual and material culture produced by and consumed during encounters between European and Asian travelers, diplomats, artists, writers, and tourists since the eighteenth century.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/looking-east/looking-west",
        "prereq_text": "",
        "prereqs": []
    },
    "lvc-109": {
        "id": "lvc-109",
        "course_id": "L/VC 109",
        "name": "Introduction to 20th-Century French Cinema",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course introduces students to the artistic style and the social, historical, and political content of French films, starting with Méliès and the Lumière brothers and working through surrealism and impressionism, 1930s poetic realism, the Occupation, the New Wave, the Cinema du look, and some critically acclaimed auteurs of the end of the century. The class teaches students to look at film as a medium with its own techniques and formal principles. Conducted in English.",
        "offered": true,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/introduction-to-20th-century-french-cinema",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-110": {
        "id": "envc-110",
        "course_id": "En/VC 110",
        "name": "Sinners, Saints, and Sexuality in Premodern Literature",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This class explores the history of sexuality and gender across the Middle Ages and Renaissance. Exploring both literary texts and visual representation, it considers how previous eras and cultures understood embodiment, sexuality, and gender and asks how we, as modern readers and viewers, approach these questions across the distance of centuries. We will read across a wide range of literature, including theology, philosophy, fiction, romance, and spiritual biography, and examine manuscript illustrations and other early visual media. Questions we will take up include the following: how did writers and artists construct the \"naturalness\" or \"unnaturalness\" of particular bodies and bodily acts? How did individuals understand the relationship between their own bodies and those of others? In what ways did writing and art authorize, scrutinize, or otherwise parse the boundaries of the licit and illicit? Finally, how have modern critics framed these questions? How do we approach and make use of earlier theories of sex and gender?",
        "offered": true,
        "instructors": "Jahner",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/sinners,-saints,-and-sexuality-in-premodern-literature",
        "prereq_text": "",
        "prereqs": []
    },
    "lvc-111": {
        "id": "lvc-111",
        "course_id": "L/VC 111",
        "name": "Introduction to 21st-Century French Cinema",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "L/VC 109 and L/VC 111 are taught in alternate years. This course looks at popular genres (comedy, thriller, animation film) and auteur cinema. It focuses on major trends in contemporary French movies and their relationships to French society (exploration of class, ethnic, gender and sexual identity, etc.). It analyzes the reappropriation of the national heritage, the progressive feminization of the filmmaking profession and the new appearance of directors who are immigrants or children of immigrants. Throughout this class, students will further develop their understanding of the methods and concepts of cinema studies. Conducted in English.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/introduction-to-21st-century-french-cinema",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-116": {
        "id": "envc-116",
        "course_id": "En/VC 116",
        "name": "Picturing the Universe",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "Whether you are a physicist, photographer, or bibliophile, grab a warm jacket. The night sky beckons. In addition to observing and photographing our own starry skies, we will study 19thcentury literary, artistic, and scientific responses to new understandings of the universe as dynamic, decentered, and limitless. In Victorian England, picturing the universe in literature and recording celestial light in photographs defied the physiological limitations of human observation and fueled larger debates about objective evidence and subjective documentation. Prerequisites: students are required to take two First-Year Humanities classes before enrolling in Advanced Humanities.",
        "offered": true,
        "instructors": "Sullivan",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/picturing-the-universe",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-117": {
        "id": "envc-117",
        "course_id": "En/VC 117",
        "name": "The New York School of Poets",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Schneiderman",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/the-new-york-school-of-poets",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-120": {
        "id": "vc-120",
        "course_id": "VC 120",
        "name": "Landscape, Representation and Society",
        "units": "6 units (2-2-2)",
        "terms": "third term",
        "description": "This course examines historical and contemporary representations of the natural world in art and science through a social lens. We will draw upon theory and practices from art, science, geography and landscape studies to critically analyze how artists, explorers, speculators, scientists, military strategists, and local inhabitants use environmental imagery for diverse purposes with sometimes conflicting interests. The course includes projects, lectures, readings, discussions and a 2-day field trip. Students will learn to think critically while developing creative, culturally complex approaches to observing, recording and representing the natural world. Students hoping to combine their course work with a research paper may sign up for a separate independent study and conduct research concurrently, with instructor approval.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Mushkin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/landscape,-representation-and-society",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-129": {
        "id": "envc-129",
        "course_id": "En/VC 129",
        "name": "Literature/Photography/Facticity",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "\"It is the picture of life contrasted with the fact of life, the ideal contrasted with the real, which makes criticism possible,\" insists Frederick Douglass. This course will take an historical approach to the relationship between literature and photography by examining what Douglass refers to as the contrast between \"picture\" and \"fact\" from the advent of photography in the nineteenth century to our present moment. Together, we will think about how each medium creates images, invites different ways of reading or viewing, and makes forms of individual, collective, and political representation possible. We will also examine the ways in which photography and literature shape our understanding of temporality, truth, memory, and history. In addition to our experience of literary and photographic works, theoretical texts on photography will inform the ways of reading and ways of seeing we will develop in this course. Readings may include Boucicault, Douglass, Dunbar, Hartmann, Barthes, Lorde, and Rankine.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/literature/photography/facticity",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-130": {
        "id": "vc-130",
        "course_id": "VC 130",
        "name": "Surveillance",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "This course examines surveillance, one of the defining features of twenty-first-century life, with wide-ranging implications (from intelligence gathering and biometrics to social media and contemporary art), and a key point of intersection between modern technology and visual culture. Though it applies more broadly, the concept of \"surveillance,\" from the Latin vigilare (\"to watch\") and the French surveiller (\"to watch over\"), originated in practices of looking and observation that still define many of its most significant practices today. Building on these etymological roots, we will treat surveillance as, first and foremost, a visual practice and survey the longer history of surveillance (and counter-surveillance) techniques as well as the theories that have emerged to describe its social effects, moral and ethical stakes, and changing legal status.\n Not offered 2022-23.",
        "offered": false,
        "instructors": "Jacobson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/surveillance",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-131": {
        "id": "vc-131",
        "course_id": "VC 131",
        "name": "Visual Culture and the California Environment",
        "units": "",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Jacobson, Mushkin",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/visual-culture-and-the-california-environment",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-135": {
        "id": "envc-135",
        "course_id": "En/VC 135",
        "name": "Dickens's London",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "Charles Dickens and London have perhaps the most famous relationship of any writer and city in English. In this course, we will investigate both the London Dickens knew, and the portrait of the city that he painted, by reading one of Dickens's great mid-career novels alongside a selection of contemporary texts and images and secondary historical sources. We will think about the gap-or overlap- between history and fiction, the idea of the novelist as alternative historian, and the idea of the novel as historical document. Historical topics covered may include: the development of the Victorian police force; plague and public health; Victorian poverty; colonialism and imperialism; Dickens and his illustrators; Victorian exhibition and museum culture; and marriage and the cult of domesticity, among others. Students will practice both textual and visual analysis skills. In addition to written work, students should expect to be responsible for making a short research presentation at some point in the term.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Gilmore",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/dickens's-london",
        "prereq_text": "",
        "prereqs": []
    },
    "lvc-153": {
        "id": "lvc-153",
        "course_id": "L/VC 153",
        "name": "Refugees and Migrants' Visual and Textual Representations",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course focuses on the refugees and migrants' images in documentaries, narrative films, graphic novels, fictional texts, poetic works, and autobiographical narratives. It investigates how these representations participate in the development and strengthening of political discourse. Works by authors such as Hannah Arendt, Antje Ellermann, Achille Mbembe, Martin A. Schain, and Sasha Polakow-Suransky will provide some context to our analysis. Topics discussed in class include the historical and economic relationships of Europe with the refugees and migrants' countries of origin, the rise of anti-immigrant politics and its significance for the future of the European Union, but also its impact on social peace, in France in particular. This course is taught in English and satisfies the advanced humanities requirement.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Orcel",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/refugees-and-migrants'-visual-and-textual-representations",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-160-ab": {
        "id": "envc-160-ab",
        "course_id": "En/VC 160 ab",
        "name": "Classical Hollywood Cinema",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course introduces students to Hollywood films and filmmaking during the classical period, from the coming of sound through the '50s. Students will develop the techniques and vocabulary appropriate to the distinct formal properties of film. Topics include the rise and collapse of the studio system, technical transformations (sound, color, deep focus), genre (the musical, the melodrama), cultural contexts (the Depression, World War II, the Cold War), audience responses, and the economic history of the film corporations. Terms may be taken independently. Part a covers the period 1927-1940. Part b covers 1941-1960.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Jurca",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/classical-hollywood-cinema",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-161": {
        "id": "envc-161",
        "course_id": "En/VC 161",
        "name": "The New Hollywood",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "This course examines the post-classical era of Hollywood filmmaking with a focus on the late 1960s through the 1970s, a period of significant formal and thematic experimentation. We will study American culture and politics as well as film in this era, as we consider the relation between broader social transformations and the development of new narrative conventions and cinematic techniques. We will pay particular attention to the changing film industry and its influence on this body of work. Films covered may includeBonnie and Clyde,The Graduate,The Godfather,Taxi Driver, andJaws.",
        "offered": true,
        "instructors": "Jurca",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/the-new-hollywood",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-162": {
        "id": "vc-162",
        "course_id": "VC 162",
        "name": "Data, Algorithms and Society",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "",
        "offered": true,
        "instructors": "Mushkin, Ralph",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/data,-algorithms-and-society",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-169": {
        "id": "vc-169",
        "course_id": "VC 169",
        "name": "The Arts of Dynastic China",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "A survey of the development of Chinese art in which the major achievements in architecture, sculpture, painting, calligraphy, and ceramics will be studied in their cultural contexts from prehistory through the Manchu domination of the Qing Dynasty (1644-1911). Emphasis will be placed on the aesthetic appreciation of Chinese art as molded by the philosophies, religions, and history of China.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Wolfgram",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/the-arts-of-dynastic-china",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-170": {
        "id": "vc-170",
        "course_id": "VC 170",
        "name": "Special Topics in Visual Culture",
        "units": "9 units (3-0-6)",
        "terms": "offered by announcement",
        "description": "An advanced humanities course on a special topic in visual culture. Topics may include art history, film, digital and print media, architecture, photography or cartography. It is usually taught by new or visiting faculty. The course may be re-taken for credit except as noted in the course announcement. Limited to 15 students. See registrar's announcement for details.",
        "offered": true,
        "instructors": "Staff",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/special-topics-in-visual-culture",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-171": {
        "id": "vc-171",
        "course_id": "VC 171",
        "name": "Arts of Buddhism",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "An examination of the impact of Buddhism on the arts and cultures of India, Southeast Asia, China, Korea, and Japan from its earliest imagery in the 4th century B.C.E. India through various doctrinal transformations to the Zen revival of 18th-century Japan. Select monuments of Buddhist art, including architecture, painting, sculpture, and ritual objects, will serve as focal points for discussions on their aesthetic principles and for explorations into the religious, social, and cultural contexts that underlie their creation.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Wolfgram",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/arts-of-buddhism",
        "prereq_text": "",
        "prereqs": []
    },
    "envc-172": {
        "id": "envc-172",
        "course_id": "En/VC 172",
        "name": "Heritage and Its Discontents",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Jurca",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/heritage-and-its-discontents",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-175": {
        "id": "vc-175",
        "course_id": "VC 175",
        "name": "The Art of Science",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course examines the frequent and significant encounters between what chemist/novelist C.P. Snow famously dubbed the \"two cultures\"-the sciences and the humanities-with an emphasis on forms and practices of visual culture that blur the boundaries between science, technology, and art. What role, we will ask, have visual culture and visuality played in the construction of scientific knowledge? Taking a broad historical and geographical approach, we will explore topics including representations of science and technology in the arts and popular culture; the use of photography, illustration, and visualization in the sciences; histories of visuality and visual devices; and the everyday visual practices of scientific inquiry.",
        "offered": true,
        "instructors": "Jacobson",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/the-art-of-science",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-176": {
        "id": "vc-176",
        "course_id": "VC 176",
        "name": "Representation Matters?",
        "units": "9 units (3-0-6)",
        "terms": "first term",
        "description": "",
        "offered": true,
        "instructors": "Stielau",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/representation-matters?",
        "prereq_text": "",
        "prereqs": []
    },
    "vc-177": {
        "id": "vc-177",
        "course_id": "VC 177",
        "name": "Other Photographies",
        "units": "9 units (3-0-6)",
        "terms": "third term",
        "description": "",
        "offered": true,
        "instructors": "Stielau",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/other-photographies",
        "prereq_text": "",
        "prereqs": []
    },
    "hhpsvc-185": {
        "id": "hhpsvc-185",
        "course_id": "H/HPS/VC 185",
        "name": "Angels and Monsters: Cosmology, Anthropology, and the Ends of the World",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course explores late medieval European understandings of the origins, structure, and workings of the cosmos in the realms of theology, physics, astronomy, astrology, magic, and medicine. Attention is given to the position of humans as cultural creatures at the intersection of nature and spirit; as well as to the place of Christian Europeans in relation to non-Christians and other categories of outsiders within and beyond Europe. We will examine the knowledge system that anticipated racializing theories in the West.",
        "offered": true,
        "instructors": "Wey-Gomez",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/angels-and-monsters:-cosmology,-anthropology,-and-the-ends-of-the-world",
        "prereq_text": "",
        "prereqs": []
    },
    "hhpsvc-186": {
        "id": "hhpsvc-186",
        "course_id": "H/HPS/VC 186",
        "name": "From Plato to Pluto: Maps, Exploration and Culture from Antiquity to the Present",
        "units": "9 units (3-0-6)",
        "terms": "second term",
        "description": "This course covers a broad range of topics in the history of maps and exploration from Antiquity to the present. These topics range from the earliest visualizations of earth and space in the Classical world to contemporary techniques in interplanetary navigation. By way of maps, students will explore various ways in which different cultures have conceptualized and navigated earth and space. While maps emulate the world as perceived by the human eye, they, in fact, comprise a set of observations and perceptions of the relationship between bodies in space and time. Thus, students will study maps, and the exploration they enable, as windows to the cultures that have produced them, not only as scientific and technical artifacts to measure and navigate our world.\n Not offered 2024-25.",
        "offered": false,
        "instructors": "Wey-Gomez",
        "link": "https://www.catalog.caltech.edu/current/2024-25/department/vc/from-plato-to-pluto:-maps,-exploration-and-culture-from-antiquity-to-the-present",
        "prereq_text": "",
        "prereqs": []
    }
}